{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/0a4f6091-223b-41f6-8743-f322ec84930b')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/0a4f6091-223b-41f6-8743-f322ec84930b')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Suspicious GUP Usage",
                "description": "Detects execution of the Notepad++ updater in a suspicious directory, which is often used in DLL side-loading attacks; Author: Florian Roth (Nextron Systems); Source URL: process_creation/proc_creation_win_gup_suspicious_execution.yml; Status: test; False Positives: Execution of tools named GUP.exe and located in folders different than Notepad++\\updater; References: https://www.fireeye.com/blog/threat-research/2018/09/apt10-targeting-japanese-corporations-using-updated-ttps.html",
                "severity": "high",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\GUP.exe\" and (not ((TargetProcessName endswith \"\\\\Program Files\\\\Notepad++\\\\updater\\\\GUP.exe\" or TargetProcessName endswith \"\\\\Program Files (x86)\\\\Notepad++\\\\updater\\\\GUP.exe\") or (TargetProcessName contains \"\\\\Users\\\\\" and (TargetProcessName endswith \"\\\\AppData\\\\Local\\\\Notepad++\\\\updater\\\\GUP.exe\" or TargetProcessName endswith \"\\\\AppData\\\\Roaming\\\\Notepad++\\\\updater\\\\GUP.exe\")))))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["defense_evasion", "t1574.002"],
                "techniques": [],
                "alertRuleTemplateName": "0a4f6091-223b-41f6-8743-f322ec84930b",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}