{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/0a98a10c-685d-4ab0-bddc-b6bdd1d48458')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/0a98a10c-685d-4ab0-bddc-b6bdd1d48458')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Uncommon Userinit Child Process",
                "description": "Detects uncommon \"userinit.exe\" child processes, which could be a sign of uncommon shells or login scripts used for persistence.; Author: Tom Ueltschi (@c_APT_ure), Tim Shelton; Source URL: process_creation/proc_creation_win_userinit_uncommon_child_processes.yml; Status: test; False Positives: Legitimate logon scripts or custom shells may trigger false positives. Apply additional filters accordingly.; References: https://cocomelonc.github.io/persistence/2022/12/09/malware-pers-20.html, https://learn.microsoft.com/en-us/windows-server/administration/server-core/server-core-sconfig#powershell-is-the-default-shell-on-server-core",
                "severity": "high",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\userinit.exe\" and (not TargetProcessName =~ \"C:\\\\WINDOWS\\\\explorer.exe\") and (not ((TargetProcessCommandLine contains \"netlogon.bat\" or TargetProcessCommandLine contains \"UsrLogon.cmd\") or TargetProcessCommandLine =~ \"PowerShell.exe\" or (TargetProcessName =~ \"C:\\\\Windows\\\\System32\\\\proquota.exe\" or TargetProcessName =~ \"C:\\\\Windows\\\\SysWOW64\\\\proquota.exe\") or TargetProcessName endswith \"\\\\Citrix\\\\System32\\\\icast.exe\" or isnull(TargetProcessName))))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Persistence", "PrivilegeEscalation"],
                "techniques": ["T1037"],
                "alertRuleTemplateName": "0a98a10c-685d-4ab0-bddc-b6bdd1d48458",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}