{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/0d5675be-bc88-4172-86d3-1e96a4476536')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/0d5675be-bc88-4172-86d3-1e96a4476536')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Potential Tampering With RDP Related Registry Keys Via Reg.EXE",
                "description": "Detects the execution of \"reg.exe\" for enabling/disabling the RDP service on the host by tampering with the 'CurrentControlSet\\Control\\Terminal Server' values; Author: pH-T (Nextron Systems), @Kostastsale, @TheDFIRReport; Source URL: process_creation/proc_creation_win_reg_rdp_keys_tamper.yml; Status: experimental; False Positives: Unknown; References: https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/",
                "severity": "high",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\reg.exe\" or TargetProcessFilename =~ \"reg.exe\") and (TargetProcessCommandLine contains \" add \" and TargetProcessCommandLine contains \"\\\\CurrentControlSet\\\\Control\\\\Terminal Server\" and TargetProcessCommandLine contains \"REG_DWORD\" and TargetProcessCommandLine contains \" /f\")) and ((TargetProcessCommandLine contains \"Licensing Core\" and TargetProcessCommandLine contains \"EnableConcurrentSessions\") or (TargetProcessCommandLine contains \"WinStations\\\\RDP-Tcp\" or TargetProcessCommandLine contains \"MaxInstanceCount\" or TargetProcessCommandLine contains \"fEnableWinStation\" or TargetProcessCommandLine contains \"TSUserEnabled\" or TargetProcessCommandLine contains \"TSEnabled\" or TargetProcessCommandLine contains \"TSAppCompat\" or TargetProcessCommandLine contains \"IdleWinStationPoolCount\" or TargetProcessCommandLine contains \"TSAdvertise\" or TargetProcessCommandLine contains \"AllowTSConnections\" or TargetProcessCommandLine contains \"fSingleSessionPerUser\" or TargetProcessCommandLine contains \"fDenyTSConnections\")))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "LateralMovement"],
                "techniques": ["T1112", "T1021"],
                "alertRuleTemplateName": "0d5675be-bc88-4172-86d3-1e96a4476536",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}