{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/1816994b-42e1-4fb1-afd2-134d88184f71')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/1816994b-42e1-4fb1-afd2-134d88184f71')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "PowerShell Base64 Encoded WMI Classes",
                "description": "Detects calls to base64 encoded WMI class such as \"Win32_Shadowcopy\", \"Win32_ScheduledJob\", etc.\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_base64_wmi_classes.yml\nAuthor: Christian Burkard (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)\nDate Modified: None\nStatus: experimental\nReferences: https://github.com/Neo23x0/Raccine/blob/20a569fa21625086433dcce8bb2765d0ea08dcb6/yara/mal_revil.yar\nFalse Positives: Unknown",
                "severity": "high",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and ((TargetProcessCommandLine contains \"VwBpAG4AMwAyAF8AUwBoAGEAZABvAHcAYwBvAHAAeQ\" or TargetProcessCommandLine contains \"cAaQBuADMAMgBfAFMAaABhAGQAbwB3AGMAbwBwAHkA\" or TargetProcessCommandLine contains \"XAGkAbgAzADIAXwBTAGgAYQBkAG8AdwBjAG8AcAB5A\" or TargetProcessCommandLine contains \"V2luMzJfU2hhZG93Y29we\" or TargetProcessCommandLine contains \"dpbjMyX1NoYWRvd2NvcH\" or TargetProcessCommandLine contains \"XaW4zMl9TaGFkb3djb3B5\") or (TargetProcessCommandLine contains \"VwBpAG4AMwAyAF8AUwBjAGgAZQBkAHUAbABlAGQASgBvAGIA\" or TargetProcessCommandLine contains \"cAaQBuADMAMgBfAFMAYwBoAGUAZAB1AGwAZQBkAEoAbwBiA\" or TargetProcessCommandLine contains \"XAGkAbgAzADIAXwBTAGMAaABlAGQAdQBsAGUAZABKAG8AYg\" or TargetProcessCommandLine contains \"V2luMzJfU2NoZWR1bGVkSm9i\" or TargetProcessCommandLine contains \"dpbjMyX1NjaGVkdWxlZEpvY\" or TargetProcessCommandLine contains \"XaW4zMl9TY2hlZHVsZWRKb2\") or (TargetProcessCommandLine contains \"VwBpAG4AMwAyAF8AUAByAG8AYwBlAHMAcw\" or TargetProcessCommandLine contains \"cAaQBuADMAMgBfAFAAcgBvAGMAZQBzAHMA\" or TargetProcessCommandLine contains \"XAGkAbgAzADIAXwBQAHIAbwBjAGUAcwBzA\" or TargetProcessCommandLine contains \"V2luMzJfUHJvY2Vzc\" or TargetProcessCommandLine contains \"dpbjMyX1Byb2Nlc3\" or TargetProcessCommandLine contains \"XaW4zMl9Qcm9jZXNz\") or (TargetProcessCommandLine contains \"VwBpAG4AMwAyAF8AVQBzAGUAcgBBAGMAYwBvAHUAbgB0A\" or TargetProcessCommandLine contains \"cAaQBuADMAMgBfAFUAcwBlAHIAQQBjAGMAbwB1AG4AdA\" or TargetProcessCommandLine contains \"XAGkAbgAzADIAXwBVAHMAZQByAEEAYwBjAG8AdQBuAHQA\" or TargetProcessCommandLine contains \"V2luMzJfVXNlckFjY291bn\" or TargetProcessCommandLine contains \"dpbjMyX1VzZXJBY2NvdW50\" or TargetProcessCommandLine contains \"XaW4zMl9Vc2VyQWNjb3Vud\") or (TargetProcessCommandLine contains \"VwBpAG4AMwAyAF8ATABvAGcAZwBlAGQATwBuAFUAcwBlAHIA\" or TargetProcessCommandLine contains \"cAaQBuADMAMgBfAEwAbwBnAGcAZQBkAE8AbgBVAHMAZQByA\" or TargetProcessCommandLine contains \"XAGkAbgAzADIAXwBMAG8AZwBnAGUAZABPAG4AVQBzAGUAcg\" or TargetProcessCommandLine contains \"V2luMzJfTG9nZ2VkT25Vc2Vy\" or TargetProcessCommandLine contains \"dpbjMyX0xvZ2dlZE9uVXNlc\" or TargetProcessCommandLine contains \"XaW4zMl9Mb2dnZWRPblVzZX\")))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "Execution"],
                "techniques": ["T1059", "T1027"],
                "alertRuleTemplateName": "1816994b-42e1-4fb1-afd2-134d88184f71",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}