{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/1cdd9a09-06c9-4769-99ff-626e2b3991b8')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/1cdd9a09-06c9-4769-99ff-626e2b3991b8')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Suspicious Double Extension File Execution",
                "description": "Detects suspicious use of an .exe extension after a non-executable file extension like .pdf.exe, a set of spaces or underlines to cloak the executable file in spear phishing campaigns\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_double_extension.yml\nAuthor: Florian Roth (Nextron Systems), @blu3_team (idea), Nasreddine Bencherchali (Nextron Systems)\nDate Modified: 2023-02-28\nStatus: stable\nReferences: https://blu3-team.blogspot.com/2019/06/misleading-extensions-xlsexe-docexe.html, https://twitter.com/blackorbird/status/1140519090961825792\nFalse Positives: Unknown",
                "severity": "critical",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where ((TargetProcessName endswith \".doc.exe\" or TargetProcessName endswith \".docx.exe\" or TargetProcessName endswith \".xls.exe\" or TargetProcessName endswith \".xlsx.exe\" or TargetProcessName endswith \".ppt.exe\" or TargetProcessName endswith \".pptx.exe\" or TargetProcessName endswith \".rtf.exe\" or TargetProcessName endswith \".pdf.exe\" or TargetProcessName endswith \".txt.exe\" or TargetProcessName endswith \"      .exe\" or TargetProcessName endswith \"______.exe\" or TargetProcessName endswith \".doc.js\" or TargetProcessName endswith \".docx.js\" or TargetProcessName endswith \".xls.js\" or TargetProcessName endswith \".xlsx.js\" or TargetProcessName endswith \".ppt.js\" or TargetProcessName endswith \".pptx.js\" or TargetProcessName endswith \".rtf.js\" or TargetProcessName endswith \".pdf.js\" or TargetProcessName endswith \".txt.js\") and (TargetProcessCommandLine contains \".doc.exe\" or TargetProcessCommandLine contains \".docx.exe\" or TargetProcessCommandLine contains \".xls.exe\" or TargetProcessCommandLine contains \".xlsx.exe\" or TargetProcessCommandLine contains \".ppt.exe\" or TargetProcessCommandLine contains \".pptx.exe\" or TargetProcessCommandLine contains \".rtf.exe\" or TargetProcessCommandLine contains \".pdf.exe\" or TargetProcessCommandLine contains \".txt.exe\" or TargetProcessCommandLine contains \"      .exe\" or TargetProcessCommandLine contains \"______.exe\" or TargetProcessCommandLine contains \".doc.js\" or TargetProcessCommandLine contains \".docx.js\" or TargetProcessCommandLine contains \".xls.js\" or TargetProcessCommandLine contains \".xlsx.js\" or TargetProcessCommandLine contains \".ppt.js\" or TargetProcessCommandLine contains \".pptx.js\" or TargetProcessCommandLine contains \".rtf.js\" or TargetProcessCommandLine contains \".pdf.js\" or TargetProcessCommandLine contains \".txt.js\"))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["InitialAccess"],
                "techniques": ["T1566"],
                "alertRuleTemplateName": "1cdd9a09-06c9-4769-99ff-626e2b3991b8",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}