{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/2617e7ed-adb7-40ba-b0f3-8f9945fe6c09')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/2617e7ed-adb7-40ba-b0f3-8f9945fe6c09')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Suspicious SYSTEM User Process Creation",
                "description": "Detects a suspicious process creation as SYSTEM user (suspicious program or command line parameter)\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_system_user_anomaly.yml\nAuthor: Florian Roth (Nextron Systems), David ANDRE (additional keywords)\nDate Modified: 2023-01-19\nStatus: test\nReferences: Internal Research, https://tools.thehacker.recipes/mimikatz/modules\nFalse Positives: Administrative activity, Scripts and administrative tools used in the monitored environment, Monitoring activity",
                "severity": "high",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where (((TargetProcessIntegrityLevel =~ \"System\" and (TargetUsername contains \"AUTHORI\" or TargetUsername contains \"AUTORI\")) and ((TargetProcessName endswith \"\\\\calc.exe\" or TargetProcessName endswith \"\\\\wscript.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\hh.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\forfiles.exe\" or TargetProcessName endswith \"\\\\ping.exe\") or (TargetProcessCommandLine contains \" -NoP \" or TargetProcessCommandLine contains \" -W Hidden \" or TargetProcessCommandLine contains \" -decode \" or TargetProcessCommandLine contains \" /decode \" or TargetProcessCommandLine contains \" /urlcache \" or TargetProcessCommandLine contains \" -urlcache \" or TargetProcessCommandLine match \" -e JAB\" or TargetProcessCommandLine match \" -e SUVYI\" or TargetProcessCommandLine match \" -e SQBFAFgA\" or TargetProcessCommandLine match \" -e aWV4I\" or TargetProcessCommandLine match \" -e IAB\" or TargetProcessCommandLine match \" -e PAA\" or TargetProcessCommandLine match \" -e aQBlAHgA\" or TargetProcessCommandLine contains \"vssadmin delete shadows\" or TargetProcessCommandLine contains \"reg SAVE HKLM\" or TargetProcessCommandLine contains \" -ma \" or TargetProcessCommandLine contains \"Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\" or TargetProcessCommandLine contains \".downloadstring(\" or TargetProcessCommandLine contains \".downloadfile(\" or TargetProcessCommandLine contains \" /ticket:\" or TargetProcessCommandLine contains \"dpapi::\" or TargetProcessCommandLine contains \"event::clear\" or TargetProcessCommandLine contains \"event::drop\" or TargetProcessCommandLine contains \"id::modify\" or TargetProcessCommandLine contains \"kerberos::\" or TargetProcessCommandLine contains \"lsadump::\" or TargetProcessCommandLine contains \"misc::\" or TargetProcessCommandLine contains \"privilege::\" or TargetProcessCommandLine contains \"rpc::\" or TargetProcessCommandLine contains \"sekurlsa::\" or TargetProcessCommandLine contains \"sid::\" or TargetProcessCommandLine contains \"token::\" or TargetProcessCommandLine contains \"vault::cred\" or TargetProcessCommandLine contains \"vault::list\" or TargetProcessCommandLine contains \" p::d \" or TargetProcessCommandLine contains \";iex(\" or TargetProcessCommandLine contains \"MiniDump\" or TargetProcessCommandLine contains \"net user \"))) and (not((TargetProcessCommandLine =~ \"ping 127.0.0.1 -n 5\" or (TargetProcessName endswith \"\\\\PING.EXE\" and ActingProcessCommandLine contains \"\\\\DismFoDInstall.cmd\") or ActingProcessName startswith \"C:\\\\Packages\\\\Plugins\\\\Microsoft.GuestConfiguration.ConfigurationforWindows\\\\\" or (ActingProcessName startswith \"C:\\\\Program Files (x86)\\\\Java\\\\\" and ActingProcessName endswith \"\\\\bin\\\\javaws.exe\" and TargetProcessName startswith \"C:\\\\Program Files (x86)\\\\Java\\\\\" and TargetProcessName endswith \"\\\\bin\\\\jp2launcher.exe\" and TargetProcessCommandLine contains \" -ma \")))))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "PrivilegeEscalation", "CredentialAccess"],
                "techniques": ["T1027", "T1003", "T1134"],
                "alertRuleTemplateName": "2617e7ed-adb7-40ba-b0f3-8f9945fe6c09",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}