{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/2dd2c217-bf68-437a-b57c-fe9fd01d5de8')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/2dd2c217-bf68-437a-b57c-fe9fd01d5de8')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Potentially Suspicious Regsvr32 HTTP IP Pattern",
                "description": "Detects regsvr32 execution to download and install DLLs located remotely where the address is an IP address.\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_regsvr32_http_ip_pattern.yml\nAuthor: Florian Roth (Nextron Systems)\nDate Modified: 2023-05-24\nStatus: experimental\nReferences: https://twitter.com/mrd0x/status/1461041276514623491, https://twitter.com/tccontre18/status/1480950986650832903, https://lolbas-project.github.io/lolbas/Binaries/Regsvr32/\nFalse Positives: FQDNs that start with a number such as \"7-Zip\"",
                "severity": "high",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessFilename =~ \"REGSVR32.EXE\") and (TargetProcessCommandLine contains \" /i:http://1\" or TargetProcessCommandLine contains \" /i:http://2\" or TargetProcessCommandLine contains \" /i:http://3\" or TargetProcessCommandLine contains \" /i:http://4\" or TargetProcessCommandLine contains \" /i:http://5\" or TargetProcessCommandLine contains \" /i:http://6\" or TargetProcessCommandLine contains \" /i:http://7\" or TargetProcessCommandLine contains \" /i:http://8\" or TargetProcessCommandLine contains \" /i:http://9\" or TargetProcessCommandLine contains \" /i:https://1\" or TargetProcessCommandLine contains \" /i:https://2\" or TargetProcessCommandLine contains \" /i:https://3\" or TargetProcessCommandLine contains \" /i:https://4\" or TargetProcessCommandLine contains \" /i:https://5\" or TargetProcessCommandLine contains \" /i:https://6\" or TargetProcessCommandLine contains \" /i:https://7\" or TargetProcessCommandLine contains \" /i:https://8\" or TargetProcessCommandLine contains \" /i:https://9\" or TargetProcessCommandLine contains \" -i:http://1\" or TargetProcessCommandLine contains \" -i:http://2\" or TargetProcessCommandLine contains \" -i:http://3\" or TargetProcessCommandLine contains \" -i:http://4\" or TargetProcessCommandLine contains \" -i:http://5\" or TargetProcessCommandLine contains \" -i:http://6\" or TargetProcessCommandLine contains \" -i:http://7\" or TargetProcessCommandLine contains \" -i:http://8\" or TargetProcessCommandLine contains \" -i:http://9\" or TargetProcessCommandLine contains \" -i:https://1\" or TargetProcessCommandLine contains \" -i:https://2\" or TargetProcessCommandLine contains \" -i:https://3\" or TargetProcessCommandLine contains \" -i:https://4\" or TargetProcessCommandLine contains \" -i:https://5\" or TargetProcessCommandLine contains \" -i:https://6\" or TargetProcessCommandLine contains \" -i:https://7\" or TargetProcessCommandLine contains \" -i:https://8\" or TargetProcessCommandLine contains \" -i:https://9\"))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion"],
                "techniques": ["T1218"],
                "alertRuleTemplateName": "2dd2c217-bf68-437a-b57c-fe9fd01d5de8",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}