{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/327ff235-94eb-4f06-b9de-aaee571324be')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/327ff235-94eb-4f06-b9de-aaee571324be')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Regsvr32 Execution From Highly Suspicious Location",
                "description": "Detects execution of regsvr32 where the DLL is located in a highly suspicious locations\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_regsvr32_susp_exec_path_2.yml\nAuthor: Nasreddine Bencherchali (Nextron Systems)\nDate Modified: None\nStatus: experimental\nReferences: Internal Research\nFalse Positives: Unlikely",
                "severity": "high",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessFilename =~ \"REGSVR32.EXE\") and ((TargetProcessCommandLine contains \":\\\\PerfLogs\\\\\" or TargetProcessCommandLine contains \":\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\Registration\\\\CRMLog\" or TargetProcessCommandLine contains \"\\\\Windows\\\\System32\\\\com\\\\dmp\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\System32\\\\FxsTmp\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\System32\\\\Microsoft\\\\Crypto\\\\RSA\\\\MachineKeys\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\color\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\System32\\\\spool\\\\PRINTERS\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\System32\\\\spool\\\\SERVERS\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\System32\\\\Tasks_Migrated\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\System32\\\\Tasks\\\\Microsoft\\\\Windows\\\\SyncCenter\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\SysWOW64\\\\com\\\\dmp\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\SysWOW64\\\\FxsTmp\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\SysWOW64\\\\Tasks\\\\Microsoft\\\\Windows\\\\PLA\\\\System\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\SysWOW64\\\\Tasks\\\\Microsoft\\\\Windows\\\\SyncCenter\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\Tasks\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\Tracing\\\\\") or ((TargetProcessCommandLine contains \" \\\"C:\\\\\" or TargetProcessCommandLine contains \" C:\\\\\" or TargetProcessCommandLine contains \" 'C:\\\\\" or TargetProcessCommandLine contains \"D:\\\\\") and (not((TargetProcessCommandLine contains \"C:\\\\Program Files (x86)\\\\\" or TargetProcessCommandLine contains \"C:\\\\Program Files\\\\\" or TargetProcessCommandLine contains \"C:\\\\ProgramData\\\\\" or TargetProcessCommandLine contains \"C:\\\\Users\\\\\" or TargetProcessCommandLine contains \" C:\\\\Windows\\\\\" or TargetProcessCommandLine contains \" \\\"C:\\\\Windows\\\\\" or TargetProcessCommandLine contains \" 'C:\\\\Windows\\\\\"))))) and (not((TargetProcessCommandLine =~ \"\" or isnull(TargetProcessCommandLine)))))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion"],
                "techniques": ["T1218"],
                "alertRuleTemplateName": "327ff235-94eb-4f06-b9de-aaee571324be",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}