{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/32e280f1-8ad4-46ef-9e80-910657611fbc')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/32e280f1-8ad4-46ef-9e80-910657611fbc')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Potential Homoglyph Attack Using Lookalike Characters",
                "description": "Detects the presence of unicode characters which are homoglyphs, or identical in appearance, to ASCII letter characters.\nThis is used as an obfuscation and masquerading techniques. Only \"perfect\" homoglyphs are included; these are characters that\nare indistinguishable from ASCII characters and thus may make excellent candidates for homoglyph attack characters.\n\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_homoglyph_cyrillic_lookalikes.yml\nAuthor: Micah Babinski, @micahbabinski\nDate Modified: None\nStatus: experimental\nReferences: https://redcanary.com/threat-detection-report/threats/socgholish/#threat-socgholish, http://www.irongeek.com/homoglyph-attack-generator.php\nFalse Positives: Commandlines with legitimate Cyrillic text; will likely require tuning (or not be usable) in countries where these alphabets are in use.",
                "severity": "medium",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"\u0410\" or TargetProcessCommandLine contains \"\u0412\" or TargetProcessCommandLine contains \"\u0415\" or TargetProcessCommandLine contains \"\u041a\" or TargetProcessCommandLine contains \"\u041c\" or TargetProcessCommandLine contains \"\u041d\" or TargetProcessCommandLine contains \"\u041e\" or TargetProcessCommandLine contains \"\u0420\" or TargetProcessCommandLine contains \"\u0421\" or TargetProcessCommandLine contains \"\u0422\" or TargetProcessCommandLine contains \"\u0425\" or TargetProcessCommandLine contains \"\u0405\" or TargetProcessCommandLine contains \"\u0406\" or TargetProcessCommandLine contains \"\u0408\" or TargetProcessCommandLine contains \"\u04ae\" or TargetProcessCommandLine contains \"\u04c0\" or TargetProcessCommandLine contains \"\u050c\" or TargetProcessCommandLine contains \"\u051a\" or TargetProcessCommandLine contains \"\u051c\" or TargetProcessCommandLine contains \"\u0391\" or TargetProcessCommandLine contains \"\u0392\" or TargetProcessCommandLine contains \"\u0395\" or TargetProcessCommandLine contains \"\u0396\" or TargetProcessCommandLine contains \"\u0397\" or TargetProcessCommandLine contains \"\u0399\" or TargetProcessCommandLine contains \"\u039a\" or TargetProcessCommandLine contains \"\u039c\" or TargetProcessCommandLine contains \"\u039d\" or TargetProcessCommandLine contains \"\u039f\" or TargetProcessCommandLine contains \"\u03a1\" or TargetProcessCommandLine contains \"\u03a4\" or TargetProcessCommandLine contains \"\u03a5\" or TargetProcessCommandLine contains \"\u03a7\") or (TargetProcessCommandLine contains \"\u0430\" or TargetProcessCommandLine contains \"\u0435\" or TargetProcessCommandLine contains \"\u043e\" or TargetProcessCommandLine contains \"\u0440\" or TargetProcessCommandLine contains \"\u0441\" or TargetProcessCommandLine contains \"\u0445\" or TargetProcessCommandLine contains \"\u0455\" or TargetProcessCommandLine contains \"\u0456\" or TargetProcessCommandLine contains \"\u04cf\" or TargetProcessCommandLine contains \"\u0458\" or TargetProcessCommandLine contains \"\u04bb\" or TargetProcessCommandLine contains \"\u0501\" or TargetProcessCommandLine contains \"\u051b\" or TargetProcessCommandLine contains \"\u051d\" or TargetProcessCommandLine contains \"\u03bf\"))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion"],
                "techniques": ["T1036"],
                "alertRuleTemplateName": "32e280f1-8ad4-46ef-9e80-910657611fbc",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}