{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/349d891d-fef0-4fe4-bc53-eee623a15969')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/349d891d-fef0-4fe4-bc53-eee623a15969')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Use Short Name Path in Command Line",
                "description": "Detect use of the Windows 8.3 short name. Which could be used as a method to avoid command-line detection\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_ntfs_short_name_path_use_cli.yml\nAuthor: frack113, Nasreddine Bencherchali\nDate Modified: 2022-10-26\nStatus: test\nReferences: https://www.acunetix.com/blog/articles/windows-short-8-3-filenames-web-security-problem/, https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-2000-server/cc959352(v=technet.10)?redirectedfrom=MSDN, https://twitter.com/frack113/status/1555830623633375232\nFalse Positives: Applications could use this notation occasionally which might generate some false positives. In that case investigate the parent and child process.",
                "severity": "medium",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"~1\\\\\" or TargetProcessCommandLine contains \"~2\\\\\") and (not(((ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\Dism.exe\" or ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\cleanmgr.exe\" or ActingProcessName =~ \"C:\\\\Program Files\\\\GPSoftware\\\\Directory Opus\\\\dopus.exe\") or (ActingProcessName endswith \"\\\\WebEx\\\\WebexHost.exe\" or ActingProcessName endswith \"\\\\thor\\\\thor64.exe\" or ActingProcessName endswith \"\\\\veam.backup.shell.exe\" or ActingProcessName endswith \"\\\\winget.exe\" or ActingProcessName endswith \"\\\\Everything\\\\Everything.exe\") or ActingProcessName contains \"\\\\AppData\\\\Local\\\\Temp\\\\WinGet\\\\\" or (TargetProcessCommandLine contains \"\\\\appdata\\\\local\\\\webex\\\\webex64\\\\meetings\\\\wbxreport.exe\" or TargetProcessCommandLine contains \"C:\\\\Program Files\\\\Git\\\\post-install.bat\" or TargetProcessCommandLine contains \"C:\\\\Program Files\\\\Git\\\\cmd\\\\scalar.exe\")))))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion"],
                "techniques": ["T1564"],
                "alertRuleTemplateName": "349d891d-fef0-4fe4-bc53-eee623a15969",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}