{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/3ef5605c-9eb9-47b0-9a71-b727e6aa5c3b')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/3ef5605c-9eb9-47b0-9a71-b727e6aa5c3b')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Use NTFS Short Name in Image",
                "description": "Detect use of the Windows 8.3 short name. Which could be used as a method to avoid Image based detection\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_ntfs_short_name_use_image.yml\nAuthor: frack113, Nasreddine Bencherchali (Nextron Systems)\nDate Modified: 2023-07-20\nStatus: experimental\nReferences: https://www.acunetix.com/blog/articles/windows-short-8-3-filenames-web-security-problem/, https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-2000-server/cc959352(v=technet.10)?redirectedfrom=MSDN, https://twitter.com/jonasLyk/status/1555914501802921984\nFalse Positives: Software Installers",
                "severity": "medium",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where ((TargetProcessName contains \"~1.bat\" or TargetProcessName contains \"~1.dll\" or TargetProcessName contains \"~1.exe\" or TargetProcessName contains \"~1.hta\" or TargetProcessName contains \"~1.js\" or TargetProcessName contains \"~1.msi\" or TargetProcessName contains \"~1.ps1\" or TargetProcessName contains \"~1.tmp\" or TargetProcessName contains \"~1.vbe\" or TargetProcessName contains \"~1.vbs\" or TargetProcessName contains \"~2.bat\" or TargetProcessName contains \"~2.dll\" or TargetProcessName contains \"~2.exe\" or TargetProcessName contains \"~2.hta\" or TargetProcessName contains \"~2.js\" or TargetProcessName contains \"~2.msi\" or TargetProcessName contains \"~2.ps1\" or TargetProcessName contains \"~2.tmp\" or TargetProcessName contains \"~2.vbe\" or TargetProcessName contains \"~2.vbs\") and (not(ActingProcessName =~ \"C:\\\\Windows\\\\explorer.exe\")) and (not((ActingProcessName endswith \"\\\\WebEx\\\\WebexHost.exe\" or ActingProcessName endswith \"\\\\thor\\\\thor64.exe\" or TargetProcessName =~ \"C:\\\\PROGRA~1\\\\WinZip\\\\WZPREL~1.EXE\" or TargetProcessName endswith \"\\\\VCREDI~1.EXE\"))))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion"],
                "techniques": ["T1564"],
                "alertRuleTemplateName": "3ef5605c-9eb9-47b0-9a71-b727e6aa5c3b",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}