{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/42a5f1e7-9603-4f6d-97ae-3f37d130d794')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/42a5f1e7-9603-4f6d-97ae-3f37d130d794')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Suspicious File Downloaded From File-Sharing Website Via Certutil.EXE",
                "description": "Detects the execution of certutil with certain flags that allow the utility to download files from file-sharing websites.\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_certutil_download_file_sharing_domains.yml\nAuthor: Nasreddine Bencherchali (Nextron Systems)\nDate Modified: 2023-08-17\nStatus: experimental\nReferences: https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/certutil, https://forensicitguy.github.io/agenttesla-vba-certutil-download/, https://news.sophos.com/en-us/2021/04/13/compromised-exchange-server-hosting-cryptojacker-targeting-other-exchange-servers/, https://twitter.com/egre55/status/1087685529016193025, https://lolbas-project.github.io/lolbas/Binaries/Certutil/\nFalse Positives: Unknown",
                "severity": "high",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessFilename =~ \"CertUtil.exe\") and (TargetProcessCommandLine contains \"urlcache \" or TargetProcessCommandLine contains \"verifyctl \") and (TargetProcessCommandLine contains \".githubusercontent.com\" or TargetProcessCommandLine contains \"anonfiles.com\" or TargetProcessCommandLine contains \"cdn.discordapp.com\" or TargetProcessCommandLine contains \"cdn.discordapp.com/attachments/\" or TargetProcessCommandLine contains \"ddns.net\" or TargetProcessCommandLine contains \"dl.dropboxusercontent.com\" or TargetProcessCommandLine contains \"ghostbin.co\" or TargetProcessCommandLine contains \"gofile.io\" or TargetProcessCommandLine contains \"hastebin.com\" or TargetProcessCommandLine contains \"mediafire.com\" or TargetProcessCommandLine contains \"mega.nz\" or TargetProcessCommandLine contains \"paste.ee\" or TargetProcessCommandLine contains \"pastebin.com\" or TargetProcessCommandLine contains \"pastebin.pl\" or TargetProcessCommandLine contains \"pastetext.net\" or TargetProcessCommandLine contains \"privatlab.com\" or TargetProcessCommandLine contains \"privatlab.net\" or TargetProcessCommandLine contains \"send.exploit.in\" or TargetProcessCommandLine contains \"sendspace.com\" or TargetProcessCommandLine contains \"storage.googleapis.com\" or TargetProcessCommandLine contains \"storjshare.io\" or TargetProcessCommandLine contains \"temp.sh\" or TargetProcessCommandLine contains \"transfer.sh\" or TargetProcessCommandLine contains \"ufile.io\"))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion"],
                "techniques": ["T1027"],
                "alertRuleTemplateName": "42a5f1e7-9603-4f6d-97ae-3f37d130d794",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}