{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/452bce90-6fb0-43cc-97a5-affc283139b3')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/452bce90-6fb0-43cc-97a5-affc283139b3')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Suspicious Windows Defender Registry Key Tampering Via Reg.EXE",
                "description": "Detects the usage of \"reg.exe\" to tamper with different Windows Defender registry keys in order to disable some important features related to protection and detection\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_windows_defender_tamper.yml\nAuthor: Florian Roth (Nextron Systems), Swachchhanda Shrawan Poudel, Nasreddine Bencherchali (Nextron Systems)\nDate Modified: 2023-06-05\nStatus: experimental\nReferences: https://thedfirreport.com/2022/03/21/apt35-automates-initial-access-using-proxyshell/, https://github.com/swagkarna/Defeat-Defender-V1.2.0, https://www.elevenforum.com/t/video-guide-how-to-completely-disable-microsoft-defender-antivirus.14608/page-2\nFalse Positives: Rare legitimate use by administrators to test software (should always be investigated)",
                "severity": "high",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\reg.exe\" or TargetProcessFilename =~ \"reg.exe\") and (TargetProcessCommandLine contains \"SOFTWARE\\\\Microsoft\\\\Windows Defender\\\\\" or TargetProcessCommandLine contains \"SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows Defender Security Center\" or TargetProcessCommandLine contains \"SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows Defender\\\\\")) and (((TargetProcessCommandLine contains \" add \" and TargetProcessCommandLine contains \"d 0\") and (TargetProcessCommandLine contains \"DisallowExploitProtectionOverride\" or TargetProcessCommandLine contains \"EnableControlledFolderAccess\" or TargetProcessCommandLine contains \"MpEnablePus\" or TargetProcessCommandLine contains \"PUAProtection\" or TargetProcessCommandLine contains \"SpynetReporting\" or TargetProcessCommandLine contains \"SubmitSamplesConsent\" or TargetProcessCommandLine contains \"TamperProtection\")) or ((TargetProcessCommandLine contains \" add \" and TargetProcessCommandLine contains \"d 1\") and (TargetProcessCommandLine contains \"DisableAntiSpyware\" or TargetProcessCommandLine contains \"DisableAntiSpywareRealtimeProtection\" or TargetProcessCommandLine contains \"DisableAntiVirus\" or TargetProcessCommandLine contains \"DisableArchiveScanning\" or TargetProcessCommandLine contains \"DisableBehaviorMonitoring\" or TargetProcessCommandLine contains \"DisableBlockAtFirstSeen\" or TargetProcessCommandLine contains \"DisableConfig\" or TargetProcessCommandLine contains \"DisableEnhancedNotifications\" or TargetProcessCommandLine contains \"DisableIntrusionPreventionSystem\" or TargetProcessCommandLine contains \"DisableIOAVProtection\" or TargetProcessCommandLine contains \"DisableOnAccessProtection\" or TargetProcessCommandLine contains \"DisablePrivacyMode\" or TargetProcessCommandLine contains \"DisableRealtimeMonitoring\" or TargetProcessCommandLine contains \"DisableRoutinelyTakingAction\" or TargetProcessCommandLine contains \"DisableScanOnRealtimeEnable\" or TargetProcessCommandLine contains \"DisableScriptScanning\" or TargetProcessCommandLine contains \"Notification_Suppress\" or TargetProcessCommandLine contains \"SignatureDisableUpdateOnStartupWithoutEngine\"))))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion"],
                "techniques": ["T1562"],
                "alertRuleTemplateName": "452bce90-6fb0-43cc-97a5-affc283139b3",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}