{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/4627c6ae-6899-46e2-aa0c-6ebcb1becd19')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/4627c6ae-6899-46e2-aa0c-6ebcb1becd19')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "HackTool - Impacket Tools Execution",
                "description": "Detects the execution of different compiled Windows binaries of the impacket toolset (based on names or part of their names - could lead to false positives)\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_impacket_tools.yml\nAuthor: Florian Roth (Nextron Systems)\nDate Modified: 2023-02-07\nStatus: test\nReferences: https://github.com/ropnop/impacket_static_binaries/releases/tag/0.9.21-dev-binaries\nFalse Positives: Legitimate use of the impacket tools",
                "severity": "high",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where ((TargetProcessName contains \"\\\\goldenPac\" or TargetProcessName contains \"\\\\karmaSMB\" or TargetProcessName contains \"\\\\kintercept\" or TargetProcessName contains \"\\\\ntlmrelayx\" or TargetProcessName contains \"\\\\rpcdump\" or TargetProcessName contains \"\\\\samrdump\" or TargetProcessName contains \"\\\\secretsdump\" or TargetProcessName contains \"\\\\smbexec\" or TargetProcessName contains \"\\\\smbrelayx\" or TargetProcessName contains \"\\\\wmiexec\" or TargetProcessName contains \"\\\\wmipersist\") or (TargetProcessName endswith \"\\\\atexec_windows.exe\" or TargetProcessName endswith \"\\\\dcomexec_windows.exe\" or TargetProcessName endswith \"\\\\dpapi_windows.exe\" or TargetProcessName endswith \"\\\\findDelegation_windows.exe\" or TargetProcessName endswith \"\\\\GetADUsers_windows.exe\" or TargetProcessName endswith \"\\\\GetNPUsers_windows.exe\" or TargetProcessName endswith \"\\\\getPac_windows.exe\" or TargetProcessName endswith \"\\\\getST_windows.exe\" or TargetProcessName endswith \"\\\\getTGT_windows.exe\" or TargetProcessName endswith \"\\\\GetUserSPNs_windows.exe\" or TargetProcessName endswith \"\\\\ifmap_windows.exe\" or TargetProcessName endswith \"\\\\mimikatz_windows.exe\" or TargetProcessName endswith \"\\\\netview_windows.exe\" or TargetProcessName endswith \"\\\\nmapAnswerMachine_windows.exe\" or TargetProcessName endswith \"\\\\opdump_windows.exe\" or TargetProcessName endswith \"\\\\psexec_windows.exe\" or TargetProcessName endswith \"\\\\rdp_check_windows.exe\" or TargetProcessName endswith \"\\\\sambaPipe_windows.exe\" or TargetProcessName endswith \"\\\\smbclient_windows.exe\" or TargetProcessName endswith \"\\\\smbserver_windows.exe\" or TargetProcessName endswith \"\\\\sniffer_windows.exe\" or TargetProcessName endswith \"\\\\sniff_windows.exe\" or TargetProcessName endswith \"\\\\split_windows.exe\" or TargetProcessName endswith \"\\\\ticketer_windows.exe\"))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Collection", "Execution"],
                "techniques": ["T1557"],
                "alertRuleTemplateName": "4627c6ae-6899-46e2-aa0c-6ebcb1becd19",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}