{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/502b42de-4306-40b4-9596-6f590c81f073')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/502b42de-4306-40b4-9596-6f590c81f073')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Local Accounts Discovery",
                "description": "Local accounts, System Owner/User discovery using operating systems utilities\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_local_system_owner_account_discovery.yml\nAuthor: Timur Zinniatullin, Daniil Yugoslavskiy, oscd.community\nDate Modified: 2023-01-03\nStatus: test\nReferences: https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1033/T1033.md\nFalse Positives: Legitimate administrator or user enumerates local users for legitimate reason",
                "severity": "low",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\cmd.exe\" and (TargetProcessCommandLine contains \" /c\" and TargetProcessCommandLine contains \"dir \" and TargetProcessCommandLine contains \"\\\\Users\\\\\")) and (not(TargetProcessCommandLine contains \" rmdir \"))) or (((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") and TargetProcessCommandLine contains \"user\") and (not((TargetProcessCommandLine contains \"/domain\" or TargetProcessCommandLine contains \"/add\" or TargetProcessCommandLine contains \"/delete\" or TargetProcessCommandLine contains \"/active\" or TargetProcessCommandLine contains \"/expires\" or TargetProcessCommandLine contains \"/passwordreq\" or TargetProcessCommandLine contains \"/scriptpath\" or TargetProcessCommandLine contains \"/times\" or TargetProcessCommandLine contains \"/workstations\")))) or ((TargetProcessName endswith \"\\\\whoami.exe\" or TargetProcessName endswith \"\\\\quser.exe\" or TargetProcessName endswith \"\\\\qwinsta.exe\") or (TargetProcessName endswith \"\\\\wmic.exe\" and (TargetProcessCommandLine contains \"useraccount\" and TargetProcessCommandLine contains \"get\")) or (TargetProcessName endswith \"\\\\cmdkey.exe\" and TargetProcessCommandLine contains \" /l\")))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Discovery"],
                "techniques": ["T1033", "T1087"],
                "alertRuleTemplateName": "502b42de-4306-40b4-9596-6f590c81f073",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}