{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/536e2947-3729-478c-9903-745aaffe60d2')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/536e2947-3729-478c-9903-745aaffe60d2')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Suspicious PowerShell Invocations - Specific - ProcessCreation",
                "description": "Detects suspicious PowerShell invocation command parameters\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_invocation_specific.yml\nAuthor: Nasreddine Bencherchali (Nextron Systems)\nDate Modified: None\nStatus: experimental\nReferences: \nFalse Positives: Unknown",
                "severity": "medium",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \"-nop\" and TargetProcessCommandLine contains \" -w \" and TargetProcessCommandLine contains \"hidden\" and TargetProcessCommandLine contains \" -c \" and TargetProcessCommandLine contains \"[Convert]::FromBase64String\") or (TargetProcessCommandLine contains \" -w \" and TargetProcessCommandLine contains \"hidden\" and TargetProcessCommandLine contains \"-noni\" and TargetProcessCommandLine contains \"-nop\" and TargetProcessCommandLine contains \" -c \" and TargetProcessCommandLine contains \"iex\" and TargetProcessCommandLine contains \"New-Object\") or (TargetProcessCommandLine contains \" -w \" and TargetProcessCommandLine contains \"hidden\" and TargetProcessCommandLine contains \"-ep\" and TargetProcessCommandLine contains \"bypass\" and TargetProcessCommandLine contains \"-Enc\") or (TargetProcessCommandLine contains \"powershell\" and TargetProcessCommandLine contains \"reg\" and TargetProcessCommandLine contains \"add\" and TargetProcessCommandLine contains \"\\\\software\\\\\") or (TargetProcessCommandLine contains \"bypass\" and TargetProcessCommandLine contains \"-noprofile\" and TargetProcessCommandLine contains \"-windowstyle\" and TargetProcessCommandLine contains \"hidden\" and TargetProcessCommandLine contains \"new-object\" and TargetProcessCommandLine contains \"system.net.webclient\" and TargetProcessCommandLine contains \".download\") or (TargetProcessCommandLine contains \"iex\" and TargetProcessCommandLine contains \"New-Object\" and TargetProcessCommandLine contains \"Net.WebClient\" and TargetProcessCommandLine contains \".Download\")) and (not((TargetProcessCommandLine contains \"(New-Object System.Net.WebClient).DownloadString('https://community.chocolatey.org/install.ps1\" or TargetProcessCommandLine contains \"Write-ChocolateyWarning\"))))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion"],
                "techniques": [],
                "alertRuleTemplateName": "536e2947-3729-478c-9903-745aaffe60d2",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}