{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5b768e71-86f2-4879-b448-81061cbae951')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5b768e71-86f2-4879-b448-81061cbae951')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Suspicious Manipulation Of Default Accounts Via Net.EXE",
                "description": "Detects suspicious manipulations of default accounts such as 'administrator' and 'guest'. For example 'enable' or 'disable' accounts or change the password...etc\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_default_accounts_manipulation.yml\nAuthor: Nasreddine Bencherchali (Nextron Systems)\nDate Modified: 2023-02-21\nStatus: experimental\nReferences: https://www.trellix.com/en-sg/about/newsroom/stories/threat-labs/lockergoga-ransomware-family-used-in-targeted-attacks.html, https://redacted.com/blog/bianlian-ransomware-gang-gives-it-a-go/, https://www.microsoft.com/security/blog/2022/09/07/profiling-dev-0270-phosphorus-ransomware-operations/\nFalse Positives: Some false positives could occur with the admin or guest account. It depends on the scripts being used by the admins in your env. If you experience a lot of FP you could reduce the level to medium",
                "severity": "high",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where ((((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") or (TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\")) and TargetProcessCommandLine contains \" user \" and (TargetProcessCommandLine contains \" J\u00e4rjestelm\u00e4nvalvoja \" or TargetProcessCommandLine contains \" Rendszergazda \" or TargetProcessCommandLine contains \" \u0410\u0434\u043c\u0438\u043d\u0438\u0441\u0442\u0440\u0430\u0442\u043e\u0440 \" or TargetProcessCommandLine contains \" Administrateur \" or TargetProcessCommandLine contains \" Administrador \" or TargetProcessCommandLine contains \" Administrat\u00f6r \" or TargetProcessCommandLine contains \" Administrator \" or TargetProcessCommandLine contains \" guest \" or TargetProcessCommandLine contains \" DefaultAccount \" or TargetProcessCommandLine contains \" \\\"J\u00e4rjestelm\u00e4nvalvoja\\\" \" or TargetProcessCommandLine contains \" \\\"Rendszergazda\\\" \" or TargetProcessCommandLine contains \" \\\"\u0410\u0434\u043c\u0438\u043d\u0438\u0441\u0442\u0440\u0430\u0442\u043e\u0440\\\" \" or TargetProcessCommandLine contains \" \\\"Administrateur\\\" \" or TargetProcessCommandLine contains \" \\\"Administrador\\\" \" or TargetProcessCommandLine contains \" \\\"Administrat\u00f6r\\\" \" or TargetProcessCommandLine contains \" \\\"Administrator\\\" \" or TargetProcessCommandLine contains \" \\\"guest\\\" \" or TargetProcessCommandLine contains \" \\\"DefaultAccount\\\" \" or TargetProcessCommandLine contains \" 'J\u00e4rjestelm\u00e4nvalvoja' \" or TargetProcessCommandLine contains \" 'Rendszergazda' \" or TargetProcessCommandLine contains \" '\u0410\u0434\u043c\u0438\u043d\u0438\u0441\u0442\u0440\u0430\u0442\u043e\u0440' \" or TargetProcessCommandLine contains \" 'Administrateur' \" or TargetProcessCommandLine contains \" 'Administrador' \" or TargetProcessCommandLine contains \" 'Administrat\u00f6r' \" or TargetProcessCommandLine contains \" 'Administrator' \" or TargetProcessCommandLine contains \" 'guest' \" or TargetProcessCommandLine contains \" 'DefaultAccount' \")) and (not((TargetProcessCommandLine contains \"guest\" and TargetProcessCommandLine contains \"/active no\"))))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Collection"],
                "techniques": ["T1560"],
                "alertRuleTemplateName": "5b768e71-86f2-4879-b448-81061cbae951",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}