{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5e95028c-5229-4214-afae-d653d573d0ec')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5e95028c-5229-4214-afae-d653d573d0ec')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Security Service Disabled Via Reg.EXE",
                "description": "Detects execution of \"reg.exe\" to disable security services such as Windows Defender.\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_disable_sec_services.yml\nAuthor: Florian Roth (Nextron Systems), John Lambert (idea), elhoim\nDate Modified: 2023-06-05\nStatus: test\nReferences: https://twitter.com/JohnLaTwC/status/1415295021041979392, https://github.com/gordonbay/Windows-On-Reins/blob/e587ac7a0407847865926d575e3c46f68cf7c68d/wor.ps1, https://vms.drweb.fr/virus/?i=24144899, https://bidouillesecurity.com/disable-windows-defender-in-powershell/\nFalse Positives: Unlikely",
                "severity": "high",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"reg\" and TargetProcessCommandLine contains \"add\") and ((TargetProcessCommandLine contains \"d 4\" and TargetProcessCommandLine contains \"v Start\") and (TargetProcessCommandLine contains \"\\\\AppIDSvc\" or TargetProcessCommandLine contains \"\\\\MsMpSvc\" or TargetProcessCommandLine contains \"\\\\NisSrv\" or TargetProcessCommandLine contains \"\\\\SecurityHealthService\" or TargetProcessCommandLine contains \"\\\\Sense\" or TargetProcessCommandLine contains \"\\\\UsoSvc\" or TargetProcessCommandLine contains \"\\\\WdBoot\" or TargetProcessCommandLine contains \"\\\\WdFilter\" or TargetProcessCommandLine contains \"\\\\WdNisDrv\" or TargetProcessCommandLine contains \"\\\\WdNisSvc\" or TargetProcessCommandLine contains \"\\\\WinDefend\" or TargetProcessCommandLine contains \"\\\\wscsvc\" or TargetProcessCommandLine contains \"\\\\wuauserv\")))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion"],
                "techniques": ["T1562"],
                "alertRuleTemplateName": "5e95028c-5229-4214-afae-d653d573d0ec",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}