{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/6938366d-8954-4ddc-baff-c830b3ba8fcd')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/6938366d-8954-4ddc-baff-c830b3ba8fcd')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "HackTool - Certipy Execution",
                "description": "Detects Certipy a tool for Active Directory Certificate Services enumeration and abuse based on PE metadata characteristics and common command line arguments.\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_certipy.yml\nAuthor: pH-T (Nextron Systems)\nDate Modified: None\nStatus: experimental\nReferences: https://github.com/ly4k/Certipy\nFalse Positives: Unlikely",
                "severity": "high",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\Certipy.exe\" or TargetProcessFilename =~ \"Certipy.exe\" or TargetProcessFileDescription contains \"Certipy\") or ((TargetProcessCommandLine contains \" auth \" or TargetProcessCommandLine contains \" find \" or TargetProcessCommandLine contains \" forge \" or TargetProcessCommandLine contains \" relay \" or TargetProcessCommandLine contains \" req \" or TargetProcessCommandLine contains \" shadow \") and (TargetProcessCommandLine contains \" -bloodhound\" or TargetProcessCommandLine contains \" -ca-pfx \" or TargetProcessCommandLine contains \" -dc-ip \" or TargetProcessCommandLine contains \" -kirbi\" or TargetProcessCommandLine contains \" -old-bloodhound\" or TargetProcessCommandLine contains \" -pfx \" or TargetProcessCommandLine contains \" -target\" or TargetProcessCommandLine contains \" -username \" or TargetProcessCommandLine contains \" -vulnerable\" or TargetProcessCommandLine contains \"auth -pfx\" or TargetProcessCommandLine contains \"shadow auto\" or TargetProcessCommandLine contains \"shadow list\")))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Discovery", "CredentialAccess"],
                "techniques": [],
                "alertRuleTemplateName": "6938366d-8954-4ddc-baff-c830b3ba8fcd",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}