{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/79a87aa6-e4bd-42fc-a5bb-5e6fbdcd62f5')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/79a87aa6-e4bd-42fc-a5bb-5e6fbdcd62f5')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Msiexec Quiet Installation",
                "description": "Adversaries may abuse msiexec.exe to proxy execution of malicious payloads.\nMsiexec.exe is the command-line utility for the Windows Installer and is thus commonly associated with executing installation packages (.msi)\n\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_msiexec_install_quiet.yml\nAuthor: frack113\nDate Modified: 2023-03-23\nStatus: experimental\nReferences: https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/msiexec, https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.007/T1218.007.md, https://twitter.com/_st0pp3r_/status/1583914244344799235\nFalse Positives: WindowsApps installing updates via the quiet flag",
                "severity": "medium",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\msiexec.exe\" or TargetProcessFilename =~ \"msiexec.exe\") and (TargetProcessCommandLine contains \"/i\" or TargetProcessCommandLine contains \"-i\" or TargetProcessCommandLine contains \"/package\" or TargetProcessCommandLine contains \"-package\" or TargetProcessCommandLine contains \"/a\" or TargetProcessCommandLine contains \"-a\" or TargetProcessCommandLine contains \"/j\" or TargetProcessCommandLine contains \"-j\") and (TargetProcessCommandLine contains \"/q\" or TargetProcessCommandLine contains \"-q\")) and (not(((ActingProcessName startswith \"C:\\\\Users\\\\\" and ActingProcessName contains \"\\\\AppData\\\\Local\\\\Temp\\\\\") or ActingProcessName startswith \"C:\\\\Windows\\\\Temp\\\\\" or (ActingProcessName =~ \"C:\\\\Windows\\\\CCM\\\\Ccm32BitLauncher.exe\" and TargetProcessIntegrityLevel =~ \"System\")))))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion"],
                "techniques": ["T1218"],
                "alertRuleTemplateName": "79a87aa6-e4bd-42fc-a5bb-5e6fbdcd62f5",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}