{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/7dc2dedd-7603-461a-bc13-15803d132355')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/7dc2dedd-7603-461a-bc13-15803d132355')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Uncommon Child Process Of Conhost.EXE",
                "description": "Detects uncommon \"conhost\" child processes. This could be a sign of \"conhost\" usage as a LOLBIN or potential process injection activity.\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_conhost_susp_child_process.yml\nAuthor: omkar72\nDate Modified: 2023-06-01\nStatus: experimental\nReferences: http://www.hexacorn.com/blog/2020/05/25/how-to-con-your-host/\nFalse Positives: Unknown",
                "severity": "medium",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\conhost.exe\" and (not((Provider_Name =~ \"SystemTraceProvider-Process\" or (Provider_Name =~ \"Microsoft-Windows-Kernel-Process\" and TargetProcessName endswith \"\\\\git.exe\" and (ActingProcessCommandLine contains \" show --textconv \" or ActingProcessCommandLine contains \" cat-file -s \")) or (ActingProcessCommandLine contains \"C:\\\\WINDOWS\\\\system32\\\\conhost.exe 0x4\" and (TargetProcessCommandLine contains \" show --textconv \" or TargetProcessCommandLine contains \" cat-file -s \")) or (Provider_Name =~ \"Microsoft-Windows-Kernel-Process\" and (ActingProcessCommandLine contains \" cat-file -s \" or ActingProcessCommandLine contains \"show --textconv\") and TargetProcessName =~ \"C:\\\\Windows\\\\System32\\\\conhost.exe\") or ((ActingProcessCommandLine =~ \"\\\\??\\\\C:\\\\WINDOWS\\\\system32\\\\conhost.exe 0x4\" or ActingProcessCommandLine =~ \"\\\\??\\\\C:\\\\WINDOWS\\\\system32\\\\conhost.exe 0xffffffff -ForceV1\") and TargetProcessName =~ \"C:\\\\Windows\\\\System32\\\\conhost.exe\") or ((ActingProcessCommandLine =~ \"\\\\??\\\\C:\\\\WINDOWS\\\\system32\\\\conhost.exe 0xffffffff -ForceV1'\" or ActingProcessCommandLine =~ \"\\\\??\\\\C:\\\\WINDOWS\\\\system32\\\\conhost.exe 0x4'\") and TargetProcessName =~ \"C:\\\\Program Files\\\\Git\\\\mingw64\\\\bin\\\\git.exe\")))))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion"],
                "techniques": ["T1202"],
                "alertRuleTemplateName": "7dc2dedd-7603-461a-bc13-15803d132355",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}