{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/81325ce1-be01-4250-944f-b4789644556f')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/81325ce1-be01-4250-944f-b4789644556f')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Suspicious Schtasks From Env Var Folder",
                "description": "Detects Schtask creations that point to a suspicious folder or an environment variable often used by malware\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_schtasks_env_folder.yml\nAuthor: Florian Roth (Nextron Systems)\nDate Modified: 2023-03-14\nStatus: experimental\nReferences: https://www.welivesecurity.com/2022/01/18/donot-go-do-not-respawn/, https://www.joesandbox.com/analysis/514608/0/html#324415FF7D8324231381BAD48A052F85DF04\nFalse Positives: Benign scheduled tasks creations or executions that happen often during software installations, Software that uses the AppData folder and scheduled tasks to update the software in the AppData folders",
                "severity": "high",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where ((((TargetProcessName endswith \"\\\\schtasks.exe\" and TargetProcessCommandLine contains \" /create \") and (TargetProcessCommandLine contains \"%AppData%\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\\" or TargetProcessCommandLine contains \"%Public%\" or TargetProcessCommandLine contains \"\\\\Users\\\\Public\" or TargetProcessCommandLine contains \"C:\\\\Windows\\\\Temp\" or TargetProcessCommandLine contains \"C:\\\\Perflogs\")) or (ActingProcessCommandLine endswith \"\\\\svchost.exe -k netsvcs -p -s Schedule\" and (TargetProcessCommandLine contains \"%Public%\" or TargetProcessCommandLine contains \"\\\\Users\\\\Public\" or TargetProcessCommandLine contains \"C:\\\\Windows\\\\Temp\" or TargetProcessCommandLine contains \"C:\\\\Perflogs\"))) and (not((((TargetProcessCommandLine contains \"update_task.xml\" or TargetProcessCommandLine contains \"/Create /TN TVInstallRestore /TR\") or ActingProcessCommandLine contains \"unattended.ini\") or (TargetProcessCommandLine contains \"/Create /Xml \\\"C:\\\\Users\\\\\" and TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\.CR.\" and TargetProcessCommandLine contains \"Avira_Security_Installation.xml\") or ((TargetProcessCommandLine contains \"/Create /F /TN\" and TargetProcessCommandLine contains \"/Xml \" and TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\is-\" and TargetProcessCommandLine contains \"Avira_\") and (TargetProcessCommandLine contains \".tmp\\\\UpdateFallbackTask.xml\" or TargetProcessCommandLine contains \".tmp\\\\WatchdogServiceControlManagerTimeout.xml\" or TargetProcessCommandLine contains \".tmp\\\\SystrayAutostart.xml\" or TargetProcessCommandLine contains \".tmp\\\\MaintenanceTask.xml\")) or (TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" and TargetProcessCommandLine contains \"/Create /TN \\\"klcp_update\\\" /XML \" and TargetProcessCommandLine contains \"\\\\klcp_update_task.xml\")))))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["PrivilegeEscalation", "Execution"],
                "techniques": ["T1053"],
                "alertRuleTemplateName": "81325ce1-be01-4250-944f-b4789644556f",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}