{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/8518ed3d-f7c9-4601-a26c-f361a4256a0c')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/8518ed3d-f7c9-4601-a26c-f361a4256a0c')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Suspicious Download From File-Sharing Website Via Bitsadmin",
                "description": "Detects usage of bitsadmin downloading a file from a suspicious domain\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_bitsadmin_download_file_sharing_domains.yml\nAuthor: Florian Roth (Nextron Systems)\nDate Modified: 2023-08-17\nStatus: experimental\nReferences: https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin, https://isc.sans.edu/diary/22264, https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/, https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ransomware-hive-conti-avoslocker, https://www.cisa.gov/uscert/ncas/alerts/aa22-321a\nFalse Positives: Some legitimate apps use this, but limited.",
                "severity": "high",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\bitsadmin.exe\" or TargetProcessFilename =~ \"bitsadmin.exe\") and (TargetProcessCommandLine contains \" /transfer \" or TargetProcessCommandLine contains \" /create \" or TargetProcessCommandLine contains \" /addfile \") and (TargetProcessCommandLine contains \".githubusercontent.com\" or TargetProcessCommandLine contains \"anonfiles.com\" or TargetProcessCommandLine contains \"cdn.discordapp.com\" or TargetProcessCommandLine contains \"cdn.discordapp.com/attachments/\" or TargetProcessCommandLine contains \"ddns.net\" or TargetProcessCommandLine contains \"dl.dropboxusercontent.com\" or TargetProcessCommandLine contains \"ghostbin.co\" or TargetProcessCommandLine contains \"gofile.io\" or TargetProcessCommandLine contains \"hastebin.com\" or TargetProcessCommandLine contains \"mediafire.com\" or TargetProcessCommandLine contains \"mega.nz\" or TargetProcessCommandLine contains \"paste.ee\" or TargetProcessCommandLine contains \"pastebin.com\" or TargetProcessCommandLine contains \"pastebin.pl\" or TargetProcessCommandLine contains \"pastetext.net\" or TargetProcessCommandLine contains \"privatlab.com\" or TargetProcessCommandLine contains \"privatlab.net\" or TargetProcessCommandLine contains \"send.exploit.in\" or TargetProcessCommandLine contains \"sendspace.com\" or TargetProcessCommandLine contains \"storage.googleapis.com\" or TargetProcessCommandLine contains \"storjshare.io\" or TargetProcessCommandLine contains \"temp.sh\" or TargetProcessCommandLine contains \"transfer.sh\" or TargetProcessCommandLine contains \"ufile.io\"))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "Persistence"],
                "techniques": ["T1197", "T1036"],
                "alertRuleTemplateName": "8518ed3d-f7c9-4601-a26c-f361a4256a0c",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}