{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/88f680b8-070e-402c-ae11-d2914f2257f1')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/88f680b8-070e-402c-ae11-d2914f2257f1')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "PowerShell Base64 Encoded IEX Cmdlet",
                "description": "Detects usage of a base64 encoded \"IEX\" cmdlet in a process command line\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_base64_iex.yml\nAuthor: Florian Roth (Nextron Systems)\nDate Modified: 2023-04-06\nStatus: test\nReferences: Internal Research\nFalse Positives: Unknown",
                "severity": "high",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"SUVYIChb\"\n| where TargetProcessCommandLine contains \"lFWCAoW\"\n| where TargetProcessCommandLine contains \"JRVggKF\"\n| where TargetProcessCommandLine contains \"aWV4IChb\"\n| where TargetProcessCommandLine contains \"lleCAoW\"\n| where TargetProcessCommandLine contains \"pZXggKF\"\n| where TargetProcessCommandLine contains \"aWV4IChOZX\"\n| where TargetProcessCommandLine contains \"lleCAoTmV3\"\n| where TargetProcessCommandLine contains \"pZXggKE5ld\"\n| where TargetProcessCommandLine contains \"SUVYIChOZX\"\n| where TargetProcessCommandLine contains \"lFWCAoTmV3\"\n| where TargetProcessCommandLine contains \"JRVggKE5ld\"\n| where TargetProcessCommandLine contains \"SUVYKF\"\n| where TargetProcessCommandLine contains \"lFWChb\"\n| where TargetProcessCommandLine contains \"JRVgoW\"\n| where TargetProcessCommandLine contains \"aWV4KF\"\n| where TargetProcessCommandLine contains \"lleChb\"\n| where TargetProcessCommandLine contains \"pZXgoW\"\n| where TargetProcessCommandLine contains \"aWV4KE5ld\"\n| where TargetProcessCommandLine contains \"lleChOZX\"\n| where TargetProcessCommandLine contains \"pZXgoTmV3\"\n| where TargetProcessCommandLine contains \"SUVYKE5ld\"\n| where TargetProcessCommandLine contains \"lFWChOZX\"\n| where TargetProcessCommandLine contains \"JRVgoTmV3\"\n| where TargetProcessCommandLine contains \"SUVYKCgn\"\n| where TargetProcessCommandLine contains \"lFWCgoJ\"\n| where TargetProcessCommandLine contains \"JRVgoKC\"\n| where TargetProcessCommandLine contains \"aWV4KCgn\"\n| where TargetProcessCommandLine contains \"lleCgoJ\"\n| where TargetProcessCommandLine contains \"pZXgoKC\"\n| where (( or  or  or  or  or  or  or  or  or ) or (TargetProcessCommandLine contains \"SQBFAFgAIAAoAFsA\" or TargetProcessCommandLine contains \"kARQBYACAAKABbA\" or TargetProcessCommandLine contains \"JAEUAWAAgACgAWw\" or TargetProcessCommandLine contains \"aQBlAHgAIAAoAFsA\" or TargetProcessCommandLine contains \"kAZQB4ACAAKABbA\" or TargetProcessCommandLine contains \"pAGUAeAAgACgAWw\" or TargetProcessCommandLine contains \"aQBlAHgAIAAoAE4AZQB3A\" or TargetProcessCommandLine contains \"kAZQB4ACAAKABOAGUAdw\" or TargetProcessCommandLine contains \"pAGUAeAAgACgATgBlAHcA\" or TargetProcessCommandLine contains \"SQBFAFgAIAAoAE4AZQB3A\" or TargetProcessCommandLine contains \"kARQBYACAAKABOAGUAdw\" or TargetProcessCommandLine contains \"JAEUAWAAgACgATgBlAHcA\"))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Execution"],
                "techniques": ["T1059"],
                "alertRuleTemplateName": "88f680b8-070e-402c-ae11-d2914f2257f1",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}