{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/8bc64091-6875-4881-aaf9-7bd25b5dda08')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/8bc64091-6875-4881-aaf9-7bd25b5dda08')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Suspicious Process Patterns NTDS.DIT Exfil",
                "description": "Detects suspicious process patterns used in NTDS.DIT exfiltration\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_ntds.yml\nAuthor: Florian Roth (Nextron Systems)\nDate Modified: 2022-11-10\nStatus: test\nReferences: https://www.ired.team/offensive-security/credential-access-and-credential-dumping/ntds.dit-enumeration, https://www.n00py.io/2022/03/manipulating-user-passwords-without-mimikatz/, https://pentestlab.blog/tag/ntds-dit/, https://github.com/samratashok/nishang/blob/414ee1104526d7057f9adaeee196d91ae447283e/Gather/Copy-VSS.ps1, https://github.com/zcgonvh/NTDSDumpEx, https://github.com/rapid7/metasploit-framework/blob/d297adcebb5c1df6fe30b12ca79b161deb71571c/data/post/powershell/NTDSgrab.ps1, https://blog.talosintelligence.com/2022/08/recent-cyber-attack.html?m=1\nFalse Positives: Unknown",
                "severity": "high",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where ((((TargetProcessName endswith \"\\\\NTDSDump.exe\" or TargetProcessName endswith \"\\\\NTDSDumpEx.exe\") or (TargetProcessCommandLine contains \"ntds.dit\" and TargetProcessCommandLine contains \"system.hiv\") or TargetProcessCommandLine contains \"NTDSgrab.ps1\") or (TargetProcessCommandLine contains \"ac i ntds\" and TargetProcessCommandLine contains \"create full\") or (TargetProcessCommandLine contains \"/c copy \" and TargetProcessCommandLine contains \"\\\\windows\\\\ntds\\\\ntds.dit\") or (TargetProcessCommandLine contains \"activate instance ntds\" and TargetProcessCommandLine contains \"create full\") or (TargetProcessCommandLine contains \"powershell\" and TargetProcessCommandLine contains \"ntds.dit\")) or (TargetProcessCommandLine contains \"ntds.dit\" and ((ActingProcessName contains \"\\\\apache\" or ActingProcessName contains \"\\\\tomcat\" or ActingProcessName contains \"\\\\AppData\\\\\" or ActingProcessName contains \"\\\\Temp\\\\\" or ActingProcessName contains \"\\\\Public\\\\\" or ActingProcessName contains \"\\\\PerfLogs\\\\\") or (TargetProcessName contains \"\\\\apache\" or TargetProcessName contains \"\\\\tomcat\" or TargetProcessName contains \"\\\\AppData\\\\\" or TargetProcessName contains \"\\\\Temp\\\\\" or TargetProcessName contains \"\\\\Public\\\\\" or TargetProcessName contains \"\\\\PerfLogs\\\\\"))))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["CredentialAccess"],
                "techniques": ["T1003"],
                "alertRuleTemplateName": "8bc64091-6875-4881-aaf9-7bd25b5dda08",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}