{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/8d01b53f-456f-48ee-90f6-bc28e67d4e35')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/8d01b53f-456f-48ee-90f6-bc28e67d4e35')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Suspicious Obfuscated PowerShell Code",
                "description": "Detects suspicious UTF16 and base64 encoded and often obfuscated PowerShell code often used in command lines\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_encoded_obfusc.yml\nAuthor: Florian Roth (Nextron Systems)\nDate Modified: 2023-02-14\nStatus: experimental\nReferences: https://app.any.run/tasks/fcadca91-3580-4ede-aff4-4d2bf809bf99/\nFalse Positives: Unknown",
                "severity": "high",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"IAAtAGIAeABvAHIAIAAwAHgA\" or TargetProcessCommandLine contains \"AALQBiAHgAbwByACAAMAB4A\" or TargetProcessCommandLine contains \"gAC0AYgB4AG8AcgAgADAAeA\" or TargetProcessCommandLine contains \"AC4ASQBuAHYAbwBrAGUAKAApACAAfAAg\" or TargetProcessCommandLine contains \"AuAEkAbgB2AG8AawBlACgAKQAgAHwAI\" or TargetProcessCommandLine contains \"ALgBJAG4AdgBvAGsAZQAoACkAIAB8AC\" or TargetProcessCommandLine contains \"AHsAMQB9AHsAMAB9ACIAIAAtAGYAI\" or TargetProcessCommandLine contains \"B7ADEAfQB7ADAAfQAiACAALQBmAC\" or TargetProcessCommandLine contains \"AewAxAH0AewAwAH0AIgAgAC0AZgAg\" or TargetProcessCommandLine contains \"AHsAMAB9AHsAMwB9ACIAIAAtAGYAI\" or TargetProcessCommandLine contains \"B7ADAAfQB7ADMAfQAiACAALQBmAC\" or TargetProcessCommandLine contains \"AewAwAH0AewAzAH0AIgAgAC0AZgAg\" or TargetProcessCommandLine contains \"AHsAMgB9AHsAMAB9ACIAIAAtAGYAI\" or TargetProcessCommandLine contains \"B7ADIAfQB7ADAAfQAiACAALQBmAC\" or TargetProcessCommandLine contains \"AewAyAH0AewAwAH0AIgAgAC0AZgAg\" or TargetProcessCommandLine contains \"AHsAMQB9AHsAMAB9ACcAIAAtAGYAI\" or TargetProcessCommandLine contains \"B7ADEAfQB7ADAAfQAnACAALQBmAC\" or TargetProcessCommandLine contains \"AewAxAH0AewAwAH0AJwAgAC0AZgAg\" or TargetProcessCommandLine contains \"AHsAMAB9AHsAMwB9ACcAIAAtAGYAI\" or TargetProcessCommandLine contains \"B7ADAAfQB7ADMAfQAnACAALQBmAC\" or TargetProcessCommandLine contains \"AewAwAH0AewAzAH0AJwAgAC0AZgAg\" or TargetProcessCommandLine contains \"AHsAMgB9AHsAMAB9ACcAIAAtAGYAI\" or TargetProcessCommandLine contains \"B7ADIAfQB7ADAAfQAnACAALQBmAC\" or TargetProcessCommandLine contains \"AewAyAH0AewAwAH0AJwAgAC0AZgAg\")",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion"],
                "techniques": [],
                "alertRuleTemplateName": "8d01b53f-456f-48ee-90f6-bc28e67d4e35",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}