{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/96036718-71cc-4027-a538-d1587e0006a7')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/96036718-71cc-4027-a538-d1587e0006a7')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Windows Processes Suspicious Parent Directory",
                "description": "Detect suspicious parent processes of well-known Windows processes\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_proc_wrong_parent.yml\nAuthor: vburov\nDate Modified: 2022-02-14\nStatus: test\nReferences: https://securitybytes.io/blue-team-fundamentals-part-two-windows-processes-759fe15965e2, https://www.carbonblack.com/2014/06/10/screenshot-demo-hunt-evil-faster-than-ever-with-carbon-black/, https://www.13cubed.com/downloads/windows_process_genealogy_v2.pdf\nFalse Positives: Some security products seem to spawn these",
                "severity": "low",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\svchost.exe\" or TargetProcessName endswith \"\\\\taskhost.exe\" or TargetProcessName endswith \"\\\\lsm.exe\" or TargetProcessName endswith \"\\\\lsass.exe\" or TargetProcessName endswith \"\\\\services.exe\" or TargetProcessName endswith \"\\\\lsaiso.exe\" or TargetProcessName endswith \"\\\\csrss.exe\" or TargetProcessName endswith \"\\\\wininit.exe\" or TargetProcessName endswith \"\\\\winlogon.exe\") and (not((((ActingProcessName endswith \"\\\\SavService.exe\" or ActingProcessName endswith \"\\\\ngen.exe\") or (ActingProcessName contains \"\\\\System32\\\\\" or ActingProcessName contains \"\\\\SysWOW64\\\\\")) or ((ActingProcessName contains \"\\\\Windows Defender\\\\\" or ActingProcessName contains \"\\\\Microsoft Security Client\\\\\") and ActingProcessName endswith \"\\\\MsMpEng.exe\") or (isnull(ActingProcessName) or ActingProcessName =~ \"-\")))))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion"],
                "techniques": ["T1036"],
                "alertRuleTemplateName": "96036718-71cc-4027-a538-d1587e0006a7",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}