{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/a16980c2-0c56-4de0-9a79-17971979efdd')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/a16980c2-0c56-4de0-9a79-17971979efdd')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Cmd.EXE Missing Space Characters Execution Anomaly",
                "description": "Detects Windows command lines that miss a space before or after the /c flag when running a command using the cmd.exe.\nThis could be a sign of obfuscation of a fat finger problem (typo by the developer).\n\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmd_no_space_execution.yml\nAuthor: Florian Roth (Nextron Systems)\nDate Modified: 2023-03-06\nStatus: experimental\nReferences: https://twitter.com/cyb3rops/status/1562072617552678912, https://ss64.com/nt/cmd.html\nFalse Positives: Unknown",
                "severity": "high",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \"cmd.exe/c\" or TargetProcessCommandLine contains \"\\\\cmd/c\" or TargetProcessCommandLine contains \"\\\"cmd/c\" or TargetProcessCommandLine contains \"cmd.exe/k\" or TargetProcessCommandLine contains \"\\\\cmd/k\" or TargetProcessCommandLine contains \"\\\"cmd/k\" or TargetProcessCommandLine contains \"cmd.exe/r\" or TargetProcessCommandLine contains \"\\\\cmd/r\" or TargetProcessCommandLine contains \"\\\"cmd/r\") or (TargetProcessCommandLine contains \"/cwhoami\" or TargetProcessCommandLine contains \"/cpowershell\" or TargetProcessCommandLine contains \"/cschtasks\" or TargetProcessCommandLine contains \"/cbitsadmin\" or TargetProcessCommandLine contains \"/ccertutil\" or TargetProcessCommandLine contains \"/kwhoami\" or TargetProcessCommandLine contains \"/kpowershell\" or TargetProcessCommandLine contains \"/kschtasks\" or TargetProcessCommandLine contains \"/kbitsadmin\" or TargetProcessCommandLine contains \"/kcertutil\") or (TargetProcessCommandLine contains \"cmd.exe /c\" or TargetProcessCommandLine contains \"cmd /c\" or TargetProcessCommandLine contains \"cmd.exe /k\" or TargetProcessCommandLine contains \"cmd /k\" or TargetProcessCommandLine contains \"cmd.exe /r\" or TargetProcessCommandLine contains \"cmd /r\")) and (not(((TargetProcessCommandLine contains \"cmd.exe /c \" or TargetProcessCommandLine contains \"cmd /c \" or TargetProcessCommandLine contains \"cmd.exe /k \" or TargetProcessCommandLine contains \"cmd /k \" or TargetProcessCommandLine contains \"cmd.exe /r \" or TargetProcessCommandLine contains \"cmd /r \") or (TargetProcessCommandLine contains \"AppData\\\\Local\\\\Programs\\\\Microsoft VS Code\\\\resources\\\\app\\\\node_modules\" or TargetProcessCommandLine endswith \"cmd.exe/c .\" or TargetProcessCommandLine =~ \"cmd.exe /c\")))))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Execution"],
                "techniques": ["T1059"],
                "alertRuleTemplateName": "a16980c2-0c56-4de0-9a79-17971979efdd",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}