{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/a35f5a72-f347-4e36-8895-9869b0d5fc6d')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/a35f5a72-f347-4e36-8895-9869b0d5fc6d')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Suspicious Program Location Whitelisted In Firewall Via Netsh.EXE",
                "description": "Detects Netsh command execution that whitelists a program located in a suspicious location in the Windows Firewall\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_netsh_fw_allow_program_in_susp_location.yml\nAuthor: Sander Wiebing, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community\nDate Modified: 2023-02-10\nStatus: test\nReferences: https://www.virusradar.com/en/Win32_Kasidet.AD/description, https://www.hybrid-analysis.com/sample/07e789f4f2f3259e7559fdccb36e96814c2dbff872a21e1fa03de9ee377d581f?environmentId=100\nFalse Positives: Unknown",
                "severity": "high",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\netsh.exe\" or TargetProcessFilename =~ \"netsh.exe\") and ((TargetProcessCommandLine contains \"firewall\" and TargetProcessCommandLine contains \"add\" and TargetProcessCommandLine contains \"allowedprogram\") or (TargetProcessCommandLine contains \"advfirewall\" and TargetProcessCommandLine contains \"firewall\" and TargetProcessCommandLine contains \"add\" and TargetProcessCommandLine contains \"rule\" and TargetProcessCommandLine contains \"action=allow\" and TargetProcessCommandLine contains \"program=\")) and (TargetProcessCommandLine contains \"%Public%\\\\\" or TargetProcessCommandLine contains \"%TEMP%\" or TargetProcessCommandLine contains \"%TMP%\" or TargetProcessCommandLine contains \":\\\\$Recycle.bin\\\\\" or TargetProcessCommandLine contains \":\\\\RECYCLER\\\\\" or TargetProcessCommandLine contains \":\\\\SystemVolumeInformation\\\\\" or TargetProcessCommandLine contains \":\\\\Temp\\\\\" or TargetProcessCommandLine contains \":\\\\Users\\\\Default\\\\\" or TargetProcessCommandLine contains \":\\\\Users\\\\Desktop\\\\\" or TargetProcessCommandLine contains \":\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\addins\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\cursors\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\debug\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\drivers\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\fonts\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\help\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\system32\\\\tasks\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\Tasks\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\Downloads\\\\\" or TargetProcessCommandLine contains \"\\\\Local Settings\\\\Temporary Internet Files\\\\\" or TargetProcessCommandLine contains \"\\\\Temporary Internet Files\\\\Content.Outlook\\\\\"))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion"],
                "techniques": ["T1562"],
                "alertRuleTemplateName": "a35f5a72-f347-4e36-8895-9869b0d5fc6d",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}