{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/aae1243f-d8af-40d8-ab20-33fc6d0c55bc')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/aae1243f-d8af-40d8-ab20-33fc6d0c55bc')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Suspicious Use of PsLogList",
                "description": "Detects usage of the PsLogList utility to dump event log in order to extract admin accounts and perform account discovery or delete events logs\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_psloglist.yml\nAuthor: Nasreddine Bencherchali (Nextron Systems)\nDate Modified: 2023-01-16\nStatus: experimental\nReferences: https://research.nccgroup.com/2021/01/12/abusing-cloud-services-to-fly-under-the-radar/, https://www.cybereason.com/blog/deadringer-exposing-chinese-threat-actors-targeting-major-telcos, https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/Sysinternals/PsLogList, https://twitter.com/EricaZelic/status/1614075109827874817\nFalse Positives: Another tool that uses the command line switches of PsLogList, Legitimate use of PsLogList by an administrator",
                "severity": "medium",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"psloglist.exe\" or (TargetProcessName endswith \"\\\\psloglist.exe\" or TargetProcessName endswith \"\\\\psloglist64.exe\")) and (TargetProcessCommandLine contains \" security\" or TargetProcessCommandLine contains \" application\" or TargetProcessCommandLine contains \" system\") and (TargetProcessCommandLine contains \" -d\" or TargetProcessCommandLine contains \" /d\" or TargetProcessCommandLine contains \" -x\" or TargetProcessCommandLine contains \" /x\" or TargetProcessCommandLine contains \" -s\" or TargetProcessCommandLine contains \" /s\" or TargetProcessCommandLine contains \" -c\" or TargetProcessCommandLine contains \" /c\" or TargetProcessCommandLine contains \" -g\" or TargetProcessCommandLine contains \" /g\"))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Discovery"],
                "techniques": ["T1087"],
                "alertRuleTemplateName": "aae1243f-d8af-40d8-ab20-33fc6d0c55bc",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}