{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/aef9d1f1-7396-4e92-a927-4567c7a495c1')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/aef9d1f1-7396-4e92-a927-4567c7a495c1')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Suspicious Git Clone",
                "description": "Detects execution of \"git\" in order to clone a remote repository that contain suspicious keywords which might be suspicious\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_git_susp_clone.yml\nAuthor: Nasreddine Bencherchali (Nextron Systems)\nDate Modified: 2023-01-10\nStatus: experimental\nReferences: https://gist.githubusercontent.com/MichaelKoczwara/12faba9c061c12b5814b711166de8c2f/raw/e2068486692897b620c25fde1ea258c8218fe3d3/history.txt\nFalse Positives: Unknown",
                "severity": "medium",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\git.exe\" or TargetProcessName endswith \"\\\\git-remote-https.exe\") or TargetProcessFilename =~ \"git.exe\") and (TargetProcessCommandLine contains \" clone \" or TargetProcessCommandLine contains \"git-remote-https \") and (TargetProcessCommandLine contains \"exploit\" or TargetProcessCommandLine contains \"Vulns\" or TargetProcessCommandLine contains \"vulnerability\" or TargetProcessCommandLine contains \"RemoteCodeExecution\" or TargetProcessCommandLine contains \"Invoke-\" or TargetProcessCommandLine contains \"CVE-\" or TargetProcessCommandLine contains \"poc-\" or TargetProcessCommandLine contains \"ProofOfConcept\" or TargetProcessCommandLine contains \"proxyshell\" or TargetProcessCommandLine contains \"log4shell\" or TargetProcessCommandLine contains \"eternalblue\" or TargetProcessCommandLine contains \"eternal-blue\" or TargetProcessCommandLine contains \"MS17-\"))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Reconnaissance"],
                "techniques": ["T1593"],
                "alertRuleTemplateName": "aef9d1f1-7396-4e92-a927-4567c7a495c1",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}