{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/ba3f5c1b-6272-4119-9dbd-0bc8d21c2702')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/ba3f5c1b-6272-4119-9dbd-0bc8d21c2702')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Potential WinAPI Calls Via CommandLine",
                "description": "Detects the use of WinAPI Functions via the commandline. As seen used by threat actors via the tool winapiexec\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_inline_win_api_access.yml\nAuthor: Nasreddine Bencherchali (Nextron Systems)\nDate Modified: 2023-01-09\nStatus: experimental\nReferences: https://twitter.com/m417z/status/1566674631788007425\nFalse Positives: Unknown",
                "severity": "high",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"AddSecurityPackage\" or TargetProcessCommandLine contains \"AdjustTokenPrivileges\" or TargetProcessCommandLine contains \"Advapi32\" or TargetProcessCommandLine contains \"CloseHandle\" or TargetProcessCommandLine contains \"CreateProcessWithToken\" or TargetProcessCommandLine contains \"CreatePseudoConsole\" or TargetProcessCommandLine contains \"CreateRemoteThread\" or TargetProcessCommandLine contains \"CreateThread\" or TargetProcessCommandLine contains \"CreateUserThread\" or TargetProcessCommandLine contains \"DangerousGetHandle\" or TargetProcessCommandLine contains \"DuplicateTokenEx\" or TargetProcessCommandLine contains \"EnumerateSecurityPackages\" or TargetProcessCommandLine contains \"FreeHGlobal\" or TargetProcessCommandLine contains \"FreeLibrary\" or TargetProcessCommandLine contains \"GetDelegateForFunctionPointer\" or TargetProcessCommandLine contains \"GetLogonSessionData\" or TargetProcessCommandLine contains \"GetModuleHandle\" or TargetProcessCommandLine contains \"GetProcAddress\" or TargetProcessCommandLine contains \"GetProcessHandle\" or TargetProcessCommandLine contains \"GetTokenInformation\" or TargetProcessCommandLine contains \"ImpersonateLoggedOnUser\" or TargetProcessCommandLine contains \"kernel32\" or TargetProcessCommandLine contains \"LoadLibrary\" or TargetProcessCommandLine contains \"memcpy\" or TargetProcessCommandLine contains \"MiniDumpWriteDump\" or TargetProcessCommandLine contains \"ntdll\" or TargetProcessCommandLine contains \"OpenDesktop\" or TargetProcessCommandLine contains \"OpenProcess\" or TargetProcessCommandLine contains \"OpenProcessToken\" or TargetProcessCommandLine contains \"OpenThreadToken\" or TargetProcessCommandLine contains \"OpenWindowStation\" or TargetProcessCommandLine contains \"PtrToString\" or TargetProcessCommandLine contains \"QueueUserApc\" or TargetProcessCommandLine contains \"ReadProcessMemory\" or TargetProcessCommandLine contains \"RevertToSelf\" or TargetProcessCommandLine contains \"RtlCreateUserThread\" or TargetProcessCommandLine contains \"secur32\" or TargetProcessCommandLine contains \"SetThreadToken\" or TargetProcessCommandLine contains \"VirtualAlloc\" or TargetProcessCommandLine contains \"VirtualFree\" or TargetProcessCommandLine contains \"VirtualProtect\" or TargetProcessCommandLine contains \"WaitForSingleObject\" or TargetProcessCommandLine contains \"WriteInt32\" or TargetProcessCommandLine contains \"WriteProcessMemory\" or TargetProcessCommandLine contains \"ZeroFreeGlobalAllocUnicode\") and (not((TargetProcessName endswith \"\\\\MpCmdRun.exe\" and TargetProcessCommandLine contains \"GetLoadLibraryWAddress32\"))))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Execution"],
                "techniques": ["T1106"],
                "alertRuleTemplateName": "ba3f5c1b-6272-4119-9dbd-0bc8d21c2702",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}