{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/c09dad97-1c78-4f71-b127-7edb2b8e491a')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/c09dad97-1c78-4f71-b127-7edb2b8e491a')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Execution of Suspicious File Type Extension",
                "description": "Checks whether the image specified in a process creation event doesn't refer to an .exe file (caused by process ghosting or other unorthodox methods to start a process)\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_non_exe_image.yml\nAuthor: Max Altgelt (Nextron Systems)\nDate Modified: 2023-10-10\nStatus: experimental\nReferences: https://pentestlaboratories.com/2021/12/08/process-ghosting/\nFalse Positives: Unknown",
                "severity": "high",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where ((not((TargetProcessName endswith \".exe\" or TargetProcessName endswith \".tmp\" or TargetProcessName endswith \".scr\"))) and (not(((TargetProcessName =~ \"System\" or TargetProcessName =~ \"Registry\" or TargetProcessName =~ \"MemCompression\" or TargetProcessName =~ \"vmmem\") or TargetProcessName startswith \"C:\\\\Windows\\\\Installer\\\\MSI\" or TargetProcessName startswith \"C:\\\\Windows\\\\System32\\\\DriverStore\\\\FileRepository\\\\\" or (TargetProcessName startswith \"C:\\\\Config.Msi\\\\\" and (TargetProcessName endswith \".rbf\" or TargetProcessName endswith \".rbs\")) or (ActingProcessName startswith \"C:\\\\Windows\\\\Temp\\\\\" and TargetProcessName startswith \"C:\\\\Windows\\\\Temp\\\\Helper\\\\\") or ((TargetProcessName startswith \"C:\\\\Windows\\\\System32\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\SysWOW64\\\\\") and TargetProcessName endswith \".com\") or TargetProcessName startswith \"C:\\\\$Extend\\\\$Deleted\\\\\"))) and (not(((TargetProcessName =~ \"-\" or TargetProcessName =~ \"\") or isnull(TargetProcessName) or ActingProcessName startswith \"C:\\\\ProgramData\\\\Avira\\\\\" or (TargetProcessName contains \"NVIDIA\\\\NvBackend\\\\\" and TargetProcessName endswith \".dat\") or TargetProcessName endswith \"\\\\WinSCP.com\" or (TargetProcessName contains \"C:\\\\Users\\\\\" and TargetProcessName contains \"\\\\AppData\\\\\" and TargetProcessName contains \".tmp\" and TargetProcessName contains \"CodeSetup\") or TargetProcessName endswith \"\\\\program\\\\soffice.bin\" or TargetProcessName endswith \"\\\\program\\\\unopkg.bin\" or (TargetProcessName =~ \"C:\\\\Program Files\\\\EMC NetWorker\\\\Management\\\\GST\\\\apache\\\\cgi-bin\\\\update_jnlp.cgi\" or TargetProcessName =~ \"C:\\\\Program Files (x86)\\\\EMC NetWorker\\\\Management\\\\GST\\\\apache\\\\cgi-bin\\\\update_jnlp.cgi\") or ((TargetProcessName startswith \"C:\\\\Program Files (x86)\\\\WINPAKPRO\\\\\" or TargetProcessName startswith \"C:\\\\Program Files\\\\WINPAKPRO\\\\\") and TargetProcessName endswith \".ngn\") or (TargetProcessName =~ \"C:\\\\Program Files (x86)\\\\MyQ\\\\Server\\\\pcltool.dll\" or TargetProcessName =~ \"C:\\\\Program Files\\\\MyQ\\\\Server\\\\pcltool.dll\") or ((TargetProcessName startswith \"C:\\\\Program Files\\\\Microsoft Visual Studio\\\\\" or TargetProcessName startswith \"C:\\\\Program Files (x86)\\\\Microsoft Visual Studio\") and TargetProcessName endswith \".com\") or (TargetProcessName contains \"\\\\AppData\\\\Local\\\\Packages\\\\\" and TargetProcessName contains \"\\\\LocalState\\\\rootfs\\\\\") or TargetProcessName endswith \"\\\\LZMA_EXE\" or (ActingProcessName startswith \"C:\\\\Windows\\\\Temp\\\\\" and ActingProcessName endswith \"\\\\TBT_Dock_Firmware\\\\GetDockVer32W.exe\") or TargetProcessName startswith \"C:\\\\Program Files\\\\Mozilla Firefox\\\\tobedeleted\\\\\" or (ActingProcessName =~ \"C:\\\\Windows\\\\UUS\\\\amd64\\\\MoUsoCoreWorker.exe\" and TargetProcessName startswith \"C:\\\\$Extend\\\\$Deleted\\\\\" and (TargetProcessCommandLine contains \"C:\\\\Program Files\\\\Common Files\\\\Microsoft Shared\\\\ClickToRun\\\\OfficeC2RClient.exe\" and TargetProcessCommandLine contains \"/update UPDATEORCHESTRATOR displaylevel=False\")) or (ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\services.exe\" and TargetProcessName endswith \"com.docker.service\")))))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion"],
                "techniques": [],
                "alertRuleTemplateName": "c09dad97-1c78-4f71-b127-7edb2b8e491a",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}