{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/c86500e9-a645-4680-98d7-f882c70c1ea3')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/c86500e9-a645-4680-98d7-f882c70c1ea3')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "AADInternals PowerShell Cmdlets Execution - ProccessCreation",
                "description": "Detects ADDInternals Cmdlet execution. A tool for administering Azure AD and Office 365. Which can be abused by threat actors to attack Azure AD or Office 365.\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_aadinternals_cmdlets_execution.yml\nAuthor: Austin Songer (@austinsonger), Nasreddine Bencherchali (Nextron Systems)\nDate Modified: None\nStatus: experimental\nReferences: https://o365blog.com/aadinternals/, https://github.com/Gerenios/AADInternals\nFalse Positives: Legitimate use of the library for administrative activity",
                "severity": "high",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.Exe\" or TargetProcessFilename =~ \"pwsh.dll\")) and (TargetProcessCommandLine contains \"Add-AADInt\" or TargetProcessCommandLine contains \"ConvertTo-AADInt\" or TargetProcessCommandLine contains \"Disable-AADInt\" or TargetProcessCommandLine contains \"Enable-AADInt\" or TargetProcessCommandLine contains \"Export-AADInt\" or TargetProcessCommandLine contains \"Get-AADInt\" or TargetProcessCommandLine contains \"Grant-AADInt\" or TargetProcessCommandLine contains \"Install-AADInt\" or TargetProcessCommandLine contains \"Invoke-AADInt\" or TargetProcessCommandLine contains \"Join-AADInt\" or TargetProcessCommandLine contains \"New-AADInt\" or TargetProcessCommandLine contains \"Open-AADInt\" or TargetProcessCommandLine contains \"Read-AADInt\" or TargetProcessCommandLine contains \"Register-AADInt\" or TargetProcessCommandLine contains \"Remove-AADInt\" or TargetProcessCommandLine contains \"Restore-AADInt\" or TargetProcessCommandLine contains \"Search-AADInt\" or TargetProcessCommandLine contains \"Send-AADInt\" or TargetProcessCommandLine contains \"Set-AADInt\" or TargetProcessCommandLine contains \"Start-AADInt\" or TargetProcessCommandLine contains \"Update-AADInt\"))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Impact", "CredentialAccess", "Execution", "Reconnaissance", "Discovery"],
                "techniques": [],
                "alertRuleTemplateName": "c86500e9-a645-4680-98d7-f882c70c1ea3",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}