{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/e4a6b256-3e47-40fc-89d2-7a477edd6915')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/e4a6b256-3e47-40fc-89d2-7a477edd6915')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "System File Execution Location Anomaly",
                "description": "Detects a Windows program executable started from a suspicious folder\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_system_exe_anomaly.yml\nAuthor: Florian Roth (Nextron Systems), Patrick Bareiss, Anton Kutepov, oscd.community, Nasreddine Bencherchali\nDate Modified: 2023-10-18\nStatus: experimental\nReferences: https://twitter.com/GelosSnake/status/934900723426439170, https://asec.ahnlab.com/en/39828/\nFalse Positives: Exotic software",
                "severity": "high",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\svchost.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\services.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\powershell_ise.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\spoolsv.exe\" or TargetProcessName endswith \"\\\\lsass.exe\" or TargetProcessName endswith \"\\\\smss.exe\" or TargetProcessName endswith \"\\\\csrss.exe\" or TargetProcessName endswith \"\\\\conhost.exe\" or TargetProcessName endswith \"\\\\wininit.exe\" or TargetProcessName endswith \"\\\\lsm.exe\" or TargetProcessName endswith \"\\\\winlogon.exe\" or TargetProcessName endswith \"\\\\explorer.exe\" or TargetProcessName endswith \"\\\\taskhost.exe\" or TargetProcessName endswith \"\\\\Taskmgr.exe\" or TargetProcessName endswith \"\\\\sihost.exe\" or TargetProcessName endswith \"\\\\RuntimeBroker.exe\" or TargetProcessName endswith \"\\\\smartscreen.exe\" or TargetProcessName endswith \"\\\\dllhost.exe\" or TargetProcessName endswith \"\\\\audiodg.exe\" or TargetProcessName endswith \"\\\\wlanext.exe\" or TargetProcessName endswith \"\\\\dashost.exe\" or TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\wscript.exe\" or TargetProcessName endswith \"\\\\wsl.exe\" or TargetProcessName endswith \"\\\\bitsadmin.exe\" or TargetProcessName endswith \"\\\\atbroker.exe\" or TargetProcessName endswith \"\\\\bcdedit.exe\" or TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessName endswith \"\\\\certreq.exe\" or TargetProcessName endswith \"\\\\cmstp.exe\" or TargetProcessName endswith \"\\\\consent.exe\" or TargetProcessName endswith \"\\\\defrag.exe\" or TargetProcessName endswith \"\\\\dism.exe\" or TargetProcessName endswith \"\\\\dllhst3g.exe\" or TargetProcessName endswith \"\\\\eventvwr.exe\" or TargetProcessName endswith \"\\\\msiexec.exe\" or TargetProcessName endswith \"\\\\runonce.exe\" or TargetProcessName endswith \"\\\\winver.exe\" or TargetProcessName endswith \"\\\\logonui.exe\" or TargetProcessName endswith \"\\\\userinit.exe\" or TargetProcessName endswith \"\\\\dwm.exe\" or TargetProcessName endswith \"\\\\LsaIso.exe\" or TargetProcessName endswith \"\\\\ntoskrnl.exe\" or TargetProcessName endswith \"\\\\wsmprovhost.exe\" or TargetProcessName endswith \"\\\\dfrgui.exe\") and (not((((TargetProcessName startswith \"C:\\\\Windows\\\\System32\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\SysWOW64\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\WinSxS\\\\\") or TargetProcessName contains \"\\\\SystemRoot\\\\System32\\\\\" or (TargetProcessName =~ \"C:\\\\Windows\\\\explorer.exe\" or TargetProcessName =~ \"C:\\\\Program Files\\\\PowerShell\\\\7\\\\pwsh.exe\" or TargetProcessName =~ \"C:\\\\Program Files\\\\PowerShell\\\\7-preview\\\\pwsh.exe\")) or (TargetProcessName startswith \"C:\\\\Program Files\\\\WindowsApps\\\\MicrosoftCorporationII.WindowsSubsystemForLinux\" and TargetProcessName endswith \"\\\\wsl.exe\")))))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion"],
                "techniques": ["T1036"],
                "alertRuleTemplateName": "e4a6b256-3e47-40fc-89d2-7a477edd6915",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}