{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/efdd8dd5-cee8-4e59-9390-7d4d5e4dd6f6')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/efdd8dd5-cee8-4e59-9390-7d4d5e4dd6f6')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Suspicious Program Names",
                "description": "Detects suspicious patterns in program names or folders that are often found in malicious samples or hacktools\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_progname.yml\nAuthor: Florian Roth (Nextron Systems)\nDate Modified: 2023-03-22\nStatus: test\nReferences: https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md\nFalse Positives: Legitimate tools that accidentally match on the searched patterns",
                "severity": "high",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where (((TargetProcessName contains \"\\\\CVE-202\" or TargetProcessName contains \"\\\\CVE202\") or (TargetProcessName endswith \"\\\\poc.exe\" or TargetProcessName endswith \"\\\\artifact.exe\" or TargetProcessName endswith \"\\\\artifact64.exe\" or TargetProcessName endswith \"\\\\artifact_protected.exe\" or TargetProcessName endswith \"\\\\artifact32.exe\" or TargetProcessName endswith \"\\\\artifact32big.exe\" or TargetProcessName endswith \"obfuscated.exe\" or TargetProcessName endswith \"obfusc.exe\" or TargetProcessName endswith \"\\\\meterpreter\")) or (TargetProcessCommandLine contains \"inject.ps1\" or TargetProcessCommandLine contains \"Invoke-CVE\" or TargetProcessCommandLine contains \"pupy.ps1\" or TargetProcessCommandLine contains \"payload.ps1\" or TargetProcessCommandLine contains \"beacon.ps1\" or TargetProcessCommandLine contains \"PowerView.ps1\" or TargetProcessCommandLine contains \"bypass.ps1\" or TargetProcessCommandLine contains \"obfuscated.ps1\" or TargetProcessCommandLine contains \"obfusc.ps1\" or TargetProcessCommandLine contains \"obfus.ps1\" or TargetProcessCommandLine contains \"obfs.ps1\" or TargetProcessCommandLine contains \"evil.ps1\" or TargetProcessCommandLine contains \"MiniDogz.ps1\" or TargetProcessCommandLine contains \"_enc.ps1\" or TargetProcessCommandLine contains \"\\\\shell.ps1\" or TargetProcessCommandLine contains \"\\\\rshell.ps1\" or TargetProcessCommandLine contains \"revshell.ps1\" or TargetProcessCommandLine contains \"\\\\av.ps1\" or TargetProcessCommandLine contains \"\\\\av_test.ps1\" or TargetProcessCommandLine contains \"adrecon.ps1\" or TargetProcessCommandLine contains \"mimikatz.ps1\" or TargetProcessCommandLine contains \"\\\\PowerUp_\" or TargetProcessCommandLine contains \"powerup.ps1\" or TargetProcessCommandLine contains \"\\\\Temp\\\\a.ps1\" or TargetProcessCommandLine contains \"\\\\Temp\\\\p.ps1\" or TargetProcessCommandLine contains \"\\\\Temp\\\\1.ps1\" or TargetProcessCommandLine contains \"Hound.ps1\" or TargetProcessCommandLine contains \"encode.ps1\" or TargetProcessCommandLine contains \"powercat.ps1\"))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Execution"],
                "techniques": ["T1059"],
                "alertRuleTemplateName": "efdd8dd5-cee8-4e59-9390-7d4d5e4dd6f6",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}