{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/f24bcaea-0cd1-11eb-adc1-0242ac120002')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/f24bcaea-0cd1-11eb-adc1-0242ac120002')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Suspicious Atbroker Execution",
                "description": "Atbroker executing non-deafualt Assistive Technology applications\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_susp_atbroker.yml\nAuthor: Mateusz Wydra, oscd.community\nDate Modified: 2022-10-09\nStatus: test\nReferences: http://www.hexacorn.com/blog/2016/07/22/beyond-good-ol-run-key-part-42/, https://lolbas-project.github.io/lolbas/Binaries/Atbroker/\nFalse Positives: Legitimate, non-default assistive technology applications execution",
                "severity": "high",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where ((TargetProcessName endswith \"AtBroker.exe\" and TargetProcessCommandLine contains \"start\") and (not((TargetProcessCommandLine contains \"animations\" or TargetProcessCommandLine contains \"audiodescription\" or TargetProcessCommandLine contains \"caretbrowsing\" or TargetProcessCommandLine contains \"caretwidth\" or TargetProcessCommandLine contains \"colorfiltering\" or TargetProcessCommandLine contains \"cursorscheme\" or TargetProcessCommandLine contains \"filterkeys\" or TargetProcessCommandLine contains \"focusborderheight\" or TargetProcessCommandLine contains \"focusborderwidth\" or TargetProcessCommandLine contains \"highcontrast\" or TargetProcessCommandLine contains \"keyboardcues\" or TargetProcessCommandLine contains \"keyboardpref\" or TargetProcessCommandLine contains \"magnifierpane\" or TargetProcessCommandLine contains \"messageduration\" or TargetProcessCommandLine contains \"minimumhitradius\" or TargetProcessCommandLine contains \"mousekeys\" or TargetProcessCommandLine contains \"Narrator\" or TargetProcessCommandLine contains \"osk\" or TargetProcessCommandLine contains \"overlappedcontent\" or TargetProcessCommandLine contains \"showsounds\" or TargetProcessCommandLine contains \"soundsentry\" or TargetProcessCommandLine contains \"stickykeys\" or TargetProcessCommandLine contains \"togglekeys\" or TargetProcessCommandLine contains \"windowarranging\" or TargetProcessCommandLine contains \"windowtracking\" or TargetProcessCommandLine contains \"windowtrackingtimeout\" or TargetProcessCommandLine contains \"windowtrackingzorder\"))))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion"],
                "techniques": ["T1218"],
                "alertRuleTemplateName": "f24bcaea-0cd1-11eb-adc1-0242ac120002",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}