{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/f2c64357-b1d2-41b7-849f-34d2682c0fad')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/f2c64357-b1d2-41b7-849f-34d2682c0fad')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Suspicious Command Patterns In Scheduled Task Creation",
                "description": "Detects scheduled task creation using \"schtasks\" that contain potentially suspicious or uncommon commands\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_schtasks_susp_pattern.yml\nAuthor: Florian Roth (Nextron Systems)\nDate Modified: 2023-05-15\nStatus: experimental\nReferences: https://app.any.run/tasks/512c1352-6380-4436-b27d-bb62f0c020d6/, https://twitter.com/RedDrip7/status/1506480588827467785, https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/devil-bait/NCSC-MAR-Devil-Bait.pdf\nFalse Positives: Software installers that run from temporary folders and also install scheduled tasks are expected to generate some false positives",
                "severity": "high",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\schtasks.exe\" and TargetProcessCommandLine contains \"/Create \") and (((TargetProcessCommandLine contains \"/sc minute \" or TargetProcessCommandLine contains \"/ru system \") and (TargetProcessCommandLine contains \"cmd /c\" or TargetProcessCommandLine contains \"cmd /k\" or TargetProcessCommandLine contains \"cmd /r\" or TargetProcessCommandLine contains \"cmd.exe /c \" or TargetProcessCommandLine contains \"cmd.exe /k \" or TargetProcessCommandLine contains \"cmd.exe /r \")) or (TargetProcessCommandLine contains \" -decode \" or TargetProcessCommandLine contains \" -enc \" or TargetProcessCommandLine contains \" -w hidden \" or TargetProcessCommandLine contains \" bypass \" or TargetProcessCommandLine contains \" IEX\" or TargetProcessCommandLine contains \".DownloadData\" or TargetProcessCommandLine contains \".DownloadFile\" or TargetProcessCommandLine contains \".DownloadString\" or TargetProcessCommandLine contains \"/c start /min \" or TargetProcessCommandLine contains \"FromBase64String\" or TargetProcessCommandLine contains \"mshta http\" or TargetProcessCommandLine contains \"mshta.exe http\") or ((TargetProcessCommandLine contains \"\\\\AppData\\\\\" and TargetProcessCommandLine contains \"%AppData%\" and TargetProcessCommandLine contains \"%Temp%\" and TargetProcessCommandLine contains \"%tmp%\" and TargetProcessCommandLine contains \"C:\\\\Windows\\\\Temp\\\\\") and (TargetProcessCommandLine contains \"/xml C:\\\\Users\\\\\" and TargetProcessCommandLine contains \"cscript\" and TargetProcessCommandLine contains \"curl\" and TargetProcessCommandLine contains \"wscript\"))))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["PrivilegeEscalation", "Execution"],
                "techniques": ["T1053"],
                "alertRuleTemplateName": "f2c64357-b1d2-41b7-849f-34d2682c0fad",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}