{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/f376c8a7-a2d0-4ddc-aa0c-16c17236d962')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/f376c8a7-a2d0-4ddc-aa0c-16c17236d962')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "HackTool - Bloodhound/Sharphound Execution",
                "description": "Detects command line parameters used by Bloodhound and Sharphound hack tools\nSource URL: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_bloodhound_sharphound.yml\nAuthor: Florian Roth (Nextron Systems)\nDate Modified: 2023-02-04\nStatus: test\nReferences: https://github.com/BloodHoundAD/BloodHound, https://github.com/BloodHoundAD/SharpHound\nFalse Positives: Other programs that use these command line option and accepts an 'All' parameter",
                "severity": "high",
                "enabled": true,
                "query": "_Im_ProcessCreate\n| where ((TargetProcessFileProduct contains \"SharpHound\" or TargetProcessFileDescription contains \"SharpHound\" or (Company contains \"SpecterOps\" or Company contains \"evil corp\") or (TargetProcessName contains \"\\\\Bloodhound.exe\" or TargetProcessName contains \"\\\\SharpHound.exe\")) or (TargetProcessCommandLine contains \" -CollectionMethod All \" or TargetProcessCommandLine contains \" --CollectionMethods Session \" or TargetProcessCommandLine contains \" --Loop --Loopduration \" or TargetProcessCommandLine contains \" --PortScanTimeout \" or TargetProcessCommandLine contains \".exe -c All -d \" or TargetProcessCommandLine contains \"Invoke-Bloodhound\" or TargetProcessCommandLine contains \"Get-BloodHoundData\") or (TargetProcessCommandLine contains \" -JsonFolder \" and TargetProcessCommandLine contains \" -ZipFileName \") or (TargetProcessCommandLine contains \" DCOnly \" and TargetProcessCommandLine contains \" --NoSaveCache \"))",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Discovery", "Execution"],
                "techniques": ["T1087", "T1069", "T1482", "T1059"],
                "alertRuleTemplateName": "f376c8a7-a2d0-4ddc-aa0c-16c17236d962",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}