{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000209')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000209')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 09",
                "description": "Sigma Windows Process Creation medium 09",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\SharPersist.exe\" or TargetProcessFileProduct =~ \"SharPersist\") or (TargetProcessCommandLine contains \" -t schtask -c \" or TargetProcessCommandLine contains \" -t startupfolder -c \") or (TargetProcessCommandLine contains \" -t reg -c \" and TargetProcessCommandLine contains \" -m add\") or (TargetProcessCommandLine contains \" -t service -c \" and TargetProcessCommandLine contains \" -m add\") or (TargetProcessCommandLine contains \" -t schtask -c \" and TargetProcessCommandLine contains \" -m add\"))|extend RuleId=\"26488ad0-f9fd-4536-876f-52fea846a2e4\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_sharpersist.yml\"|extend RuleTitle=\"HackTool - SharPersist Execution\"|extend RuleDescription=\"Detects the execution of the hacktool SharPersist - used to deploy various different kinds of persistence mechanisms\";\nlet q1=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\SharpEvtMute.exe\" or TargetProcessFileDescription =~ \"SharpEvtMute\" or (TargetProcessCommandLine contains \"--Filter \\\"rule \" or TargetProcessCommandLine contains \"--Encoded --Filter \\\\\\\"\"))|extend RuleId=\"bedfc8ad-d1c7-4e37-a20e-e2b0dbee759c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_sharpevtmute.yml\"|extend RuleTitle=\"HackTool - SharpEvtMute Execution\"|extend RuleDescription=\"Detects the use of SharpEvtHook, a tool that tampers with the Windows event logs\";\nlet q2=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\SharpLdapWhoami.exe\" or (TargetProcessFilename contains \"SharpLdapWhoami\" or TargetProcessFileProduct =~ \"SharpLdapWhoami\") or (TargetProcessCommandLine endswith \" /method:ntlm\" or TargetProcessCommandLine endswith \" /method:kerb\" or TargetProcessCommandLine endswith \" /method:nego\" or TargetProcessCommandLine endswith \" /m:nego\" or TargetProcessCommandLine endswith \" /m:ntlm\" or TargetProcessCommandLine endswith \" /m:kerb\"))|extend RuleId=\"d9367cbb-c2e0-47ce-bdc0-128cb6da898d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_sharpldapwhoami.yml\"|extend RuleTitle=\"HackTool - SharpLdapWhoami Execution\"|extend RuleDescription=\"Detects SharpLdapWhoami, a whoami alternative that queries the LDAP service on a domain controller\";\nlet q3=_Im_ProcessCreate\n| where (TargetProcessFilename =~ \"SharpView.exe\" or TargetProcessName endswith \"\\\\SharpView.exe\" or (TargetProcessCommandLine contains \"Add-RemoteConnection\" or TargetProcessCommandLine contains \"Convert-ADName\" or TargetProcessCommandLine contains \"ConvertFrom-SID\" or TargetProcessCommandLine contains \"ConvertFrom-UACValue\" or TargetProcessCommandLine contains \"Convert-SidToName\" or TargetProcessCommandLine contains \"Export-PowerViewCSV\" or TargetProcessCommandLine contains \"Find-DomainObjectPropertyOutlier\" or TargetProcessCommandLine contains \"Find-DomainProcess\" or TargetProcessCommandLine contains \"Find-DomainShare\" or TargetProcessCommandLine contains \"Find-DomainUserEvent\" or TargetProcessCommandLine contains \"Find-DomainUserLocation\" or TargetProcessCommandLine contains \"Find-ForeignGroup\" or TargetProcessCommandLine contains \"Find-ForeignUser\" or TargetProcessCommandLine contains \"Find-GPOComputerAdmin\" or TargetProcessCommandLine contains \"Find-GPOLocation\" or TargetProcessCommandLine contains \"Find-Interesting\" or TargetProcessCommandLine contains \"Find-LocalAdminAccess\" or TargetProcessCommandLine contains \"Find-ManagedSecurityGroups\" or TargetProcessCommandLine contains \"Get-CachedRDPConnection\" or TargetProcessCommandLine contains \"Get-DFSshare\" or TargetProcessCommandLine contains \"Get-DomainComputer\" or TargetProcessCommandLine contains \"Get-DomainController\" or TargetProcessCommandLine contains \"Get-DomainDFSShare\" or TargetProcessCommandLine contains \"Get-DomainDNSRecord\" or TargetProcessCommandLine contains \"Get-DomainFileServer\" or TargetProcessCommandLine contains \"Get-DomainForeign\" or TargetProcessCommandLine contains \"Get-DomainGPO\" or TargetProcessCommandLine contains \"Get-DomainGroup\" or TargetProcessCommandLine contains \"Get-DomainGUIDMap\" or TargetProcessCommandLine contains \"Get-DomainManagedSecurityGroup\" or TargetProcessCommandLine contains \"Get-DomainObject\" or TargetProcessCommandLine contains \"Get-DomainOU\" or TargetProcessCommandLine contains \"Get-DomainPolicy\" or TargetProcessCommandLine contains \"Get-DomainSID\" or TargetProcessCommandLine contains \"Get-DomainSite\" or TargetProcessCommandLine contains \"Get-DomainSPNTicket\" or TargetProcessCommandLine contains \"Get-DomainSubnet\" or TargetProcessCommandLine contains \"Get-DomainTrust\" or TargetProcessCommandLine contains \"Get-DomainUserEvent\" or TargetProcessCommandLine contains \"Get-ForestDomain\" or TargetProcessCommandLine contains \"Get-ForestGlobalCatalog\" or TargetProcessCommandLine contains \"Get-ForestTrust\" or TargetProcessCommandLine contains \"Get-GptTmpl\" or TargetProcessCommandLine contains \"Get-GroupsXML\" or TargetProcessCommandLine contains \"Get-LastLoggedOn\" or TargetProcessCommandLine contains \"Get-LoggedOnLocal\" or TargetProcessCommandLine contains \"Get-NetComputer\" or TargetProcessCommandLine contains \"Get-NetDomain\" or TargetProcessCommandLine contains \"Get-NetFileServer\" or TargetProcessCommandLine contains \"Get-NetForest\" or TargetProcessCommandLine contains \"Get-NetGPO\" or TargetProcessCommandLine contains \"Get-NetGroupMember\" or TargetProcessCommandLine contains \"Get-NetLocalGroup\" or TargetProcessCommandLine contains \"Get-NetLoggedon\" or TargetProcessCommandLine contains \"Get-NetOU\" or TargetProcessCommandLine contains \"Get-NetProcess\" or TargetProcessCommandLine contains \"Get-NetRDPSession\" or TargetProcessCommandLine contains \"Get-NetSession\" or TargetProcessCommandLine contains \"Get-NetShare\" or TargetProcessCommandLine contains \"Get-NetSite\" or TargetProcessCommandLine contains \"Get-NetSubnet\" or TargetProcessCommandLine contains \"Get-NetUser\" or TargetProcessCommandLine contains \"Get-PathAcl\" or TargetProcessCommandLine contains \"Get-PrincipalContext\" or TargetProcessCommandLine contains \"Get-RegistryMountedDrive\" or TargetProcessCommandLine contains \"Get-RegLoggedOn\" or TargetProcessCommandLine contains \"Get-WMIRegCachedRDPConnection\" or TargetProcessCommandLine contains \"Get-WMIRegLastLoggedOn\" or TargetProcessCommandLine contains \"Get-WMIRegMountedDrive\" or TargetProcessCommandLine contains \"Get-WMIRegProxy\" or TargetProcessCommandLine contains \"Invoke-ACLScanner\" or TargetProcessCommandLine contains \"Invoke-CheckLocalAdminAccess\" or TargetProcessCommandLine contains \"Invoke-Kerberoast\" or TargetProcessCommandLine contains \"Invoke-MapDomainTrust\" or TargetProcessCommandLine contains \"Invoke-RevertToSelf\" or TargetProcessCommandLine contains \"Invoke-Sharefinder\" or TargetProcessCommandLine contains \"Invoke-UserImpersonation\" or TargetProcessCommandLine contains \"Remove-DomainObjectAcl\" or TargetProcessCommandLine contains \"Remove-RemoteConnection\" or TargetProcessCommandLine contains \"Request-SPNTicket\" or TargetProcessCommandLine contains \"Set-DomainObject\" or TargetProcessCommandLine contains \"Test-AdminAccess\"))|extend RuleId=\"b2317cfa-4a47-4ead-b3ff-297438c0bc2d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_sharpview.yml\"|extend RuleTitle=\"HackTool - SharpView Execution\"|extend RuleDescription=\"Adversaries may look for details about the network configuration and settings of systems they access or through information discovery of remote systems\";\nlet q4=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\SharpChisel.exe\" or TargetProcessFileProduct =~ \"SharpChisel\")|extend RuleId=\"cf93e05e-d798-4d9e-b522-b0248dc61eaf\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_sharp_chisel.yml\"|extend RuleTitle=\"HackTool - SharpChisel Execution\"|extend RuleDescription=\"Detects usage of the Sharp Chisel via the commandline arguments\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\SharpImpersonation.exe\" or TargetProcessFilename =~ \"SharpImpersonation.exe\") or ((TargetProcessCommandLine contains \" user:\" and TargetProcessCommandLine contains \" binary:\") or (TargetProcessCommandLine contains \" user:\" and TargetProcessCommandLine contains \" shellcode:\") or (TargetProcessCommandLine contains \" technique:CreateProcessAsUserW\" or TargetProcessCommandLine contains \" technique:ImpersonateLoggedOnuser\")))|extend RuleId=\"f89b08d0-77ad-4728-817b-9b16c5a69c7a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_sharp_impersonation.yml\"|extend RuleTitle=\"HackTool - SharpImpersonation Execution\"|extend RuleDescription=\"Detects execution of the SharpImpersonation tool. Which can be used to manipulate tokens on a Windows computers remotely (PsExec/WmiExec) or interactively\";\nlet q6=_Im_ProcessCreate\n| where TargetProcessFileDescription contains \"st2stager\"|extend RuleId=\"03552375-cc2c-4883-bbe4-7958d5a980be\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_silenttrinity_stager.yml\"|extend RuleTitle=\"HackTool - SILENTTRINITY Stager Execution\"|extend RuleDescription=\"Detects SILENTTRINITY stager use via PE metadata\";\nlet q7=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\Stracciatella.exe\" or TargetProcessFilename =~ \"Stracciatella.exe\" or TargetProcessFileDescription =~ \"Stracciatella\" or (TargetProcessIMPHASH=~\"SHA256=9d25e61ec1527e2a69d7c2a4e3fe2fe15890710c198a66a9f25d99fdf6c7b956\" or TargetProcessIMPHASH=~\"SHA256=fd16609bd9830c63b9413671678bb159b89c357d21942ddbb6b93add808d121a\") or (TargetProcessSHA256 =~ \"9d25e61ec1527e2a69d7c2a4e3fe2fe15890710c198a66a9f25d99fdf6c7b956\" or TargetProcessSHA256 =~ \"fd16609bd9830c63b9413671678bb159b89c357d21942ddbb6b93add808d121a\"))|extend RuleId=\"7a4d9232-92fc-404d-8ce1-4c92e7caf539\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_stracciatella_execution.yml\"|extend RuleTitle=\"HackTool - Stracciatella Execution\"|extend RuleDescription=\"Detects Stracciatella which executes a Powershell runspace from within C# (aka SharpPick technique) with AMSI, ETW and Script Block Logging disabled based on PE metadata characteristics.\";\nlet q8=_Im_ProcessCreate\n| where (TargetProcessFilename =~ \"TruffleSnout.exe\" or TargetProcessName endswith \"\\\\TruffleSnout.exe\")|extend RuleId=\"69ca006d-b9a9-47f5-80ff-ecd4d25d481a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_trufflesnout.yml\"|extend RuleTitle=\"HackTool - TruffleSnout Execution\"|extend RuleDescription=\"Detects the use of TruffleSnout.exe an iterative AD discovery toolkit for offensive operators, situational awareness and targeted low noise enumeration.\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessFileProduct =~ \"UACMe\" or (TargetProcessFileCompany =~ \"REvol Corp\" or TargetProcessFileCompany =~ \"APT 92\" or TargetProcessFileCompany =~ \"UG North\" or TargetProcessFileCompany =~ \"Hazardous Environments\" or TargetProcessFileCompany =~ \"CD Project Rekt\") or (TargetProcessFileDescription =~ \"UACMe main module\" or TargetProcessFileDescription =~ \"Pentesting utility\") or (TargetProcessFilename =~ \"Akagi.exe\" or TargetProcessFilename =~ \"Akagi64.exe\")) or (TargetProcessName endswith \"\\\\Akagi64.exe\" or TargetProcessName endswith \"\\\\Akagi.exe\") or (TargetProcessIMPHASH=~\"767637C23BB42CD5D7397CF58B0BE688\" or TargetProcessIMPHASH=~\"14C4E4C72BA075E9069EE67F39188AD8\" or TargetProcessIMPHASH=~\"3C782813D4AFCE07BBFC5A9772ACDBDC\" or TargetProcessIMPHASH=~\"7D010C6BB6A3726F327F7E239166D127\" or TargetProcessIMPHASH=~\"89159BA4DD04E4CE5559F132A9964EB3\" or TargetProcessIMPHASH=~\"6F33F4A5FC42B8CEC7314947BD13F30F\" or TargetProcessIMPHASH=~\"5834ED4291BDEB928270428EBBAF7604\" or TargetProcessIMPHASH=~\"5A8A8A43F25485E7EE1B201EDCBC7A38\" or TargetProcessIMPHASH=~\"DC7D30B90B2D8ABF664FBED2B1B59894\" or TargetProcessIMPHASH=~\"41923EA1F824FE63EA5BEB84DB7A3E74\" or TargetProcessIMPHASH=~\"3DE09703C8E79ED2CA3F01074719906B\") or (TargetProcessIMPHASH =~ \"767637c23bb42cd5d7397cf58b0be688\" or TargetProcessIMPHASH =~ \"14c4e4c72ba075e9069ee67f39188ad8\" or TargetProcessIMPHASH =~ \"3c782813d4afce07bbfc5a9772acdbdc\" or TargetProcessIMPHASH =~ \"7d010c6bb6a3726f327f7e239166d127\" or TargetProcessIMPHASH =~ \"89159ba4dd04e4ce5559f132a9964eb3\" or TargetProcessIMPHASH =~ \"6f33f4a5fc42b8cec7314947bd13f30f\" or TargetProcessIMPHASH =~ \"5834ed4291bdeb928270428ebbaf7604\" or TargetProcessIMPHASH =~ \"5a8a8a43f25485e7ee1b201edcbc7a38\" or TargetProcessIMPHASH =~ \"dc7d30b90b2d8abf664fbed2b1b59894\" or TargetProcessIMPHASH =~ \"41923ea1f824fe63ea5beb84db7a3e74\" or TargetProcessIMPHASH =~ \"3de09703c8e79ed2ca3f01074719906b\"))|extend RuleId=\"d38d2fa4-98e6-4a24-aff1-410b0c9ad177\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_uacme.yml\"|extend RuleTitle=\"HackTool - UACMe Akagi Execution\"|extend RuleDescription=\"Detects the execution of UACMe, a tool used for UAC bypasses, via default PE metadata\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Persistence", "PrivilegeEscalation", "DefenseEvasion", "Discovery", "Execution", "CommandAndControl"],
                "techniques": ["T1053", "T1069", "T1548", "T1033", "T1562", "T1135", "T1482", "T1134", "T1071", "T1090", "T1059", "T1049"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000209",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}