{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000200')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000200')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 00",
                "description": "Sigma Windows Process Creation medium 00",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\addinutil.exe\" or TargetProcessFilename =~ \"AddInUtil.exe\") and (((TargetProcessCommandLine contains \"-AddInRoot:\" or TargetProcessCommandLine contains \"-PipelineRoot:\") and (TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\Desktop\\\\\" or TargetProcessCommandLine contains \"\\\\Downloads\\\\\" or TargetProcessCommandLine contains \"\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\Temp\\\\\")) or ((TargetProcessCommandLine contains \"-AddInRoot:.\" or TargetProcessCommandLine contains \"-AddInRoot:\\\".\\\"\" or TargetProcessCommandLine contains \"-PipelineRoot:.\" or TargetProcessCommandLine contains \"-PipelineRoot:\\\".\\\"\") and (TargetProcessCurrentDirectory contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or TargetProcessCurrentDirectory contains \"\\\\Desktop\\\\\" or TargetProcessCurrentDirectory contains \"\\\\Downloads\\\\\" or TargetProcessCurrentDirectory contains \"\\\\Users\\\\Public\\\\\" or TargetProcessCurrentDirectory contains \"\\\\Windows\\\\Temp\\\\\"))))|extend RuleId=\"631b22a4-70f4-4e2f-9ea8-42f84d9df6d8\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_addinutil_suspicious_cmdline.yml\"|extend RuleTitle=\"Suspicious AddinUtil.EXE CommandLine Execution\"|extend RuleDescription=\"\"Detects execution of the Add-In deployment cache updating utility (AddInutil.exe) with suspicious Addinroot or Pipelineroot paths. An adversary may execute AddinUtil.exe with uncommon Addinroot/Pipelineroot paths that point to the adversaries Addins.Store payload.\\n\"\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\adplus.exe\" or TargetProcessFilename =~ \"Adplus.exe\") and (TargetProcessCommandLine contains \" -hang \" or TargetProcessCommandLine contains \" -pn \" or TargetProcessCommandLine contains \" -pmn \" or TargetProcessCommandLine contains \" -p \" or TargetProcessCommandLine contains \" -po \" or TargetProcessCommandLine contains \" -c \" or TargetProcessCommandLine contains \" -sc \"))|extend RuleId=\"2f869d59-7f6a-4931-992c-cce556ff2d53\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_adplus_memory_dump.yml\"|extend RuleTitle=\"Potential Adplus.EXE Abuse\"|extend RuleDescription=\"\"Detects execution of \\\"AdPlus.exe\\\", a binary that is part of the Windows SDK that can be used as a LOLBIN in order to dump process memory and execute arbitrary commands.\"\";\nlet q2=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\AgentExecutor.exe\" or TargetProcessFilename =~ \"AgentExecutor.exe\") and (TargetProcessCommandLine contains \" -powershell\" or TargetProcessCommandLine contains \" -remediationScript\")) and (not((TargetProcessCommandLine contains \"C:\\\\Windows\\\\SysWOW64\\\\WindowsPowerShell\\\\v1.0\\\\\" or TargetProcessCommandLine contains \"C:\\\\Windows\\\\System32\\\\WindowsPowerShell\\\\v1.0\\\\\"))))|extend RuleId=\"c0b40568-b1e9-4b03-8d6c-b096da6da9ab\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_agentexecutor_susp_usage.yml\"|extend RuleTitle=\"Suspicious AgentExecutor PowerShell Execution\"|extend RuleDescription=\"\"Detects execution of the AgentExecutor.exe binary. Which can be abused as a LOLBIN to execute powershell scripts with the ExecutionPolicy \\\"Bypass\\\" or any binary named \\\"powershell.exe\\\" located in the path provided by 6th positional argument\"\";\nlet q3=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\aspnet_compiler.exe\" and ((TargetProcessName endswith \"\\\\calc.exe\" or TargetProcessName endswith \"\\\\notepad.exe\") or (TargetProcessName contains \"\\\\Users\\\\Public\\\\\" or TargetProcessName contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or TargetProcessName contains \"\\\\AppData\\\\Local\\\\Roaming\\\\\" or TargetProcessName contains \":\\\\Temp\\\\\" or TargetProcessName contains \":\\\\Windows\\\\Temp\\\\\" or TargetProcessName contains \":\\\\Windows\\\\System32\\\\Tasks\\\\\" or TargetProcessName contains \":\\\\Windows\\\\Tasks\\\\\")))|extend RuleId=\"9ccba514-7cb6-4c5c-b377-700758f2f120\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_aspnet_compiler_susp_child_process.yml\"|extend RuleTitle=\"Suspicious Child Process of AspNetCompiler\"|extend RuleDescription=\"\"Detects potentially suspicious child processes of \\\"aspnet_compiler.exe\\\".\"\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessName contains \"C:\\\\Windows\\\\Microsoft.NET\\\\Framework\\\\\" or TargetProcessName contains \"C:\\\\Windows\\\\Microsoft.NET\\\\Framework64\\\\\") and TargetProcessName endswith \"\\\\aspnet_compiler.exe\" and (TargetProcessCommandLine contains \"\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Roaming\\\\\" or TargetProcessCommandLine contains \":\\\\Temp\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\Temp\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\System32\\\\Tasks\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\Tasks\\\\\"))|extend RuleId=\"9f50fe98-fe5c-4a2d-86c7-fad7f63ed622\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_aspnet_compiler_susp_paths.yml\"|extend RuleTitle=\"Potentially Suspicious ASP.NET Compilation Via AspNetCompiler\"|extend RuleDescription=\"\"Detects execution of \\\"aspnet_compiler.exe\\\" with potentially suspicious paths for compilation.\"\";\nlet q5=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\attrib.exe\" or TargetProcessFilename =~ \"ATTRIB.EXE\") and TargetProcessCommandLine contains \" +s\" and (TargetProcessCommandLine contains \" %\" or TargetProcessCommandLine contains \"\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\\" or TargetProcessCommandLine contains \"\\\\ProgramData\\\\\" or TargetProcessCommandLine contains \"\\\\Downloads\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\Temp\\\\\") and (TargetProcessCommandLine contains \".bat\" or TargetProcessCommandLine contains \".dll\" or TargetProcessCommandLine contains \".exe\" or TargetProcessCommandLine contains \".hta\" or TargetProcessCommandLine contains \".ps1\" or TargetProcessCommandLine contains \".vbe\" or TargetProcessCommandLine contains \".vbs\")) and (not((TargetProcessCommandLine contains \"\\\\Windows\\\\TEMP\\\\\" and TargetProcessCommandLine contains \".exe\"))))|extend RuleId=\"efec536f-72e8-4656-8960-5e85d091345b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_attrib_system_susp_paths.yml\"|extend RuleTitle=\"Set Suspicious Files as System Files Using Attrib.EXE\"|extend RuleDescription=\"\"Detects the usage of attrib with the \\\"+s\\\" option to set scripts or executables located in suspicious locations as system files to hide them from users and make them unable to be deleted with simple rights. The rule limits the search to specific extensions and directories to avoid FPs\\n\"\";\nlet q6=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\at.exe\" and TargetProcessCommandLine contains \"interactive\")|extend RuleId=\"60fc936d-2eb0-4543-8a13-911c750a1dfc\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_at_interactive_execution.yml\"|extend RuleTitle=\"Interactive AT Job\"|extend RuleDescription=\"\"Detects an interactive AT job, which may be used as a form of privilege escalation.\"\";\nlet q7=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"/logon:none\" or TargetProcessCommandLine contains \"/system:none\" or TargetProcessCommandLine contains \"/sam:none\" or TargetProcessCommandLine contains \"/privilege:none\" or TargetProcessCommandLine contains \"/object:none\" or TargetProcessCommandLine contains \"/process:none\" or TargetProcessCommandLine contains \"/policy:none\")|extend RuleId=\"c6c56ada-612b-42d1-9a29-adad3c5c2c1e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_auditpol_nt_resource_kit_usage.yml\"|extend RuleTitle=\"Audit Policy Tampering Via NT Resource Kit Auditpol\"|extend RuleDescription=\"\"Threat actors can use an older version of the auditpol binary available inside the NT resource kit to change audit policy configuration to impair detection capability.\\nThis can be carried out by selectively disabling/removing certain audit policies as well as restoring a custom policy owned by the threat actor.\\n\"\";\nlet q8=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\auditpol.exe\" or TargetProcessFilename =~ \"AUDITPOL.EXE\") and (TargetProcessCommandLine contains \"disable\" or TargetProcessCommandLine contains \"clear\" or TargetProcessCommandLine contains \"remove\" or TargetProcessCommandLine contains \"restore\"))|extend RuleId=\"0a13e132-651d-11eb-ae93-0242ac130002\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_auditpol_susp_execution.yml\"|extend RuleTitle=\"Audit Policy Tampering Via Auditpol\"|extend RuleDescription=\"\"Threat actors can use auditpol binary to change audit policy configuration to impair detection capability.\\nThis can be carried out by selectively disabling/removing certain audit policies as well as restoring a custom policy owned by the threat actor.\\n\"\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\bcdedit.exe\" or TargetProcessFilename =~ \"bcdedit.exe\") and TargetProcessCommandLine contains \"set\" and ((TargetProcessCommandLine contains \"bootstatuspolicy\" and TargetProcessCommandLine contains \"ignoreallfailures\") or (TargetProcessCommandLine contains \"recoveryenabled\" and TargetProcessCommandLine contains \"no\")))|extend RuleId=\"1444443e-6757-43e4-9ea4-c8fc705f79a2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_bcdedit_boot_conf_tamper.yml\"|extend RuleTitle=\"Boot Configuration Tampering Via Bcdedit.EXE\"|extend RuleDescription=\"\"Detects the use of the bcdedit command to tamper with the boot configuration data. This technique is often times used by malware or attackers as a destructive way before launching ransomware.\"\";\nlet q10=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\bginfo.exe\" or ActingProcessName endswith \"\\\\bginfo64.exe\") and ((TargetProcessName endswith \"\\\\calc.exe\" or TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\notepad.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\wscript.exe\") or (TargetProcessName contains \"\\\\AppData\\\\Local\\\\\" or TargetProcessName contains \"\\\\AppData\\\\Roaming\\\\\" or TargetProcessName contains \":\\\\Users\\\\Public\\\\\" or TargetProcessName contains \":\\\\Temp\\\\\" or TargetProcessName contains \":\\\\Windows\\\\Temp\\\\\" or TargetProcessName contains \":\\\\PerfLogs\\\\\")))|extend RuleId=\"811f459f-9231-45d4-959a-0266c6311987\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_bginfo_suspicious_child_process.yml\"|extend RuleTitle=\"Suspicious Child Process Of BgInfo.EXE\"|extend RuleDescription=\"\"Detects suspicious child processes of \\\"BgInfo.exe\\\" which could be a sign of potential abuse of the binary to proxy execution via external VBScript\"\";\nlet q11=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\bitsadmin.exe\" or TargetProcessFilename =~ \"bitsadmin.exe\") and (TargetProcessCommandLine contains \" /transfer \" or TargetProcessCommandLine contains \" /create \" or TargetProcessCommandLine contains \" /addfile \") and (TargetProcessCommandLine contains \"://1\" or TargetProcessCommandLine contains \"://2\" or TargetProcessCommandLine contains \"://3\" or TargetProcessCommandLine contains \"://4\" or TargetProcessCommandLine contains \"://5\" or TargetProcessCommandLine contains \"://6\" or TargetProcessCommandLine contains \"://7\" or TargetProcessCommandLine contains \"://8\" or TargetProcessCommandLine contains \"://9\")) and (not(TargetProcessCommandLine contains \"://7-\")))|extend RuleId=\"99c840f2-2012-46fd-9141-c761987550ef\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_bitsadmin_download_direct_ip.yml\"|extend RuleTitle=\"Suspicious Download From Direct IP Via Bitsadmin\"|extend RuleDescription=\"\"Detects usage of bitsadmin downloading a file using an URL that contains an IP\"\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Persistence", "DefenseEvasion", "CredentialAccess", "PrivilegeEscalation", "Impact", "Execution"],
                "techniques": ["T1059", "T1003", "T1197", "T1202", "T1053", "T1036", "T1562", "T1127", "T1490", "T1218", "T1564"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000200",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}