{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000227')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000227')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 27",
                "description": "Sigma Windows Process Creation medium 27",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessFilename =~ \"REGSVR32.EXE\") and (TargetProcessCommandLine endswith \".bin\" or TargetProcessCommandLine endswith \".bmp\" or TargetProcessCommandLine endswith \".cr2\" or TargetProcessCommandLine endswith \".dat\" or TargetProcessCommandLine endswith \".eps\" or TargetProcessCommandLine endswith \".gif\" or TargetProcessCommandLine endswith \".ico\" or TargetProcessCommandLine endswith \".jpeg\" or TargetProcessCommandLine endswith \".jpg\" or TargetProcessCommandLine endswith \".nef\" or TargetProcessCommandLine endswith \".orf\" or TargetProcessCommandLine endswith \".png\" or TargetProcessCommandLine endswith \".raw\" or TargetProcessCommandLine endswith \".sr2\" or TargetProcessCommandLine endswith \".temp\" or TargetProcessCommandLine endswith \".tif\" or TargetProcessCommandLine endswith \".tiff\" or TargetProcessCommandLine endswith \".tmp\" or TargetProcessCommandLine endswith \".rtf\" or TargetProcessCommandLine endswith \".txt\"))|extend RuleId=\"089fc3d2-71e8-4763-a8a5-c97fbb0a403e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_regsvr32_susp_extensions.yml\"|extend RuleTitle=\"Regsvr32 DLL Execution With Suspicious File Extension\"|extend RuleDescription=\"Detects the execution of REGSVR32.exe with DLL files masquerading as other files\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"reg.exe\" or TargetProcessFilename =~ \"reg.exe\") and TargetProcessCommandLine contains \"\\\\SYSTEM\\\\CurrentControlSet\\\\Control\\\\SafeBoot\" and (TargetProcessCommandLine contains \" copy \" or TargetProcessCommandLine contains \" add \"))|extend RuleId=\"d7662ff6-9e97-4596-a61d-9839e32dee8d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_add_safeboot.yml\"|extend RuleTitle=\"Add SafeBoot Keys Via Reg Utility\"|extend RuleDescription=\"Detects execution of \\\"reg.exe\\\" commands with the \\\"add\\\" or \\\"copy\\\" flags on safe boot registry keys. Often used by attacker to allow the ransomware to work in safe mode as some security products do not\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"REG\" and TargetProcessCommandLine contains \"ADD\" and TargetProcessCommandLine contains \"\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\FVE\" and TargetProcessCommandLine contains \"/v\" and TargetProcessCommandLine contains \"/f\") and (TargetProcessCommandLine contains \"EnableBDEWithNoTPM\" or TargetProcessCommandLine contains \"UseAdvancedStartup\" or TargetProcessCommandLine contains \"UseTPM\" or TargetProcessCommandLine contains \"UseTPMKey\" or TargetProcessCommandLine contains \"UseTPMKeyPIN\" or TargetProcessCommandLine contains \"RecoveryKeyMessageSource\" or TargetProcessCommandLine contains \"UseTPMPIN\" or TargetProcessCommandLine contains \"RecoveryKeyMessage\"))|extend RuleId=\"0e0255bf-2548-47b8-9582-c0955c9283f5\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_bitlocker.yml\"|extend RuleTitle=\"Suspicious Reg Add BitLocker\"|extend RuleDescription=\"Detects suspicious addition to BitLocker related registry keys via the reg.exe utility\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"reg.exe\" or TargetProcessFilename =~ \"reg.exe\") and (TargetProcessCommandLine contains \" delete \" and TargetProcessCommandLine contains \"\\\\SYSTEM\\\\CurrentControlSet\\\\Control\\\\SafeBoot\"))|extend RuleId=\"fc0e89b5-adb0-43c1-b749-c12a10ec37de\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_delete_safeboot.yml\"|extend RuleTitle=\"SafeBoot Registry Key Deleted Via Reg.EXE\"|extend RuleDescription=\"Detects execution of \\\"reg.exe\\\" commands with the \\\"delete\\\" flag on safe boot registry keys. Often used by attacker to prevent safeboot execution of security products\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"reg.exe\" or TargetProcessFilename =~ \"reg.exe\") and TargetProcessCommandLine contains \" delete \" and TargetProcessCommandLine contains \"\\\\SYSTEM\\\\CurrentControlSet\\\\services\\\\\")|extend RuleId=\"05b2aa93-1210-42c8-8d9a-2fcc13b284f5\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_delete_services.yml\"|extend RuleTitle=\"Service Registry Key Deleted Via Reg.EXE\"|extend RuleDescription=\"Detects execution of \\\"reg.exe\\\" commands with the \\\"delete\\\" flag on services registry key. Often used by attacker to remove AV software services\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"reg\" and TargetProcessCommandLine contains \"add\") and ((TargetProcessCommandLine contains \"d 4\" and TargetProcessCommandLine contains \"v Start\") and (TargetProcessCommandLine contains \"\\\\AppIDSvc\" or TargetProcessCommandLine contains \"\\\\MsMpSvc\" or TargetProcessCommandLine contains \"\\\\NisSrv\" or TargetProcessCommandLine contains \"\\\\SecurityHealthService\" or TargetProcessCommandLine contains \"\\\\Sense\" or TargetProcessCommandLine contains \"\\\\UsoSvc\" or TargetProcessCommandLine contains \"\\\\WdBoot\" or TargetProcessCommandLine contains \"\\\\WdFilter\" or TargetProcessCommandLine contains \"\\\\WdNisDrv\" or TargetProcessCommandLine contains \"\\\\WdNisSvc\" or TargetProcessCommandLine contains \"\\\\WinDefend\" or TargetProcessCommandLine contains \"\\\\wscsvc\" or TargetProcessCommandLine contains \"\\\\wuauserv\")))|extend RuleId=\"5e95028c-5229-4214-afae-d653d573d0ec\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_disable_sec_services.yml\"|extend RuleTitle=\"Security Service Disabled Via Reg.EXE\"|extend RuleDescription=\"Detects execution of \\\"reg.exe\\\" to disable security services such as Windows Defender.\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\reg.exe\" or TargetProcessFilename =~ \"reg.exe\") and (TargetProcessCommandLine contains \" save \" or TargetProcessCommandLine contains \" export \" or TargetProcessCommandLine contains \" \u02e2ave \" or TargetProcessCommandLine contains \" e\u02e3port \") and (TargetProcessCommandLine contains \"hklm\" or TargetProcessCommandLine contains \"hk\u02eam\" or TargetProcessCommandLine contains \"hkey_local_machine\" or TargetProcessCommandLine contains \"hkey_\u02eaocal_machine\" or TargetProcessCommandLine contains \"hkey_loca\u02ea_machine\" or TargetProcessCommandLine contains \"hkey_\u02eaoca\u02ea_machine\") and (TargetProcessCommandLine contains \"\\\\system\" or TargetProcessCommandLine contains \"\\\\sam\" or TargetProcessCommandLine contains \"\\\\security\" or TargetProcessCommandLine contains \"\\\\\u02e2ystem\" or TargetProcessCommandLine contains \"\\\\sy\u02e2tem\" or TargetProcessCommandLine contains \"\\\\\u02e2y\u02e2tem\" or TargetProcessCommandLine contains \"\\\\\u02e2am\" or TargetProcessCommandLine contains \"\\\\\u02e2ecurity\"))|extend RuleId=\"fd877b94-9bb5-4191-bb25-d79cbd93c167\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_dumping_sensitive_hives.yml\"|extend RuleTitle=\"Dumping of Sensitive Hives Via Reg.EXE\"|extend RuleDescription=\"Detects the usage of \\\"reg.exe\\\" in order to dump sensitive registry hives. This includes SAM, SYSTEM and SECURITY hives.\";\nlet q7=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"\\\\System\\\\CurrentControlSet\\\\Control\\\\Lsa\\\\\" and TargetProcessCommandLine contains \"DisableRestrictedAdmin\")|extend RuleId=\"28ac00d6-22d9-4a3c-927f-bbd770104573\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_lsa_disable_restricted_admin.yml\"|extend RuleTitle=\"RestrictedAdminMode Registry Value Tampering - ProcCreation\"|extend RuleDescription=\"Detects changes to the \\\"DisableRestrictedAdmin\\\" registry value in order to disable or enable RestrictedAdmin mode.\\nRestrictedAdmin mode prevents the transmission of reusable credentials to the remote system to which you connect using Remote Desktop.\\nThis prevents your credentials from being harvested during the initial connection process if the remote server has been compromise\\n\";\nlet q8=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\reg.exe\" or TargetProcessFilename =~ \"reg.exe\") and (TargetProcessCommandLine contains \"SYSTEM\\\\CurrentControlSet\\\\Control\\\\Lsa\" and (TargetProcessCommandLine contains \" add \" and TargetProcessCommandLine contains \" /d 0\" and TargetProcessCommandLine contains \" /v RunAsPPL \")))|extend RuleId=\"8c0eca51-0f88-4db2-9183-fdfb10c703f9\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_lsa_ppl_protection_disabled.yml\"|extend RuleTitle=\"LSA PPL Protection Disabled Via Reg.EXE\"|extend RuleDescription=\"Detects the usage of the \\\"reg.exe\\\" utility to disable PPL protection on the LSA process\";\nlet q9=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"\\\\System\\\\CurrentControlSet\\\\Control\\\\Lsa\" and TargetProcessCommandLine contains \"NoLMHash\" and TargetProcessCommandLine contains \" 0\")|extend RuleId=\"98dedfdd-8333-49d4-9f23-d7018cccae53\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_nolmhash.yml\"|extend RuleTitle=\"Enable LM Hash Storage - ProcCreation\"|extend RuleDescription=\"Detects changes to the \\\"NoLMHash\\\" registry value in order to allow Windows to store LM Hashes.\\nBy setting this registry value to \\\"0\\\" (DWORD), Windows will be allowed to store a LAN manager hash of your password in Active Directory and local SAM databases.\\n\";\nlet q10=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\reg.exe\" or TargetProcessFilename =~ \"reg.exe\") and (TargetProcessCommandLine contains \" add \" and TargetProcessCommandLine contains \"\\\\CurrentControlSet\\\\Control\\\\Terminal Server\" and TargetProcessCommandLine contains \"REG_DWORD\" and TargetProcessCommandLine contains \" /f\")) and ((TargetProcessCommandLine contains \"Licensing Core\" and TargetProcessCommandLine contains \"EnableConcurrentSessions\") or (TargetProcessCommandLine contains \"WinStations\\\\RDP-Tcp\" or TargetProcessCommandLine contains \"MaxInstanceCount\" or TargetProcessCommandLine contains \"fEnableWinStation\" or TargetProcessCommandLine contains \"TSUserEnabled\" or TargetProcessCommandLine contains \"TSEnabled\" or TargetProcessCommandLine contains \"TSAppCompat\" or TargetProcessCommandLine contains \"IdleWinStationPoolCount\" or TargetProcessCommandLine contains \"TSAdvertise\" or TargetProcessCommandLine contains \"AllowTSConnections\" or TargetProcessCommandLine contains \"fSingleSessionPerUser\" or TargetProcessCommandLine contains \"fDenyTSConnections\")))|extend RuleId=\"0d5675be-bc88-4172-86d3-1e96a4476536\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_rdp_keys_tamper.yml\"|extend RuleTitle=\"Potential Tampering With RDP Related Registry Keys Via Reg.EXE\"|extend RuleDescription=\"Detects the execution of \\\"reg.exe\\\" for enabling/disabling the RDP service on the host by tampering with the 'CurrentControlSet\\\\Control\\\\Terminal Server' values\";\nlet q11=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\reg.exe\" or TargetProcessFilename =~ \"reg.exe\") and (TargetProcessCommandLine contains \"\\\\AppDataLow\\\\Software\\\\Microsoft\\\\\" or TargetProcessCommandLine contains \"\\\\Policies\\\\Microsoft\\\\Windows\\\\OOBE\" or TargetProcessCommandLine contains \"\\\\Policies\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Winlogon\" or TargetProcessCommandLine contains \"\\\\SOFTWARE\\\\Microsoft\\\\Windows NT\\\\Currentversion\\\\Winlogon\" or TargetProcessCommandLine contains \"\\\\CurrentControlSet\\\\Control\\\\SecurityProviders\\\\WDigest\" or TargetProcessCommandLine contains \"\\\\Microsoft\\\\Windows Defender\\\\\"))|extend RuleId=\"b7e2a8d4-74bb-4b78-adc9-3f92af2d4829\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_susp_paths.yml\"|extend RuleTitle=\"Reg Add Suspicious Paths\"|extend RuleDescription=\"Detects when an adversary uses the reg.exe utility to add or modify new keys or subkeys\";\nlet q12=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"\\\\Services\\\\VSS\\\\Diag\" and TargetProcessCommandLine contains \"/d Disabled\")|extend RuleId=\"dee4af55-1f22-4e1d-a9d2-4bdc7ecb472a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_volsnap_disable.yml\"|extend RuleTitle=\"Disabled Volume Snapshots\"|extend RuleDescription=\"Detects commands that temporarily turn off Volume Snapshots\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Impact", "DefenseEvasion", "CredentialAccess", "LateralMovement"],
                "techniques": ["T1003", "T1021", "T1112", "T1562", "T1486", "T1218"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000227",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}