{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000117')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000117')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 17",
                "description": "Sigma Windows Process Creation low 17",
                "severity": "low",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\livekdexe\" or TargetProcessName endswith \"\\\\livekd64exe\") or TargetProcessFilename =~ \"livekdexe\")|extend RuleId=\"5163A000-5160-5160-5160-5163A0000116\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_livekd_execution.yml\";\nlet q1=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\procdumpexe\" or TargetProcessName endswith \"\\\\procdump64exe\")|extend RuleId=\"2e65275c-8288-4ab4-aeb7-6274f58b6b20\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_procdump.yml\";\nlet q2=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\psexecexe\" or TargetProcessFilename =~ \"psexecc\")|extend RuleId=\"730fc21b-eaff-474b-ad23-90fd265d4988\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_psexec_execution.yml\";\nlet q3=_Im_ProcessCreate\n| where (TargetProcessName =~ \"C:\\\\Windows\\\\PSEXESVCexe\" or TargetProcessFilename =~ \"psexesvcexe\")|extend RuleId=\"fdfcbd78-48f1-4a4b-90ac-d82241e368c5\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_psexesvc.yml\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"psloglistexe\" or (TargetProcessName endswith \"\\\\psloglistexe\" or TargetProcessName endswith \"\\\\psloglist64exe\")) and (TargetProcessCommandLine contains \" security\" or TargetProcessCommandLine contains \" application\" or TargetProcessCommandLine contains \" system\") and (TargetProcessCommandLine contains \" -d\" or TargetProcessCommandLine contains \" /d\" or TargetProcessCommandLine contains \" -x\" or TargetProcessCommandLine contains \" /x\" or TargetProcessCommandLine contains \" -s\" or TargetProcessCommandLine contains \" /s\" or TargetProcessCommandLine contains \" -c\" or TargetProcessCommandLine contains \" /c\" or TargetProcessCommandLine contains \" -g\" or TargetProcessCommandLine contains \" /g\"))|extend RuleId=\"aae1243f-d8af-40d8-ab20-33fc6d0c55bc\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_psloglist.yml\";\nlet q5=_Im_ProcessCreate\n| where (TargetProcessFilename =~ \"psserviceexe\" or (TargetProcessName endswith \"\\\\PsServiceexe\" or TargetProcessName endswith \"\\\\PsService64exe\"))|extend RuleId=\"3371f518-5fe3-4cf6-a14b-2a0ae3fd8a4f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_psservice.yml\";\nlet q6=_Im_ProcessCreate\n| where (TargetProcessFilename =~ \"pssuspendexe\" or (TargetProcessName endswith \"\\\\pssuspendexe\" or TargetProcessName endswith \"\\\\pssuspend64exe\"))|extend RuleId=\"48bbc537-b652-4b4e-bd1d-281172df448f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_pssuspend_execution.yml\";\nlet q7=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\Sysmon64exe\" or TargetProcessName endswith \"\\\\Sysmonexe\") or TargetProcessFileDescription =~ \"System activity monitor\") and (TargetProcessCommandLine contains \"-c\" or TargetProcessCommandLine contains \"/c\"))|extend RuleId=\"87911521-7098-470b-a459-9a57fc80bdfd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_sysmon_config_update.yml\";\nlet q8=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\accesschkexe\" or TargetProcessName endswith \"\\\\accesschk64exe\" or TargetProcessName endswith \"\\\\AccessEnumexe\" or TargetProcessName endswith \"\\\\ADExplorerexe\" or TargetProcessName endswith \"\\\\ADExplorer64exe\" or TargetProcessName endswith \"\\\\ADInsightexe\" or TargetProcessName endswith \"\\\\ADInsight64exe\" or TargetProcessName endswith \"\\\\adrestoreexe\" or TargetProcessName endswith \"\\\\adrestore64exe\" or TargetProcessName endswith \"\\\\Autologonexe\" or TargetProcessName endswith \"\\\\Autologon64exe\" or TargetProcessName endswith \"\\\\Autorunsexe\" or TargetProcessName endswith \"\\\\Autoruns64exe\" or TargetProcessName endswith \"\\\\autorunscexe\" or TargetProcessName endswith \"\\\\autorunsc64exe\" or TargetProcessName endswith \"\\\\Bginfoexe\" or TargetProcessName endswith \"\\\\Bginfo64exe\" or TargetProcessName endswith \"\\\\Cachesetexe\" or TargetProcessName endswith \"\\\\Cacheset64exe\" or TargetProcessName endswith \"\\\\Clockresexe\" or TargetProcessName endswith \"\\\\Clockres64exe\" or TargetProcessName endswith \"\\\\Contigexe\" or TargetProcessName endswith \"\\\\Contig64exe\" or TargetProcessName endswith \"\\\\Coreinfoexe\" or TargetProcessName endswith \"\\\\Coreinfo64exe\" or TargetProcessName endswith \"\\\\CPUSTRESEXE\" or TargetProcessName endswith \"\\\\CPUSTRES64EXE\" or TargetProcessName endswith \"\\\\ctrl2capexe\" or TargetProcessName endswith \"\\\\Dbgviewexe\" or TargetProcessName endswith \"\\\\dbgview64exe\" or TargetProcessName endswith \"\\\\Desktopsexe\" or TargetProcessName endswith \"\\\\Desktops64exe\" or TargetProcessName endswith \"\\\\disk2vhdexe\" or TargetProcessName endswith \"\\\\disk2vhd64exe\" or TargetProcessName endswith \"\\\\diskextexe\" or TargetProcessName endswith \"\\\\diskext64exe\" or TargetProcessName endswith \"\\\\Diskmonexe\" or TargetProcessName endswith \"\\\\Diskmon64exe\" or TargetProcessName endswith \"\\\\DiskViewexe\" or TargetProcessName endswith \"\\\\DiskView64exe\" or TargetProcessName endswith \"\\\\duexe\" or TargetProcessName endswith \"\\\\du64exe\" or TargetProcessName endswith \"\\\\efsdumpexe\" or TargetProcessName endswith \"\\\\FindLinksexe\" or TargetProcessName endswith \"\\\\FindLinks64exe\" or TargetProcessName endswith \"\\\\handleexe\" or TargetProcessName endswith \"\\\\handle64exe\" or TargetProcessName endswith \"\\\\hex2decexe\" or TargetProcessName endswith \"\\\\hex2dec64exe\" or TargetProcessName endswith \"\\\\junctionexe\" or TargetProcessName endswith \"\\\\junction64exe\" or TargetProcessName endswith \"\\\\ldmdumpexe\" or TargetProcessName endswith \"\\\\listdllsexe\" or TargetProcessName endswith \"\\\\listdlls64exe\" or TargetProcessName endswith \"\\\\livekdexe\" or TargetProcessName endswith \"\\\\livekd64exe\" or TargetProcessName endswith \"\\\\loadOrdexe\" or TargetProcessName endswith \"\\\\loadOrd64exe\" or TargetProcessName endswith \"\\\\loadOrdCexe\" or TargetProcessName endswith \"\\\\loadOrdC64exe\" or TargetProcessName endswith \"\\\\logonsessionsexe\" or TargetProcessName endswith \"\\\\logonsessions64exe\" or TargetProcessName endswith \"\\\\movefileexe\" or TargetProcessName endswith \"\\\\movefile64exe\" or TargetProcessName endswith \"\\\\notmyfaultexe\" or TargetProcessName endswith \"\\\\notmyfault64exe\" or TargetProcessName endswith \"\\\\notmyfaultcexe\" or TargetProcessName endswith \"\\\\notmyfaultc64exe\" or TargetProcessName endswith \"\\\\ntfsinfoexe\" or TargetProcessName endswith \"\\\\ntfsinfo64exe\" or TargetProcessName endswith \"\\\\pendmovesexe\" or TargetProcessName endswith \"\\\\pendmoves64exe\" or TargetProcessName endswith \"\\\\pipelistexe\" or TargetProcessName endswith \"\\\\pipelist64exe\" or TargetProcessName endswith \"\\\\portmonexe\" or TargetProcessName endswith \"\\\\procdumpexe\" or TargetProcessName endswith \"\\\\procdump64exe\" or TargetProcessName endswith \"\\\\procexpexe\" or TargetProcessName endswith \"\\\\procexp64exe\" or TargetProcessName endswith \"\\\\Procmonexe\" or TargetProcessName endswith \"\\\\Procmon64exe\" or TargetProcessName endswith \"\\\\psExecexe\" or TargetProcessName endswith \"\\\\psExec64exe\" or TargetProcessName endswith \"\\\\psfileexe\" or TargetProcessName endswith \"\\\\psfile64exe\" or TargetProcessName endswith \"\\\\psGetsidexe\" or TargetProcessName endswith \"\\\\psGetsid64exe\" or TargetProcessName endswith \"\\\\psInfoexe\" or TargetProcessName endswith \"\\\\psInfo64exe\" or TargetProcessName endswith \"\\\\pskillexe\" or TargetProcessName endswith \"\\\\pskill64exe\" or TargetProcessName endswith \"\\\\pslistexe\" or TargetProcessName endswith \"\\\\pslist64exe\" or TargetProcessName endswith \"\\\\psLoggedonexe\" or TargetProcessName endswith \"\\\\psLoggedon64exe\" or TargetProcessName endswith \"\\\\psloglistexe\" or TargetProcessName endswith \"\\\\psloglist64exe\" or TargetProcessName endswith \"\\\\pspasswdexe\" or TargetProcessName endswith \"\\\\pspasswd64exe\" or TargetProcessName endswith \"\\\\pspingexe\" or TargetProcessName endswith \"\\\\psping64exe\" or TargetProcessName endswith \"\\\\psServiceexe\" or TargetProcessName endswith \"\\\\psService64exe\" or TargetProcessName endswith \"\\\\psshutdownexe\" or TargetProcessName endswith \"\\\\psshutdown64exe\" or TargetProcessName endswith \"\\\\pssuspendexe\" or TargetProcessName endswith \"\\\\pssuspend64exe\" or TargetProcessName endswith \"\\\\RAMMapexe\" or TargetProcessName endswith \"\\\\RDCManexe\" or TargetProcessName endswith \"\\\\RegDelNullexe\" or TargetProcessName endswith \"\\\\RegDelNull64exe\" or TargetProcessName endswith \"\\\\regjumpexe\" or TargetProcessName endswith \"\\\\ruexe\" or TargetProcessName endswith \"\\\\ru64exe\" or TargetProcessName endswith \"\\\\sdeleteexe\" or TargetProcessName endswith \"\\\\sdelete64exe\" or TargetProcessName endswith \"\\\\ShareEnumexe\" or TargetProcessName endswith \"\\\\ShareEnum64exe\" or TargetProcessName endswith \"\\\\shellRunasexe\" or TargetProcessName endswith \"\\\\sigcheckexe\" or TargetProcessName endswith \"\\\\sigcheck64exe\" or TargetProcessName endswith \"\\\\streamsexe\" or TargetProcessName endswith \"\\\\streams64exe\" or TargetProcessName endswith \"\\\\stringsexe\" or TargetProcessName endswith \"\\\\strings64exe\" or TargetProcessName endswith \"\\\\syncexe\" or TargetProcessName endswith \"\\\\sync64exe\" or TargetProcessName endswith \"\\\\Sysmonexe\" or TargetProcessName endswith \"\\\\Sysmon64exe\" or TargetProcessName endswith \"\\\\tcpvconexe\" or TargetProcessName endswith \"\\\\tcpvcon64exe\" or TargetProcessName endswith \"\\\\tcpviewexe\" or TargetProcessName endswith \"\\\\tcpview64exe\" or TargetProcessName endswith \"\\\\Testlimitexe\" or TargetProcessName endswith \"\\\\Testlimit64exe\" or TargetProcessName endswith \"\\\\vmmapexe\" or TargetProcessName endswith \"\\\\vmmap64exe\" or TargetProcessName endswith \"\\\\Volumeidexe\" or TargetProcessName endswith \"\\\\Volumeid64exe\" or TargetProcessName endswith \"\\\\whoisexe\" or TargetProcessName endswith \"\\\\whois64exe\" or TargetProcessName endswith \"\\\\Winobjexe\" or TargetProcessName endswith \"\\\\Winobj64exe\" or TargetProcessName endswith \"\\\\ZoomItexe\" or TargetProcessName endswith \"\\\\ZoomIt64exe\") and (not(((TargetProcessFileCompany =~ \"Sysinternals - wwwsysinternalscom\" or TargetProcessFileCompany =~ \"Sysinternals\") or isnull(TargetProcessFileCompany)))))|extend RuleId=\"7cce6fc8-a07f-4d84-a53e-96e1879843c9\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_tools_masquerading.yml\";\nlet q9=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\sysprepexe\" and TargetProcessCommandLine contains \"\\\\AppData\\\\\")|extend RuleId=\"d5b9ae7a-e6fc-405e-80ff-2ff9dcc64e7e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysprep_appdata.yml\";\nlet q10=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\takeownexe\" and (TargetProcessCommandLine contains \"/f \" and TargetProcessCommandLine contains \"/r\"))|extend RuleId=\"554601fb-9b71-4bcc-abf4-21a611be4fde\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_takeown_recursive_own.yml\";\nlet q11=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\tapinstallexe\" and (not(((TargetProcessName =~ \"C:\\\\Program Files\\\\Avast Software\\\\SecureLine VPN\\\\tapinstallexe\" or TargetProcessName =~ \"C:\\\\Program Files (x86)\\\\Avast Software\\\\SecureLine VPN\\\\tapinstallexe\") or TargetProcessName startswith \"C:\\\\Program Files\\\\OpenVPN Connect\\\\drivers\\\\tap\\\\\" or TargetProcessName startswith \"C:\\\\Program Files (x86)\\\\Proton Technologies\\\\ProtonVPNTap\\\\installer\\\\\"))))|extend RuleId=\"99793437-3e16-439b-be0f-078782cf953d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_tapinstall_execution.yml\";\nlet q12=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\tpmvscmgrexe\" and TargetProcessFilename =~ \"TpmVscMgrexe\") and TargetProcessCommandLine contains \"create\")|extend RuleId=\"c633622e-cab9-4eaa-bb13-66a1d68b3e47\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_tpmvscmgr_add_virtual_smartcard.yml\";\nlet q13=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\tsconexe\" or TargetProcessFilename =~ \"tsconexe\") and TargetProcessIntegrityLevel =~ \"SYSTEM\")|extend RuleId=\"224f140f-3553-4cd1-af78-13d81bf9f7cc\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_tscon_rdp_session_hijacking.yml\";\nlet q14=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\mmcexe\" and ActingProcessCommandLine contains \"WFmsc\") and (not(TargetProcessName endswith \"\\\\WerFaultexe\")))|extend RuleId=\"e52cb31c-10ed-4aea-bcb7-593c9f4a315b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_hijacking_firwall_snap_in.yml\";\nlet q15=_Im_ProcessCreate\n| where (TargetProcessName endswith \"sdcltexe\" and TargetProcessIntegrityLevel =~ \"High\")|extend RuleId=\"40f9af16-589d-4984-b78d-8c2aec023197\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_sdclt.yml\";\nlet q16=_Im_ProcessCreate\n| where (TargetProcessFileDescription =~ \"VNCViewer\" or TargetProcessFileProduct =~ \"UltraVNC VNCViewer\" or TargetProcessFileCompany =~ \"UltraVNC\" or TargetProcessFilename =~ \"VNCViewerexe\")|extend RuleId=\"145322e4-0fd3-486b-81ca-9addc75736d8\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_ultravnc.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["CommandAndControl", "DefenseEvasion", "Discovery", "Persistence", "Exfiltration", "Execution", "LateralMovement", "PrivilegeEscalation", "CredentialAccess"],
                "techniques": ["T1543", "T1218", "T1048", "T1059", "T1222", "T1202", "T1036", "T1562", "T1219", "T1003", "T1569", "T1021", "T1548", "T1087"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000117",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}