{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000225')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000225')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation high 25",
                "description": "Sigma Windows Process Creation medium 25",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\schtasksexe\" or TargetProcessFilename =~ \"schtasksexe\") and TargetProcessCommandLine contains \" /create \" and (TargetProcessCommandLine contains \"powershell\" or TargetProcessCommandLine contains \"pwsh\" or TargetProcessCommandLine contains \"cmd /c \" or TargetProcessCommandLine contains \"cmd /k \" or TargetProcessCommandLine contains \"cmd /r \" or TargetProcessCommandLine contains \"cmdexe /c \" or TargetProcessCommandLine contains \"cmdexe /k \" or TargetProcessCommandLine contains \"cmdexe /r \") and (TargetProcessCommandLine contains \"C:\\\\ProgramData\\\\\" or TargetProcessCommandLine contains \"%ProgramData%\"))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000224\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_schtasks_folder_combos.yml\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessName contains \"\\\\schtasksexe\" or TargetProcessFilename =~ \"schtasksexe\") and (TargetProcessCommandLine contains \"wscript\" or TargetProcessCommandLine contains \"vbscript\" or TargetProcessCommandLine contains \"cscript\" or TargetProcessCommandLine contains \"wmic \" or TargetProcessCommandLine contains \"wmicexe\" or TargetProcessCommandLine contains \"regsvr32exe\" or TargetProcessCommandLine contains \"powershell\" or TargetProcessCommandLine contains \"\\\\AppData\\\\\") and (TargetProcessCommandLine contains \"once\" and TargetProcessCommandLine contains \"00:00\"))|extend RuleId=\"970823b7-273b-460a-8afc-3a6811998529\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_schtasks_one_time_only_midnight_task.yml\";\nlet q2=_Im_ProcessCreate\n| where (ActingProcessName =~ \"C:\\\\WINDOWS\\\\System32\\\\svchostexe\" and (ActingProcessCommandLine contains \"-k netsvcs\" and ActingProcessCommandLine contains \"-s Schedule\") and (TargetProcessCommandLine endswith \" -windowstyle hidden\" or TargetProcessCommandLine endswith \" -w hidden\" or TargetProcessCommandLine endswith \" -ep bypass\" or TargetProcessCommandLine endswith \" -noni\"))|extend RuleId=\"b66474aa-bd92-4333-a16c-298155b120df\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_schtasks_powershell_persistence.yml\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\schtasksexe\" or TargetProcessFilename =~ \"schtasksexe\") and TargetProcessCommandLine contains \"/Create\" and (TargetProcessCommandLine contains \"FromBase64String\" or TargetProcessCommandLine contains \"encodedcommand\") and (TargetProcessCommandLine contains \"Get-ItemProperty\" or TargetProcessCommandLine contains \" gp \") and (TargetProcessCommandLine contains \"HKCU:\" or TargetProcessCommandLine contains \"HKLM:\" or TargetProcessCommandLine contains \"registry::\" or TargetProcessCommandLine contains \"HKEY_\"))|extend RuleId=\"c4eeeeae-89f4-43a7-8b48-8d1bdfa66c78\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_schtasks_reg_loader_encoded.yml\";\nlet q4=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\schtasksexe\" or TargetProcessFilename =~ \"schtasksexe\") and (TargetProcessCommandLine contains \" ONLOGON \" or TargetProcessCommandLine contains \" ONSTART \" or TargetProcessCommandLine contains \" ONCE \" or TargetProcessCommandLine contains \" ONIDLE \")) and (not((TargetProcessCommandLine contains \"NT AUT\" or TargetProcessCommandLine contains \" SYSTEM\" or TargetProcessCommandLine contains \"HIGHEST\"))))|extend RuleId=\"24c8392b-aa3c-46b7-a545-43f71657fe98\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_schtasks_schedule_type.yml\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\schtasksexe\" and TargetProcessCommandLine contains \"/Create \") and (((TargetProcessCommandLine contains \"/sc minute \" or TargetProcessCommandLine contains \"/ru system \") and (TargetProcessCommandLine contains \"cmd /c\" or TargetProcessCommandLine contains \"cmd /k\" or TargetProcessCommandLine contains \"cmd /r\" or TargetProcessCommandLine contains \"cmdexe /c \" or TargetProcessCommandLine contains \"cmdexe /k \" or TargetProcessCommandLine contains \"cmdexe /r \")) or (TargetProcessCommandLine contains \" -decode \" or TargetProcessCommandLine contains \" -enc \" or TargetProcessCommandLine contains \" -w hidden \" or TargetProcessCommandLine contains \" bypass \" or TargetProcessCommandLine contains \" IEX\" or TargetProcessCommandLine contains \"DownloadData\" or TargetProcessCommandLine contains \"DownloadFile\" or TargetProcessCommandLine contains \"DownloadString\" or TargetProcessCommandLine contains \"/c start /min \" or TargetProcessCommandLine contains \"FromBase64String\" or TargetProcessCommandLine contains \"mshta http\" or TargetProcessCommandLine contains \"mshtaexe http\") or ((TargetProcessCommandLine contains \"\\\\AppData\\\\\" and TargetProcessCommandLine contains \"%AppData%\" and TargetProcessCommandLine contains \"%Temp%\" and TargetProcessCommandLine contains \"%tmp%\" and TargetProcessCommandLine contains \"C:\\\\Windows\\\\Temp\\\\\") and (TargetProcessCommandLine contains \"/xml C:\\\\Users\\\\\" and TargetProcessCommandLine contains \"cscript\" and TargetProcessCommandLine contains \"curl\" and TargetProcessCommandLine contains \"wscript\"))))|extend RuleId=\"f2c64357-b1d2-41b7-849f-34d2682c0fad\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_schtasks_susp_pattern.yml\";\nlet q6=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\schtasksexe\" and (TargetProcessCommandLine contains \" /change \" or TargetProcessCommandLine contains \" /create \")) and TargetProcessCommandLine contains \"/ru \" and (TargetProcessCommandLine contains \"NT AUT\" or TargetProcessCommandLine contains \" SYSTEM \")) and (not(((TargetProcessName endswith \"\\\\schtasksexe\" and (TargetProcessCommandLine contains \"/TN TVInstallRestore\" and TargetProcessCommandLine contains \"\\\\TeamViewer_exe\")) or (TargetProcessCommandLine contains \"/Create /F /RU System /SC WEEKLY /TN AviraSystemSpeedupVerify /TR \" or TargetProcessCommandLine contains \":\\\\Program Files (x86)\\\\Avira\\\\System Speedup\\\\setup\\\\avira_speedup_setupexe\" or TargetProcessCommandLine contains \"/VERIFY /VERYSILENT /NOSTART /NODOTNET /NORESTART\\\" /RL HIGHEST\")))))|extend RuleId=\"89ca78fd-b37c-4310-b3d3-81a023f83936\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_schtasks_system.yml\";\nlet q7=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\scrconsexe\" and (TargetProcessName endswith \"\\\\svchostexe\" or TargetProcessName endswith \"\\\\dllhostexe\" or TargetProcessName endswith \"\\\\powershellexe\" or TargetProcessName endswith \"\\\\pwshexe\" or TargetProcessName endswith \"\\\\wscriptexe\" or TargetProcessName endswith \"\\\\cscriptexe\" or TargetProcessName endswith \"\\\\schtasksexe\" or TargetProcessName endswith \"\\\\regsvr32exe\" or TargetProcessName endswith \"\\\\mshtaexe\" or TargetProcessName endswith \"\\\\rundll32exe\" or TargetProcessName endswith \"\\\\msiexecexe\" or TargetProcessName endswith \"\\\\msbuildexe\"))|extend RuleId=\"f6d1dd2f-b8ce-40ca-bc23-062efb686b34\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_scrcons_susp_child_process.yml\";\nlet q8=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\scexe\" and TargetProcessIntegrityLevel =~ \"Medium\") and ((TargetProcessCommandLine contains \"config\" and TargetProcessCommandLine contains \"binPath\") or (TargetProcessCommandLine contains \"failure\" and TargetProcessCommandLine contains \"command\")))|extend RuleId=\"d937b75f-a665-4480-88a5-2f20e9f9b22a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sc_change_sevice_image_path_by_non_admin.yml\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\scexe\" or TargetProcessFilename =~ \"scexe\") and (TargetProcessCommandLine contains \"sdset\" and TargetProcessCommandLine contains \"A;\") and (TargetProcessCommandLine contains \";IU\" or TargetProcessCommandLine contains \";SU\" or TargetProcessCommandLine contains \";BA\" or TargetProcessCommandLine contains \";SY\" or TargetProcessCommandLine contains \";WD\"))|extend RuleId=\"6c8fbee5-dee8-49bc-851d-c3142d02aa47\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sc_sdset_allow_service_changes.yml\";\nlet q10=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\scexe\" or TargetProcessFilename =~ \"scexe\") and (TargetProcessCommandLine contains \"sdset\" and TargetProcessCommandLine contains \"D;\") and (TargetProcessCommandLine contains \";IU\" or TargetProcessCommandLine contains \";SU\" or TargetProcessCommandLine contains \";BA\" or TargetProcessCommandLine contains \";SY\" or TargetProcessCommandLine contains \";WD\"))|extend RuleId=\"99cf1e02-00fb-4c0d-8375-563f978dfd37\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sc_sdset_deny_service_access.yml\";\nlet q11=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\scexe\" or TargetProcessFilename =~ \"scexe\") and (TargetProcessCommandLine contains \"sdset\" and TargetProcessCommandLine contains \"DCLCWPDTSD\"))|extend RuleId=\"a537cfc3-4297-4789-92b5-345bfd845ad0\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sc_sdset_hide_sevices.yml\";\nlet q12=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\scexe\" and (TargetProcessCommandLine contains \"config\" and TargetProcessCommandLine contains \"binPath\") and (TargetProcessCommandLine contains \"powershell\" or TargetProcessCommandLine contains \"cmd \" or TargetProcessCommandLine contains \"mshta\" or TargetProcessCommandLine contains \"wscript\" or TargetProcessCommandLine contains \"cscript\" or TargetProcessCommandLine contains \"rundll32\" or TargetProcessCommandLine contains \"svchost\" or TargetProcessCommandLine contains \"dllhost\" or TargetProcessCommandLine contains \"cmdexe /c\" or TargetProcessCommandLine contains \"cmdexe /k\" or TargetProcessCommandLine contains \"cmdexe /r\" or TargetProcessCommandLine contains \"cmd /c\" or TargetProcessCommandLine contains \"cmd /k\" or TargetProcessCommandLine contains \"cmd /r\" or TargetProcessCommandLine contains \"C:\\\\Users\\\\Public\" or TargetProcessCommandLine contains \"\\\\Downloads\\\\\" or TargetProcessCommandLine contains \"\\\\Desktop\\\\\" or TargetProcessCommandLine contains \"\\\\Microsoft\\\\Windows\\\\Start Menu\\\\Programs\\\\Startup\\\\\" or TargetProcessCommandLine contains \"C:\\\\Windows\\\\TEMP\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\"))|extend RuleId=\"138d3531-8793-4f50-a2cd-f291b2863d78\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sc_service_path_modification.yml\";\nlet q13=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\sdbinstexe\" or TargetProcessFilename =~ \"sdbinstexe\") and (not((TargetProcessCommandLine contains \"sdb\" or (ActingProcessName endswith \":\\\\Windows\\\\System32\\\\svchostexe\" and TargetProcessName endswith \":\\\\Windows\\\\System32\\\\sdbinstexe\" and TargetProcessCommandLine contains \" -m -bg\") or (ActingProcessName endswith \":\\\\Windows\\\\System32\\\\svchostexe\" and TargetProcessName endswith \":\\\\Windows\\\\System32\\\\sdbinstexe\" and TargetProcessCommandLine endswith \" -mm\")))))|extend RuleId=\"18ee686c-38a3-4f65-9f44-48a077141f42\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sdbinst_susp_extension.yml\";\nlet q14=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\sdiagnhostexe\" and (TargetProcessName endswith \"\\\\powershellexe\" or TargetProcessName endswith \"\\\\pwshexe\" or TargetProcessName endswith \"\\\\cmdexe\" or TargetProcessName endswith \"\\\\mshtaexe\" or TargetProcessName endswith \"\\\\cscriptexe\" or TargetProcessName endswith \"\\\\wscriptexe\" or TargetProcessName endswith \"\\\\taskkillexe\" or TargetProcessName endswith \"\\\\regsvr32exe\" or TargetProcessName endswith \"\\\\rundll32exe\" or TargetProcessName endswith \"\\\\calcexe\"))|extend RuleId=\"f3d39c45-de1a-4486-a687-ab126124f744\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sdiagnhost_susp_child.yml\";\nlet q15=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\Serv-Uexe\" and (TargetProcessName endswith \"\\\\cmdexe\" or TargetProcessName endswith \"\\\\powershellexe\" or TargetProcessName endswith \"\\\\pwshexe\" or TargetProcessName endswith \"\\\\wscriptexe\" or TargetProcessName endswith \"\\\\cscriptexe\" or TargetProcessName endswith \"\\\\shexe\" or TargetProcessName endswith \"\\\\bashexe\" or TargetProcessName endswith \"\\\\schtasksexe\" or TargetProcessName endswith \"\\\\regsvr32exe\" or TargetProcessName endswith \"\\\\wmicexe\" or TargetProcessName endswith \"\\\\mshtaexe\" or TargetProcessName endswith \"\\\\rundll32exe\" or TargetProcessName endswith \"\\\\msiexecexe\" or TargetProcessName endswith \"\\\\forfilesexe\" or TargetProcessName endswith \"\\\\scriptrunnerexe\"))|extend RuleId=\"58f4ea09-0fc2-4520-ba18-b85c540b0eaf\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_servu_susp_child_process.yml\";\nlet q16=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\splwow64exe\" and TargetProcessCommandLine endswith \"splwow64exe\")|extend RuleId=\"1f1a8509-2cbb-44f5-8751-8e1571518ce2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_splwow64_cli_anomaly.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Persistence", "Execution", "DefenseEvasion", "PrivilegeEscalation", "CredentialAccess"],
                "techniques": ["T1555", "T1543", "T1218", "T1546", "T1574", "T1202", "T1036", "T1059", "T1047", "T1053"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000225",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}