{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000300')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000300')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation high 00",
                "description": "Sigma Windows Process Creation high 00",
                "severity": "high",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"copy \" and TargetProcessCommandLine contains \"/y \" and TargetProcessCommandLine contains \"C:\\\\windows\\\\system32\\\\cmd.exe C:\\\\windows\\\\system32\\\\sethc.exe\")|extend RuleId=\"1070db9a-3e5d-412e-8e7b-7183b616e1b3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmd_sticky_keys_replace.yml\"|extend RuleTitle=\"Persistence Via Sticky Key Backdoor\"|extend RuleDescription=\"By replacing the sticky keys executable with the local admins CMD executable, an attacker is able to access a privileged windows console session without authenticating to the system.\nWhen the sticky keys are \"activated\" the privilleged shell is launched.\n\";\nlet q1=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\winlogon.exe\" and (TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\wscript.exe\" or TargetProcessName endswith \"\\\\wt.exe\") and (TargetProcessCommandLine contains \"sethc.exe\" or TargetProcessCommandLine contains \"utilman.exe\" or TargetProcessCommandLine contains \"osk.exe\" or TargetProcessCommandLine contains \"Magnify.exe\" or TargetProcessCommandLine contains \"Narrator.exe\" or TargetProcessCommandLine contains \"DisplaySwitch.exe\"))|extend RuleId=\"2fdefcb3-dbda-401e-ae23-f0db027628bc\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmd_sticky_key_like_backdoor_execution.yml\"|extend RuleTitle=\"Sticky Key Like Backdoor Execution\"|extend RuleDescription=\"Detects the usage and installation of a backdoor that uses an option to register a malicious debugger for built-in tools that are accessible in the login screen\";\nlet q2=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"rundll32.exe\" and TargetProcessCommandLine contains \".dll\" and TargetProcessCommandLine contains \"StartNodeRelay\")|extend RuleId=\"b18c9d4c-fac9-4708-bd06-dd5bfacf200f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_c3_rundll32_pattern.yml\"|extend RuleTitle=\"HackTool - F-Secure C3 Load by Rundll32\"|extend RuleDescription=\"F-Secure C3 produces DLLs with a default exported StartNodeRelay function.\";\nlet q3=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \" /am51\" and TargetProcessCommandLine contains \" /password\")|extend RuleId=\"d78b5d61-187d-44b6-bf02-93486a80de5a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_dinjector.yml\"|extend RuleTitle=\"HackTool - DInjector PowerShell Cradle Execution\"|extend RuleDescription=\"Detects the use of the Dinject PowerShell cradle based on the specific flags\";\nlet q4=_Im_ProcessCreate\n| where (TargetProcessIMPHASH=~\"09D278F9DE118EF09163C6140255C690\" or TargetProcessCommandLine contains \"Dumpert.dll\")|extend RuleId=\"2704ab9e-afe2-4854-a3b1-0c0706d03578\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_dumpert.yml\"|extend RuleTitle=\"HackTool - Dumpert Process Dumper Execution\"|extend RuleDescription=\"Detects the use of Dumpert process dumper, which dumps the lsass.exe process memory\";\nlet q5=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \" -NoP -NonI -w Hidden -c $x=$((gp HKCU:Software\\\\Microsoft\\\\Windows Update).Update)\" or TargetProcessCommandLine contains \" -NoP -NonI -c $x=$((gp HKCU:Software\\\\Microsoft\\\\Windows Update).Update);\")|extend RuleId=\"3268b746-88d8-4cd3-bffc-30077d02c787\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_empire_powershell_uac_bypass.yml\"|extend RuleTitle=\"HackTool - Empire PowerShell UAC Bypass\"|extend RuleDescription=\"Detects some Empire PowerShell UAC bypass methods\";\nlet q6=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\Inveigh.exe\" or (TargetProcessFilename =~ \"\\\\Inveigh.exe\" or TargetProcessFilename =~ \"\\\\Inveigh.dll\") or TargetProcessFileDescription =~ \"Inveigh\" or (TargetProcessCommandLine contains \" -SpooferIP\" or TargetProcessCommandLine contains \" -ReplyToIPs \" or TargetProcessCommandLine contains \" -ReplyToDomains \" or TargetProcessCommandLine contains \" -ReplyToMACs \" or TargetProcessCommandLine contains \" -SnifferIP\"))|extend RuleId=\"b99a1518-1ad5-4f65-bc95-1ffff97a8fd0\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_inveigh.yml\"|extend RuleTitle=\"HackTool - Inveigh Execution\"|extend RuleDescription=\"Detects the use of Inveigh a cross-platform .NET IPv4/IPv6 machine-in-the-middle tool\";\nlet q7=_Im_ProcessCreate\n| where ((TargetProcessName contains \"\\\\purplesharp\" or TargetProcessFilename =~ \"PurpleSharp.exe\") or (TargetProcessCommandLine contains \"xyz123456.exe\" or TargetProcessCommandLine contains \"PurpleSharp\"))|extend RuleId=\"ff23ffbc-3378-435e-992f-0624dcf93ab4\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_purplesharp_indicators.yml\"|extend RuleTitle=\"HackTool - PurpleSharp Execution\"|extend RuleDescription=\"Detects the execution of the PurpleSharp adversary simulation tool\";\nlet q8=_Im_ProcessCreate\n| where (((TargetProcessName contains \"PetitPotam\" or TargetProcessName contains \"RottenPotato\" or TargetProcessName contains \"HotPotato\" or TargetProcessName contains \"JuicyPotato\" or TargetProcessName contains \"\\\\just_dce_\" or TargetProcessName contains \"Juicy Potato\" or TargetProcessName contains \"\\\\temp\\\\rot.exe\" or TargetProcessName contains \"\\\\Potato.exe\" or TargetProcessName contains \"\\\\SpoolSample.exe\" or TargetProcessName contains \"\\\\Responder.exe\" or TargetProcessName contains \"\\\\smbrelayx\" or TargetProcessName contains \"\\\\ntlmrelayx\" or TargetProcessName contains \"\\\\LocalPotato\") or (TargetProcessCommandLine contains \"Invoke-Tater\" or TargetProcessCommandLine contains \" smbrelay\" or TargetProcessCommandLine contains \" ntlmrelay\" or TargetProcessCommandLine contains \"cme smb \" or TargetProcessCommandLine contains \" /ntlm:NTLMhash \" or TargetProcessCommandLine contains \"Invoke-PetitPotam\" or TargetProcessCommandLine contains \"*.exe -t * -p *\") or (TargetProcessCommandLine contains \".exe -c \\\"{\" and TargetProcessCommandLine endswith \"}\\\" -z\")) and (not((TargetProcessName contains \"HotPotatoes6\" or TargetProcessName contains \"HotPotatoes7\" or TargetProcessName contains \"HotPotatoes \"))))|extend RuleId=\"5589ab4f-a767-433c-961d-c91f3f704db1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_relay_attacks_tools.yml\"|extend RuleTitle=\"Potential SMB Relay Attack Tool Execution\"|extend RuleDescription=\"Detects different hacktools used for relay attacks on Windows for privilege escalation\";\nlet q9=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\Rubeus.exe\" or TargetProcessFilename =~ \"Rubeus.exe\" or TargetProcessFileDescription =~ \"Rubeus\" or (TargetProcessCommandLine contains \"asreproast \" or TargetProcessCommandLine contains \"dump /service:krbtgt \" or TargetProcessCommandLine contains \"dump /luid:0x\" or TargetProcessCommandLine contains \"kerberoast \" or TargetProcessCommandLine contains \"createnetonly /program:\" or TargetProcessCommandLine contains \"ptt /ticket:\" or TargetProcessCommandLine contains \"/impersonateuser:\" or TargetProcessCommandLine contains \"renew /ticket:\" or TargetProcessCommandLine contains \"asktgt /user:\" or TargetProcessCommandLine contains \"harvest /interval:\" or TargetProcessCommandLine contains \"s4u /user:\" or TargetProcessCommandLine contains \"s4u /ticket:\" or TargetProcessCommandLine contains \"hash /password:\" or TargetProcessCommandLine contains \"golden /aes256:\" or TargetProcessCommandLine contains \"silver /user:\"))|extend RuleId=\"7ec2c172-dceb-4c10-92c9-87c1881b7e18\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_rubeus.yml\"|extend RuleTitle=\"HackTool - Rubeus Execution\"|extend RuleDescription=\"Detects the execution of the hacktool Rubeus via PE information of command line parameters\";\nlet q10=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\SafetyKatz.exe\" or TargetProcessFilename =~ \"SafetyKatz.exe\" or TargetProcessFileDescription =~ \"SafetyKatz\")|extend RuleId=\"b1876533-4ed5-4a83-90f3-b8645840a413\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_safetykatz.yml\"|extend RuleTitle=\"HackTool - SafetyKatz Execution\"|extend RuleDescription=\"Detects the execution of the hacktool SafetyKatz via PE information and default Image name\";\nlet q11=_Im_ProcessCreate\n| where (TargetProcessFileCompany =~ \"SecurityXploded\" or TargetProcessName endswith \"PasswordDump.exe\" or TargetProcessFilename endswith \"PasswordDump.exe\")|extend RuleId=\"7679d464-4f74-45e2-9e01-ac66c5eb041a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_secutyxploded.yml\"|extend RuleTitle=\"HackTool - SecurityXploded Execution\"|extend RuleDescription=\"Detects the execution of SecurityXploded Tools\";\nlet q12=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\SharpUp.exe\" or TargetProcessFileDescription =~ \"SharpUp\" or (TargetProcessCommandLine contains \"HijackablePaths\" or TargetProcessCommandLine contains \"UnquotedServicePath\" or TargetProcessCommandLine contains \"ProcessDLLHijack\" or TargetProcessCommandLine contains \"ModifiableServiceBinaries\" or TargetProcessCommandLine contains \"ModifiableScheduledTask\" or TargetProcessCommandLine contains \"DomainGPPPassword\" or TargetProcessCommandLine contains \"CachedGPPPassword\"))|extend RuleId=\"c484e533-ee16-4a93-b6ac-f0ea4868b2f1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_sharpup.yml\"|extend RuleTitle=\"HackTool - SharpUp PrivEsc Tool Execution\"|extend RuleDescription=\"Detects the use of SharpUp, a tool for local privilege escalation\";\nlet q13=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"-NoExit -Command [Console]::OutputEncoding=[Text.UTF8Encoding]::UTF8\"|extend RuleId=\"42333b2c-b425-441c-b70e-99404a17170f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_sliver_c2_execution_pattern.yml\"|extend RuleTitle=\"HackTool - Sliver C2 Implant Activity Pattern\"|extend RuleDescription=\"Detects process activity patterns as seen being used by Sliver C2 framework implants\";\nlet q14=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\SysmonEOP.exe\" or ((TargetProcessIMPHASH=~\"22F4089EB8ABA31E1BB162C6D9BF72E5\" or TargetProcessIMPHASH=~\"5123FA4C4384D431CD0D893EEB49BBEC\") or (TargetProcessIMPHASH =~ \"22f4089eb8aba31e1bb162c6d9bf72e5\" or TargetProcessIMPHASH =~ \"5123fa4c4384d431cd0d893eeb49bbec\")))|extend RuleId=\"8a7e90c5-fe6e-45dc-889e-057fe4378bd9\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_sysmoneop.yml\"|extend RuleTitle=\"HackTool - SysmonEOP Execution\"|extend RuleDescription=\"Detects the execution of the PoC that can be used to exploit Sysmon CVE-2022-41120\";\nlet q15=_Im_ProcessCreate\n| where ((((TargetProcessIMPHASH =~ \"a53a02b997935fd8eedcb5f7abab9b9f\" or TargetProcessIMPHASH =~ \"e96a73c7bf33a464c510ede582318bf2\") or (TargetProcessIMPHASH=~\"a53a02b997935fd8eedcb5f7abab9b9f\" or TargetProcessIMPHASH=~\"e96a73c7bf33a464c510ede582318bf2\")) or (TargetProcessCommandLine endswith \".exe -S\" and ActingProcessName endswith \"\\\\services.exe\")) and (not(TargetProcessName endswith \"\\\\clussvc.exe\")))|extend RuleId=\"7aa7009a-28b9-4344-8c1f-159489a390df\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_wce.yml\"|extend RuleTitle=\"HackTool - Windows Credential Editor (WCE) Execution\"|extend RuleDescription=\"Detects the use of Windows Credential Editor (WCE)\";\nlet q16=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\Windows\\\\System32\\\\lsass.exe\" and TargetProcessName endswith \"\\\\Windows\\\\System32\\\\lsass.exe\")|extend RuleId=\"c8da0dfd-4ed0-4b68-962d-13c9c884384e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lsass_process_clone.yml\"|extend RuleTitle=\"Potential Credential Dumping Via LSASS Process Clone\"|extend RuleDescription=\"Detects a suspicious LSASS process process clone that could be a sign of credential dumping activity\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["LateralMovement", "Collection", "Execution", "PrivilegeEscalation", "DefenseEvasion", "CredentialAccess", "Persistence", "Discovery", "ResourceDevelopment"],
                "techniques": ["T1557", "T1615", "T1558", "T1003", "T1546", "T1550", "T1068", "T1548", "T1587", "T1218", "T1555", "T1055", "T1574", "T1569", "T1059"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000300",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}