{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000226')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000226')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 26",
                "description": "Sigma Windows Process Creation medium 26",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\regedit.exe\" and (ActingProcessName endswith \"\\\\TrustedInstaller.exe\" or ActingProcessName endswith \"\\\\ProcessHacker.exe\"))|extend RuleId=\"883835a7-df45-43e4-bf1d-4268768afda4\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_regedit_trustedinstaller.yml\"|extend RuleTitle=\"Regedit as Trusted Installer\"|extend RuleDescription=\"Detects a regedit started with TrustedInstaller privileges or by ProcessHacker.exe\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\regini.exe\" or TargetProcessFilename =~ \"REGINI.EXE\") and TargetProcessCommandLine matches regex \":[^ \\\\\\\\]\")|extend RuleId=\"77946e79-97f1-45a2-84b4-f37b5c0d8682\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_regini_ads.yml\"|extend RuleTitle=\"Suspicious Registry Modification From ADS Via Regini.EXE\"|extend RuleDescription=\"Detects the import of an alternate data stream with regini.exe, regini.exe can be used to modify registry keys.\";\nlet q2=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Internet Settings\\\\ZoneMap\\\\ProtocolDefaults\" and TargetProcessCommandLine contains \"http\" and TargetProcessCommandLine contains \" 0\")|extend RuleId=\"10344bb3-7f65-46c2-b915-2d00d47be5b0\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_registry_ie_security_zone_protocol_defaults_downgrade.yml\"|extend RuleTitle=\"IE ZoneMap Setting Downgraded To MyComputer Zone For HTTP Protocols Via CLI\"|extend RuleDescription=\"Detects changes to Internet Explorer's (IE / Windows Internet properties) ZoneMap configuration of the \\\"HTTP\\\" and \\\"HTTPS\\\" protocols to point to the \\\"My Computer\\\" zone. This allows downloaded files from the Internet to be granted the same level of trust as files stored locally.\\n\";\nlet q3=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"\\\\CurrentVersion\\\\Image File Execution Options\\\\\" and (TargetProcessCommandLine contains \"sethc.exe\" or TargetProcessCommandLine contains \"utilman.exe\" or TargetProcessCommandLine contains \"osk.exe\" or TargetProcessCommandLine contains \"magnify.exe\" or TargetProcessCommandLine contains \"narrator.exe\" or TargetProcessCommandLine contains \"displayswitch.exe\" or TargetProcessCommandLine contains \"atbroker.exe\" or TargetProcessCommandLine contains \"HelpPane.exe\"))|extend RuleId=\"ae215552-081e-44c7-805f-be16f975c8a2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_registry_install_reg_debugger_backdoor.yml\"|extend RuleTitle=\"Suspicious Debugger Registration Cmdline\"|extend RuleDescription=\"Detects the registration of a debugger for a program that is available in the logon screen (sticky key backdoor).\";\nlet q4=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"UserInitMprLogonScript\"|extend RuleId=\"21d856f9-9281-4ded-9377-51a1a6e2a432\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_registry_logon_script.yml\"|extend RuleTitle=\"Potential Persistence Via Logon Scripts - CommandLine\"|extend RuleDescription=\"Detects the addition of a new LogonScript to the registry value \\\"UserInitMprLogonScript\\\" for potential persistence\";\nlet q5=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"\\\\System\\\\CurrentControlSet\\\\Services\\\\\" and TargetProcessCommandLine contains \"\\\\NetworkProvider\")|extend RuleId=\"baef1ec6-2ca9-47a3-97cc-4cf2bda10b77\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_registry_new_network_provider.yml\"|extend RuleTitle=\"Potential Credential Dumping Attempt Using New NetworkProvider - CLI\"|extend RuleDescription=\"Detects when an attacker tries to add a new network provider in order to dump clear text credentials, similar to how the NPPSpy tool does it\";\nlet q6=_Im_ProcessCreate\n| where (TargetProcessIntegrityLevel =~ \"Medium\" and (TargetProcessCommandLine contains \"ControlSet\" and TargetProcessCommandLine contains \"services\") and (TargetProcessCommandLine contains \"\\\\ImagePath\" or TargetProcessCommandLine contains \"\\\\FailureCommand\" or TargetProcessCommandLine contains \"\\\\ServiceDll\"))|extend RuleId=\"0f9c21f1-6a73-4b0e-9809-cb562cb8d981\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_registry_privilege_escalation_via_service_key.yml\"|extend RuleTitle=\"Potential Privilege Escalation via Service Permissions Weakness\"|extend RuleDescription=\"Detect modification of services configuration (ImagePath, FailureCommand and ServiceDLL) in registry by processes with Medium integrity level\";\nlet q7=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"SOFTWARE\\\\Microsoft\\\\Provisioning\\\\Commands\\\\\"|extend RuleId=\"2a4b3e61-9d22-4e4a-b60f-6e8f0cde6f25\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_registry_provlaunch_provisioning_command.yml\"|extend RuleTitle=\"Potential Provisioning Registry Key Abuse For Binary Proxy Execution\"|extend RuleDescription=\"Detects potential abuse of the provisioning registry key for indirect command execution through \\\"Provlaunch.exe\\\".\";\nlet q8=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"\\\\ShellIds\\\\Microsoft.PowerShell\\\\ExecutionPolicy\" or TargetProcessCommandLine contains \"\\\\Policies\\\\Microsoft\\\\Windows\\\\PowerShell\\\\ExecutionPolicy\") and (TargetProcessCommandLine contains \"Bypass\" or TargetProcessCommandLine contains \"RemoteSigned\" or TargetProcessCommandLine contains \"Unrestricted\"))|extend RuleId=\"cf2e938e-9a3e-4fe8-a347-411642b28a9f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_registry_set_unsecure_powershell_policy.yml\"|extend RuleTitle=\"Potential PowerShell Execution Policy Tampering - ProcCreation\"|extend RuleDescription=\"Detects changes to the PowerShell execution policy registry key in order to bypass signing requirements for script execution from the CommandLine\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessFilename =~ \"REGSVR32.EXE\") and (TargetProcessCommandLine contains \" /i:http://1\" or TargetProcessCommandLine contains \" /i:http://2\" or TargetProcessCommandLine contains \" /i:http://3\" or TargetProcessCommandLine contains \" /i:http://4\" or TargetProcessCommandLine contains \" /i:http://5\" or TargetProcessCommandLine contains \" /i:http://6\" or TargetProcessCommandLine contains \" /i:http://7\" or TargetProcessCommandLine contains \" /i:http://8\" or TargetProcessCommandLine contains \" /i:http://9\" or TargetProcessCommandLine contains \" /i:https://1\" or TargetProcessCommandLine contains \" /i:https://2\" or TargetProcessCommandLine contains \" /i:https://3\" or TargetProcessCommandLine contains \" /i:https://4\" or TargetProcessCommandLine contains \" /i:https://5\" or TargetProcessCommandLine contains \" /i:https://6\" or TargetProcessCommandLine contains \" /i:https://7\" or TargetProcessCommandLine contains \" /i:https://8\" or TargetProcessCommandLine contains \" /i:https://9\" or TargetProcessCommandLine contains \" -i:http://1\" or TargetProcessCommandLine contains \" -i:http://2\" or TargetProcessCommandLine contains \" -i:http://3\" or TargetProcessCommandLine contains \" -i:http://4\" or TargetProcessCommandLine contains \" -i:http://5\" or TargetProcessCommandLine contains \" -i:http://6\" or TargetProcessCommandLine contains \" -i:http://7\" or TargetProcessCommandLine contains \" -i:http://8\" or TargetProcessCommandLine contains \" -i:http://9\" or TargetProcessCommandLine contains \" -i:https://1\" or TargetProcessCommandLine contains \" -i:https://2\" or TargetProcessCommandLine contains \" -i:https://3\" or TargetProcessCommandLine contains \" -i:https://4\" or TargetProcessCommandLine contains \" -i:https://5\" or TargetProcessCommandLine contains \" -i:https://6\" or TargetProcessCommandLine contains \" -i:https://7\" or TargetProcessCommandLine contains \" -i:https://8\" or TargetProcessCommandLine contains \" -i:https://9\"))|extend RuleId=\"2dd2c217-bf68-437a-b57c-fe9fd01d5de8\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_regsvr32_http_ip_pattern.yml\"|extend RuleTitle=\"Potentially Suspicious Regsvr32 HTTP IP Pattern\"|extend RuleDescription=\"Detects regsvr32 execution to download and install DLLs located remotely where the address is an IP address.\";\nlet q10=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessFilename =~ \"\\\\REGSVR32.EXE\") and TargetProcessCommandLine contains \" \\\\\\\\\")|extend RuleId=\"88a87a10-384b-4ad7-8871-2f9bf9259ce5\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_regsvr32_remote_share.yml\"|extend RuleTitle=\"Suspicious Regsvr32 Execution From Remote Share\"|extend RuleDescription=\"Detects REGSVR32.exe to execute DLL hosted on remote shares\";\nlet q11=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\regsvr32.exe\" and (TargetProcessName endswith \"\\\\calc.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\explorer.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\" or TargetProcessName endswith \"\\\\nltest.exe\" or TargetProcessName endswith \"\\\\notepad.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\reg.exe\" or TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessName endswith \"\\\\werfault.exe\" or TargetProcessName endswith \"\\\\wscript.exe\")) and (not((TargetProcessName endswith \"\\\\werfault.exe\" and TargetProcessCommandLine contains \" -u -p \"))))|extend RuleId=\"6f0947a4-1c5e-4e0d-8ac7-53159b8f23ca\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_regsvr32_susp_child_process.yml\"|extend RuleTitle=\"Potentially Suspicious Child Process Of Regsvr32\"|extend RuleDescription=\"Detects potentially suspicious child processes of \\\"regsvr32.exe\\\".\";\nlet q12=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessFilename =~ \"REGSVR32.EXE\") and ((TargetProcessCommandLine contains \":\\\\PerfLogs\\\\\" or TargetProcessCommandLine contains \":\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\Registration\\\\CRMLog\" or TargetProcessCommandLine contains \"\\\\Windows\\\\System32\\\\com\\\\dmp\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\System32\\\\FxsTmp\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\System32\\\\Microsoft\\\\Crypto\\\\RSA\\\\MachineKeys\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\color\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\System32\\\\spool\\\\PRINTERS\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\System32\\\\spool\\\\SERVERS\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\System32\\\\Tasks_Migrated\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\System32\\\\Tasks\\\\Microsoft\\\\Windows\\\\SyncCenter\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\SysWOW64\\\\com\\\\dmp\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\SysWOW64\\\\FxsTmp\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\SysWOW64\\\\Tasks\\\\Microsoft\\\\Windows\\\\PLA\\\\System\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\SysWOW64\\\\Tasks\\\\Microsoft\\\\Windows\\\\SyncCenter\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\Tasks\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\Tracing\\\\\") or ((TargetProcessCommandLine contains \" \\\"C:\\\\\" or TargetProcessCommandLine contains \" C:\\\\\" or TargetProcessCommandLine contains \" 'C:\\\\\" or TargetProcessCommandLine contains \"D:\\\\\") and (not((TargetProcessCommandLine contains \"C:\\\\Program Files (x86)\\\\\" or TargetProcessCommandLine contains \"C:\\\\Program Files\\\\\" or TargetProcessCommandLine contains \"C:\\\\ProgramData\\\\\" or TargetProcessCommandLine contains \"C:\\\\Users\\\\\" or TargetProcessCommandLine contains \" C:\\\\Windows\\\\\" or TargetProcessCommandLine contains \" \\\"C:\\\\Windows\\\\\" or TargetProcessCommandLine contains \" 'C:\\\\Windows\\\\\"))))) and (not((TargetProcessCommandLine =~ \"\" or isnull(TargetProcessCommandLine)))))|extend RuleId=\"327ff235-94eb-4f06-b9de-aaee571324be\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_regsvr32_susp_exec_path_2.yml\"|extend RuleTitle=\"Regsvr32 Execution From Highly Suspicious Location\"|extend RuleDescription=\"Detects execution of regsvr32 where the DLL is located in a highly suspicious locations\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Persistence", "PrivilegeEscalation", "DefenseEvasion", "CredentialAccess", "Execution"],
                "techniques": ["T1548", "T1218", "T1546", "T1574", "T1003", "T1112", "T1037"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000226",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}