{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000115')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000115')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 15",
                "description": "Sigma Windows Process Creation low 15",
                "severity": "low",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\chromeexe\" or ActingProcessName endswith \"\\\\discordexe\" or ActingProcessName endswith \"\\\\GitHubDesktopexe\" or ActingProcessName endswith \"\\\\keybaseexe\" or ActingProcessName endswith \"\\\\msedgeexe\" or ActingProcessName endswith \"\\\\msedgewebview2exe\" or ActingProcessName endswith \"\\\\msteamsexe\" or ActingProcessName endswith \"\\\\slackexe\" or ActingProcessName endswith \"\\\\Teamsexe\") and ((TargetProcessName endswith \"\\\\cmdexe\" or TargetProcessName endswith \"\\\\cscriptexe\" or TargetProcessName endswith \"\\\\mshtaexe\" or TargetProcessName endswith \"\\\\powershellexe\" or TargetProcessName endswith \"\\\\pwshexe\" or TargetProcessName endswith \"\\\\regsvr32exe\" or TargetProcessName endswith \"\\\\wscriptexe\") or (TargetProcessName contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or TargetProcessName contains \"\\\\Users\\\\Public\\\\\" or TargetProcessName contains \"\\\\Windows\\\\Temp\\\\\" or TargetProcessName contains \":\\\\Temp\\\\\")) and (not(((ActingProcessName endswith \"\\\\chromeexe\" and TargetProcessName endswith \"\\\\chromeexe\") or (ActingProcessName endswith \"\\\\discordexe\" and TargetProcessName endswith \"\\\\discordexe\") or (ActingProcessName endswith \"\\\\GitHubDesktopexe\" and TargetProcessName endswith \"\\\\GitHubDesktopexe\") or (ActingProcessName endswith \"\\\\keybaseexe\" and TargetProcessName endswith \"\\\\keybaseexe\") or (ActingProcessName endswith \"\\\\msedgeexe\" and TargetProcessName endswith \"\\\\msedgeexe\") or (ActingProcessName endswith \"\\\\msedgewebview2exe\" and TargetProcessName endswith \"\\\\msedgewebview2exe\") or (ActingProcessName endswith \"\\\\msteamsexe\" and TargetProcessName endswith \"\\\\msteamsexe\") or (ActingProcessName endswith \"\\\\slackexe\" and TargetProcessName endswith \"\\\\slackexe\") or (ActingProcessName endswith \"\\\\teamsexe\" and TargetProcessName endswith \"\\\\teamsexe\") or (TargetProcessName =~ \"C:\\\\Windows\\\\SysWOW64\\\\WerFaultexe\" or TargetProcessName =~ \"C:\\\\Windows\\\\System32\\\\WerFaultexe\")))) and (not((ActingProcessName endswith \"\\\\Discordexe\" and TargetProcessCommandLine contains \"\\\\NVSMI\\\\nvidia-smiexe\"))))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000114\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_electron_app_children.yml\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\chromeexe\" or TargetProcessName endswith \"\\\\codeexe\" or TargetProcessName endswith \"\\\\discordexe\" or TargetProcessName endswith \"\\\\GitHubDesktopexe\" or TargetProcessName endswith \"\\\\keybaseexe\" or TargetProcessName endswith \"\\\\msedgeexe\" or TargetProcessName endswith \"\\\\msedgewebview2exe\" or TargetProcessName endswith \"\\\\msteamsexe\" or TargetProcessName endswith \"\\\\slackexe\" or TargetProcessName endswith \"\\\\Teamsexe\") and (TargetProcessCommandLine contains \"--browser-subprocess-path\" or TargetProcessCommandLine contains \"--gpu-launcher\" or TargetProcessCommandLine contains \"--renderer-cmd-prefix\" or TargetProcessCommandLine contains \"--utility-cmd-prefix\"))|extend RuleId=\"378a05d8-963c-46c9-bcce-13c7657eac99\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_electron_exeuction_proxy.yml\";\nlet q2=_Im_ProcessCreate\n| where ((((TargetProcessName endswith \"\\\\powershellexe\" or TargetProcessName endswith \"\\\\pwshexe\" or TargetProcessName endswith \"\\\\cmdexe\") or (TargetProcessFilename =~ \"PowerShellEXE\" or TargetProcessFilename =~ \"pwshdll\" or TargetProcessFilename =~ \"CmdExe\")) and ((TargetUsername contains \"AUTHORI\" or TargetUsername contains \"AUTORI\") and LogonId =~ \"0x3e7\")) and (not((((ActingProcessName contains \":\\\\Windows\\\\System32\\\\\" or ActingProcessName contains \":\\\\Program Files (x86)\\\\\" or ActingProcessName contains \":\\\\Program Files\\\\\") and (TargetProcessName endswith \"\\\\cmdexe\" or TargetProcessName endswith \"\\\\powershellexe\")) or ((ActingProcessName contains \":\\\\Windows\\\\System32\" or ActingProcessName contains \":\\\\Windows\\\\WinSxS\\\\\") and ActingProcessName endswith \"\\\\CompatTelRunnerexe\" and ActingProcessCommandLine contains \":\\\\Windows\\\\system32\\\\CompatTelRunnerexe -m:appraiserdll -f:DoScheduledTelemetryRun\") or (ActingProcessName endswith \":\\\\Windows\\\\SysWOW64\\\\msiexecexe\" and ActingProcessCommandLine contains \":\\\\Windows\\\\syswow64\\\\MsiExecexe -Embedding\" and TargetProcessCommandLine contains \"\\\\RegisterMicrosoftUpdateps1\") or ((TargetProcessCommandLine startswith \"powershellexe -ExecutionPolicy Restricted -Command  $res = 0; \" or TargetProcessCommandLine startswith \"powershellexe -ExecutionPolicy Restricted -Command Write-Host \") and (TargetProcessCommandLine endswith \"Write-Host 'Final result:', $Res;\" or TargetProcessCommandLine endswith \"Write-Host \\\"Final result:\\\", $res\" or TargetProcessCommandLine endswith \"Write-Host 'Final result: 1';\")) or (TargetProcessName endswith \"\\\\cmdexe\" and TargetProcessCommandLine contains \"/d /c C:\\\\Windows\\\\system32\\\\silcollectorcmd\") or (TargetProcessName endswith \"\\\\cmdexe\" and (TargetProcessCommandLine endswith \"cmdexe /c btool server list replication_port --no-log\" or TargetProcessCommandLine endswith \"cmdexe /c btool server list general --no-log\")) or (TargetProcessName endswith \"\\\\cmdexe\" and TargetProcessCommandLine contains \":\\\\Windows\\\\system32\\\\regexe query hklm\\\\software\\\\microsoft\\\\windows\\\\softwareinventorylogging /v collectionstate /reg:64\") or (TargetProcessName endswith \":\\\\Windows\\\\System32\\\\cmdexe\" and TargetProcessCommandLine endswith \":\\\\Windows\\\\system32\\\\cmdexe /c PAUSE\")))) and (not(((ActingProcessName endswith \":\\\\ManageEngine\\\\ADManager Plus\\\\pgsql\\\\bin\\\\postgresexe\" and TargetProcessName endswith \"\\\\cmdexe\") or (ActingProcessName contains \":\\\\Windows\\\\SysWOW64\\\\config\\\\systemprofile\\\\Citrix\\\\UpdaterBinaries\\\\\" and ActingProcessName endswith \"\\\\CitrixReceiverUpdaterexe\" and TargetProcessName endswith \"\\\\cmdexe\") or (TargetProcessCommandLine contains \":\\\\WINDOWS\\\\system32\\\\cmdexe /c \\\"\" and TargetProcessCurrentDirectory contains \":\\\\WINDOWS\\\\Temp\\\\asgard2-agent\\\\\") or (ActingProcessName contains \":\\\\Windows\\\\Temp\" and ActingProcessName endswith \"\\\\invcolexe\" and ActingProcessCommandLine contains \":\\\\ProgramData\\\\Dell\\\\UpdateService\\\\\" and TargetProcessName endswith \"\\\\cmdexe\") or (ActingProcessName contains \":\\\\IBM\\\\SpectrumProtect\\\\webserver\\\\scripts\\\\\" and TargetProcessCommandLine contains \":\\\\IBM\\\\SpectrumProtect\\\\webserver\\\\scripts\\\\\") or TargetProcessCommandLine contains \":\\\\Windows\\\\system32\\\\cmdexe\\\" /C copy \\\"C:\\\\ProgramData\\\\Avira\\\\SystemSpeedup\\\\Update\\\\avira_speedup_setup_updateexe\\\"\" or (ActingProcessName =~ \"\" and TargetProcessCommandLine contains \":\\\\IBM\\\\SpectrumProtect\\\\webserver\\\\scripts\\\\\") or (isnull(ActingProcessName) and TargetProcessCommandLine contains \":\\\\IBM\\\\SpectrumProtect\\\\webserver\\\\scripts\\\\\")))))|extend RuleId=\"178e615d-e666-498b-9630-9ed363038101\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_elevated_system_shell.yml\";\nlet q3=_Im_ProcessCreate\n| where (ActingProcessName =~ \"C:\\\\Windows\\\\explorerexe\" and TargetProcessName =~ \"C:\\\\Windows\\\\System32\\\\cmdexe\" and (TargetProcessCommandLine contains \"powershell\" and TargetProcessCommandLine contains \"lnk\"))|extend RuleId=\"30e92f50-bb5a-4884-98b5-d20aa80f3d7a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_embed_exe_lnk.yml\";\nlet q4=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\") and (TargetProcessCommandLine contains \"\\\\{\" and TargetProcessCommandLine contains \"}\\\\\")) and (not(((TargetProcessName contains \"\\\\{\" and TargetProcessName contains \"}\\\\\") or isnull(TargetProcessName) or TargetProcessName =~ \"C:\\\\Windows\\\\System32\\\\drvinstexe\"))))|extend RuleId=\"90b63c33-2b97-4631-a011-ceb0f47b77c3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_execution_from_guid_folder_names.yml\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessName contains \"\\\\wwwroot\\\\\" or TargetProcessName contains \"\\\\wmpub\\\\\" or TargetProcessName contains \"\\\\htdocs\\\\\") and (not(((TargetProcessName contains \"bin\\\\\" or TargetProcessName contains \"\\\\Tools\\\\\" or TargetProcessName contains \"\\\\SMSComponent\\\\\") and ActingProcessName endswith \"\\\\servicesexe\"))))|extend RuleId=\"35efb964-e6a5-47ad-bbcd-19661854018d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_execution_path_webserver.yml\";\nlet q6=_Im_ProcessCreate\n| where (((TargetProcessFileDescription =~ \"?\" and FileVersion =~ \"?\") or (TargetProcessFileDescription =~ \"?\" and TargetProcessFileProduct =~ \"?\") or (TargetProcessFileDescription =~ \"?\" and TargetProcessFileCompany =~ \"?\")) and TargetProcessName contains \"\\\\Downloads\\\\\")|extend RuleId=\"9637e8a5-7131-4f7f-bdc7-2b05d8670c43\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_file_characteristics.yml\";\nlet q7=_Im_ProcessCreate\n| where ((((TargetProcessName endswith \"\\\\caclsexe\" or TargetProcessName endswith \"\\\\icaclsexe\" or TargetProcessName endswith \"\\\\netexe\" or TargetProcessName endswith \"\\\\net1exe\") and (TargetProcessCommandLine contains \"/grant\" or TargetProcessCommandLine contains \"/setowner\" or TargetProcessCommandLine contains \"/inheritance:r\")) or (TargetProcessName endswith \"\\\\attribexe\" and TargetProcessCommandLine contains \"-r\") or TargetProcessName endswith \"\\\\takeownexe\") and (not((TargetProcessCommandLine endswith \"ICACLS C:\\\\ProgramData\\\\dynatrace\\\\gateway\\\\config\\\\connectivityhistory /reset\" or (TargetProcessCommandLine contains \"ICACLS C:\\\\ProgramData\\\\dynatrace\\\\gateway\\\\config\\\\configproperties /grant :r \" and TargetProcessCommandLine contains \"S-1-5-19:F\") or (TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Programs\\\\Microsoft VS Code\" or ActingProcessName endswith \"\\\\Microsoft VS Code\\\\Codeexe\")))))|extend RuleId=\"37ae075c-271b-459b-8d7b-55ad5f993dd8\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_file_permission_modifications.yml\";\nlet q8=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"::$index_allocation\"|extend RuleId=\"0900463c-b33b-49a8-be1d-552a3b553dae\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_hidden_dir_index_allocation.yml\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"echo\" or TargetProcessCommandLine contains \"copy\" or TargetProcessCommandLine contains \"type\" or TargetProcessCommandLine contains \"file createnew\" or TargetProcessCommandLine contains \"cacls\") and TargetProcessCommandLine contains \"C:\\\\Windows\\\\Fonts\\\\\" and (TargetProcessCommandLine contains \"sh\" or TargetProcessCommandLine contains \"exe\" or TargetProcessCommandLine contains \"dll\" or TargetProcessCommandLine contains \"bin\" or TargetProcessCommandLine contains \"bat\" or TargetProcessCommandLine contains \"cmd\" or TargetProcessCommandLine contains \"js\" or TargetProcessCommandLine contains \"msh\" or TargetProcessCommandLine contains \"reg\" or TargetProcessCommandLine contains \"scr\" or TargetProcessCommandLine contains \"ps\" or TargetProcessCommandLine contains \"vb\" or TargetProcessCommandLine contains \"jar\" or TargetProcessCommandLine contains \"pl\" or TargetProcessCommandLine contains \"inf\" or TargetProcessCommandLine contains \"cpl\" or TargetProcessCommandLine contains \"hta\" or TargetProcessCommandLine contains \"msi\" or TargetProcessCommandLine contains \"vbs\"))|extend RuleId=\"ae9b0bd7-8888-4606-b444-0ed7410cb728\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_hiding_malware_in_fonts_folder.yml\";\nlet q10=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\calcexe\" or TargetProcessName endswith \"\\\\certutilexe\" or TargetProcessName endswith \"\\\\cmstpexe\" or TargetProcessName endswith \"\\\\cscriptexe\" or TargetProcessName endswith \"\\\\installutilexe\" or TargetProcessName endswith \"\\\\mshtaexe\" or TargetProcessName endswith \"\\\\regsvr32exe\" or TargetProcessName endswith \"\\\\rundll32exe\" or TargetProcessName endswith \"\\\\wscriptexe\") or (TargetProcessFilename =~ \"CALCEXE\" or TargetProcessFilename =~ \"CertUtilexe\" or TargetProcessFilename =~ \"CMSTPEXE\" or TargetProcessFilename =~ \"cscriptexe\" or TargetProcessFilename =~ \"installutilexe\" or TargetProcessFilename =~ \"MSHTAEXE\" or TargetProcessFilename =~ \"REGSVR32EXE\" or TargetProcessFilename =~ \"RUNDLL32EXE\" or TargetProcessFilename =~ \"wscriptexe\")) and (not((TargetProcessCurrentDirectory contains \"C:\\\\\" or TargetProcessCurrentDirectory =~ \"\" or isnull(TargetProcessCurrentDirectory)))))|extend RuleId=\"d4ca7c59-e9e4-42d8-bf57-91a776efcb87\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_lolbin_exec_from_non_c_drive.yml\";\nlet q11=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"for \" or TargetProcessCommandLine contains \"foreach \") and (TargetProcessCommandLine contains \"nslookup\" or TargetProcessCommandLine contains \"ping\"))|extend RuleId=\"f8ad2e2c-40b6-4117-84d7-20b89896ab23\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_network_scan_loop.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Persistence", "Execution", "DefenseEvasion", "PrivilegeEscalation", "Discovery"],
                "techniques": ["T1505", "T1222", "T1564", "T1018", "T1059", "T1027", "T1211"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000115",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}