{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000217')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000217')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 17",
                "description": "Sigma Windows Process Creation medium 17",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") and TargetProcessCommandLine matches regex \"\\\\s-\\\\s*<\")|extend RuleId=\"5163A000-5160-5160-5160-5163A0000216\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_run_script_from_input_stream.yml\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"\\\\HarddiskVolumeShadowCopy\" and TargetProcessCommandLine contains \"System32\\\\config\\\\sam\") and (TargetProcessCommandLine contains \"Copy-Item\" or TargetProcessCommandLine contains \"cp $_.\" or TargetProcessCommandLine contains \"cpi $_.\" or TargetProcessCommandLine contains \"copy $_.\" or TargetProcessCommandLine contains \".File]::Copy(\"))|extend RuleId=\"1af57a4b-460a-4738-9034-db68b880c665\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_sam_access.yml\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessFilename =~ \"pwsh.dll\") and (TargetProcessCommandLine contains \"-SecurityDescriptorSddl \" or TargetProcessCommandLine contains \"-sd \") and ((TargetProcessCommandLine contains \"Set-Service \" and TargetProcessCommandLine contains \"D;;\") and (TargetProcessCommandLine contains \";;;IU\" or TargetProcessCommandLine contains \";;;SU\" or TargetProcessCommandLine contains \";;;BA\" or TargetProcessCommandLine contains \";;;SY\" or TargetProcessCommandLine contains \";;;WD\")))|extend RuleId=\"a95b9b42-1308-4735-a1af-abb1c5e6f5ac\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_service_dacl_modification_set_service.yml\";\nlet q3=_Im_ProcessCreate\n| where (((TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\") or (TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\")) and (TargetProcessCommandLine contains \"Set-Acl \" and TargetProcessCommandLine contains \"-AclObject \" and TargetProcessCommandLine contains \"-Path \"))|extend RuleId=\"bdeb2cff-af74-4094-8426-724dc937f20a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_set_acl.yml\";\nlet q4=_Im_ProcessCreate\n| where (((TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\") or (TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\")) and (TargetProcessCommandLine contains \"Set-Acl \" and TargetProcessCommandLine contains \"-AclObject \") and (TargetProcessCommandLine contains \"-Path \\\"C:\\\\Windows\" or TargetProcessCommandLine contains \"-Path 'C:\\\\Windows\" or TargetProcessCommandLine contains \"-Path %windir%\" or TargetProcessCommandLine contains \"-Path $env:windir\") and (TargetProcessCommandLine contains \"FullControl\" or TargetProcessCommandLine contains \"Allow\"))|extend RuleId=\"0944e002-e3f6-4eb5-bf69-3a3067b53d73\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_set_acl_susp_location.yml\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"Get-WmiObject\" or TargetProcessCommandLine contains \"gwmi\" or TargetProcessCommandLine contains \"Get-CimInstance\" or TargetProcessCommandLine contains \"gcim\") and TargetProcessCommandLine contains \"Win32_Shadowcopy\" and (TargetProcessCommandLine contains \".Delete()\" or TargetProcessCommandLine contains \"Remove-WmiObject\" or TargetProcessCommandLine contains \"rwmi\" or TargetProcessCommandLine contains \"Remove-CimInstance\" or TargetProcessCommandLine contains \"rcim\"))|extend RuleId=\"21ff4ca9-f13a-41ad-b828-0077b2af2e40\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_shadowcopy_deletion.yml\";\nlet q6=_Im_ProcessCreate\n| where ((((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and TargetProcessCommandLine contains \"Add-PSSnapin\" and (TargetProcessCommandLine contains \"Microsoft.Exchange.Powershell.Snapin\" or TargetProcessCommandLine contains \"Microsoft.Exchange.Management.PowerShell.SnapIn\")) and (not((ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\msiexec.exe\" and TargetProcessCommandLine contains \"$exserver=Get-ExchangeServer ([Environment]::MachineName) -ErrorVariable exerr 2> $null\"))))|extend RuleId=\"25676e10-2121-446e-80a4-71ff8506af47\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_snapins_hafnium.yml\";\nlet q7=_Im_ProcessCreate\n| where (((ActingProcessName endswith \"\\\\powershell_ise.exe\" or ActingProcessName endswith \"\\\\powershell.exe\" or ActingProcessName endswith \"\\\\pwsh.exe\") and (TargetProcessName endswith \"\\\\bash.exe\" or TargetProcessName endswith \"\\\\bitsadmin.exe\" or TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\forfiles.exe\" or TargetProcessName endswith \"\\\\hh.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessName endswith \"\\\\scrcons.exe\" or TargetProcessName endswith \"\\\\scriptrunner.exe\" or TargetProcessName endswith \"\\\\sh.exe\" or TargetProcessName endswith \"\\\\wmic.exe\" or TargetProcessName endswith \"\\\\wscript.exe\")) and (not((ActingProcessCommandLine contains \"\\\\Program Files\\\\Amazon\\\\WorkspacesConfig\\\\Scripts\\\\\" and TargetProcessCommandLine contains \"\\\\Program Files\\\\Amazon\\\\WorkspacesConfig\\\\Scripts\\\\\"))))|extend RuleId=\"e4b6d2a7-d8a4-4f19-acbd-943c16d90647\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_susp_child_processes.yml\";\nlet q8=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"IEX ((New-Object Net.WebClient).DownloadString\" or TargetProcessCommandLine contains \"IEX (New-Object Net.WebClient).DownloadString\" or TargetProcessCommandLine contains \"IEX((New-Object Net.WebClient).DownloadString\" or TargetProcessCommandLine contains \"IEX(New-Object Net.WebClient).DownloadString\" or TargetProcessCommandLine contains \" -command (New-Object System.Net.WebClient).DownloadFile(\" or TargetProcessCommandLine contains \" -c (New-Object System.Net.WebClient).DownloadFile(\")|extend RuleId=\"e6c54d94-498c-4562-a37c-b469d8e9a275\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_susp_download_patterns.yml\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") and (TargetProcessCommandLine contains \" -windowstyle h \" or TargetProcessCommandLine contains \" -windowstyl h\" or TargetProcessCommandLine contains \" -windowsty h\" or TargetProcessCommandLine contains \" -windowst h\" or TargetProcessCommandLine contains \" -windows h\" or TargetProcessCommandLine contains \" -windo h\" or TargetProcessCommandLine contains \" -wind h\" or TargetProcessCommandLine contains \" -win h\" or TargetProcessCommandLine contains \" -wi h\" or TargetProcessCommandLine contains \" -win h \" or TargetProcessCommandLine contains \" -win hi \" or TargetProcessCommandLine contains \" -win hid \" or TargetProcessCommandLine contains \" -win hidd \" or TargetProcessCommandLine contains \" -win hidde \" or TargetProcessCommandLine contains \" -NoPr \" or TargetProcessCommandLine contains \" -NoPro \" or TargetProcessCommandLine contains \" -NoProf \" or TargetProcessCommandLine contains \" -NoProfi \" or TargetProcessCommandLine contains \" -NoProfil \" or TargetProcessCommandLine contains \" -nonin \" or TargetProcessCommandLine contains \" -nonint \" or TargetProcessCommandLine contains \" -noninte \" or TargetProcessCommandLine contains \" -noninter \" or TargetProcessCommandLine contains \" -nonintera \" or TargetProcessCommandLine contains \" -noninterac \" or TargetProcessCommandLine contains \" -noninteract \" or TargetProcessCommandLine contains \" -noninteracti \" or TargetProcessCommandLine contains \" -noninteractiv \" or TargetProcessCommandLine contains \" -ec \" or TargetProcessCommandLine contains \" -encodedComman \" or TargetProcessCommandLine contains \" -encodedComma \" or TargetProcessCommandLine contains \" -encodedComm \" or TargetProcessCommandLine contains \" -encodedCom \" or TargetProcessCommandLine contains \" -encodedCo \" or TargetProcessCommandLine contains \" -encodedC \" or TargetProcessCommandLine contains \" -encoded \" or TargetProcessCommandLine contains \" -encode \" or TargetProcessCommandLine contains \" -encod \" or TargetProcessCommandLine contains \" -enco \" or TargetProcessCommandLine contains \" -en \" or TargetProcessCommandLine contains \" -executionpolic \" or TargetProcessCommandLine contains \" -executionpoli \" or TargetProcessCommandLine contains \" -executionpol \" or TargetProcessCommandLine contains \" -executionpo \" or TargetProcessCommandLine contains \" -executionp \" or TargetProcessCommandLine contains \" -execution bypass\" or TargetProcessCommandLine contains \" -executio bypass\" or TargetProcessCommandLine contains \" -executi bypass\" or TargetProcessCommandLine contains \" -execut bypass\" or TargetProcessCommandLine contains \" -execu bypass\" or TargetProcessCommandLine contains \" -exec bypass\" or TargetProcessCommandLine contains \" -exe bypass\" or TargetProcessCommandLine contains \" -ex bypass\" or TargetProcessCommandLine contains \" -ep bypass\" or TargetProcessCommandLine contains \" /windowstyle h \" or TargetProcessCommandLine contains \" /windowstyl h\" or TargetProcessCommandLine contains \" /windowsty h\" or TargetProcessCommandLine contains \" /windowst h\" or TargetProcessCommandLine contains \" /windows h\" or TargetProcessCommandLine contains \" /windo h\" or TargetProcessCommandLine contains \" /wind h\" or TargetProcessCommandLine contains \" /win h\" or TargetProcessCommandLine contains \" /wi h\" or TargetProcessCommandLine contains \" /win h \" or TargetProcessCommandLine contains \" /win hi \" or TargetProcessCommandLine contains \" /win hid \" or TargetProcessCommandLine contains \" /win hidd \" or TargetProcessCommandLine contains \" /win hidde \" or TargetProcessCommandLine contains \" /NoPr \" or TargetProcessCommandLine contains \" /NoPro \" or TargetProcessCommandLine contains \" /NoProf \" or TargetProcessCommandLine contains \" /NoProfi \" or TargetProcessCommandLine contains \" /NoProfil \" or TargetProcessCommandLine contains \" /nonin \" or TargetProcessCommandLine contains \" /nonint \" or TargetProcessCommandLine contains \" /noninte \" or TargetProcessCommandLine contains \" /noninter \" or TargetProcessCommandLine contains \" /nonintera \" or TargetProcessCommandLine contains \" /noninterac \" or TargetProcessCommandLine contains \" /noninteract \" or TargetProcessCommandLine contains \" /noninteracti \" or TargetProcessCommandLine contains \" /noninteractiv \" or TargetProcessCommandLine contains \" /ec \" or TargetProcessCommandLine contains \" /encodedComman \" or TargetProcessCommandLine contains \" /encodedComma \" or TargetProcessCommandLine contains \" /encodedComm \" or TargetProcessCommandLine contains \" /encodedCom \" or TargetProcessCommandLine contains \" /encodedCo \" or TargetProcessCommandLine contains \" /encodedC \" or TargetProcessCommandLine contains \" /encoded \" or TargetProcessCommandLine contains \" /encode \" or TargetProcessCommandLine contains \" /encod \" or TargetProcessCommandLine contains \" /enco \" or TargetProcessCommandLine contains \" /en \" or TargetProcessCommandLine contains \" /executionpolic \" or TargetProcessCommandLine contains \" /executionpoli \" or TargetProcessCommandLine contains \" /executionpol \" or TargetProcessCommandLine contains \" /executionpo \" or TargetProcessCommandLine contains \" /executionp \" or TargetProcessCommandLine contains \" /execution bypass\" or TargetProcessCommandLine contains \" /executio bypass\" or TargetProcessCommandLine contains \" /executi bypass\" or TargetProcessCommandLine contains \" /execut bypass\" or TargetProcessCommandLine contains \" /execu bypass\" or TargetProcessCommandLine contains \" /exec bypass\" or TargetProcessCommandLine contains \" /exe bypass\" or TargetProcessCommandLine contains \" /ex bypass\" or TargetProcessCommandLine contains \" /ep bypass\"))|extend RuleId=\"36210e0d-5b19-485d-a087-c096088885f0\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_susp_parameter_variation.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Persistence", "Collection", "DefenseEvasion", "CredentialAccess", "PrivilegeEscalation", "Impact", "Execution"],
                "techniques": ["T1490", "T1059", "T1543", "T1114", "T1003"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000217",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}