{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000112')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000112')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation low 12",
                "description": "Sigma Windows Process Creation low 12",
                "severity": "low",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\reg.exe\" or TargetProcessFilename =~ \"reg.exe\") and TargetProcessCommandLine contains \"\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\\\System\" and (TargetProcessCommandLine contains \"GroupPolicyRefreshTimeDC\" or TargetProcessCommandLine contains \"GroupPolicyRefreshTimeOffsetDC\" or TargetProcessCommandLine contains \"GroupPolicyRefreshTime\" or TargetProcessCommandLine contains \"GroupPolicyRefreshTimeOffset\" or TargetProcessCommandLine contains \"EnableSmartScreen\" or TargetProcessCommandLine contains \"ShellSmartScreenLevel\"))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000111\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_modify_group_policy_settings.yml\"|extend RuleTitle=\"Modify Group Policy Settings\"|extend RuleDescription=\"Detect malicious GPO modifications can be used to implement many other malicious behaviors.\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"reg\" and TargetProcessCommandLine contains \"add\" and TargetProcessCommandLine contains \"hkcu\\\\software\\\\classes\\\\ms-settings\\\\shell\\\\open\\\\command\" and TargetProcessCommandLine contains \"/ve \" and TargetProcessCommandLine contains \"/d\") or (TargetProcessCommandLine contains \"reg\" and TargetProcessCommandLine contains \"add\" and TargetProcessCommandLine contains \"hkcu\\\\software\\\\classes\\\\ms-settings\\\\shell\\\\open\\\\command\" and TargetProcessCommandLine contains \"/v\" and TargetProcessCommandLine contains \"DelegateExecute\") or (TargetProcessCommandLine contains \"reg\" and TargetProcessCommandLine contains \"delete\" and TargetProcessCommandLine contains \"hkcu\\\\software\\\\classes\\\\ms-settings\"))|extend RuleId=\"dd3ee8cc-f751-41c9-ba53-5a32ed47e563\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_open_command.yml\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\reg.exe\" or TargetProcessFilename =~ \"reg.exe\") and TargetProcessCommandLine contains \"query\" and (TargetProcessCommandLine contains \"currentVersion\\\\windows\" or TargetProcessCommandLine contains \"winlogon\\\\\" or TargetProcessCommandLine contains \"currentVersion\\\\shellServiceObjectDelayLoad\" or TargetProcessCommandLine contains \"currentVersion\\\\run\" or TargetProcessCommandLine contains \"currentVersion\\\\policies\\\\explorer\\\\run\" or TargetProcessCommandLine contains \"currentcontrolset\\\\services\"))|extend RuleId=\"970007b7-ce32-49d0-a4a4-fbef016950bd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_query_registry.yml\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\reg.exe\" and (TargetProcessCommandLine contains \"HKEY_CURRENT_USER\\\\Control Panel\\\\Desktop\" or TargetProcessCommandLine contains \"HKCU\\\\Control Panel\\\\Desktop\")) and ((TargetProcessCommandLine contains \"/v ScreenSaveActive\" and TargetProcessCommandLine contains \"/t REG_SZ\" and TargetProcessCommandLine contains \"/d 1\" and TargetProcessCommandLine contains \"/f\") or (TargetProcessCommandLine contains \"/v ScreenSaveTimeout\" and TargetProcessCommandLine contains \"/t REG_SZ\" and TargetProcessCommandLine contains \"/d \" and TargetProcessCommandLine contains \"/f\") or (TargetProcessCommandLine contains \"/v ScreenSaverIsSecure\" and TargetProcessCommandLine contains \"/t REG_SZ\" and TargetProcessCommandLine contains \"/d 0\" and TargetProcessCommandLine contains \"/f\") or (TargetProcessCommandLine contains \"/v SCRNSAVE.EXE\" and TargetProcessCommandLine contains \"/t REG_SZ\" and TargetProcessCommandLine contains \"/d \" and TargetProcessCommandLine contains \".scr\" and TargetProcessCommandLine contains \"/f\")))|extend RuleId=\"0fc35fc3-efe6-4898-8a37-0b233339524f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_screensaver.yml\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\reg.exe\" and (TargetProcessCommandLine contains \"add \" and TargetProcessCommandLine contains \"SYSTEM\\\\CurrentControlSet\\\\Services\\\\\" and TargetProcessCommandLine contains \" ImagePath \")) and (TargetProcessCommandLine contains \" /d \" or TargetProcessCommandLine contains \" -d \"))|extend RuleId=\"9b0b7ac3-6223-47aa-a3fd-e8f211e637db\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_service_imagepath_change.yml\";\nlet q5=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\reg.exe\" and (TargetProcessCommandLine contains \"query\" and TargetProcessCommandLine contains \"\\\\software\\\\\" and TargetProcessCommandLine contains \"/v\" and TargetProcessCommandLine contains \"svcversion\"))|extend RuleId=\"e13f668e-7f95-443d-98d2-1816a7648a7b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_software_discovery.yml\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"reg add\" and TargetProcessCommandLine contains \"\\\\system\\\\currentcontrolset\\\\control\" and TargetProcessCommandLine contains \"write protection\" and TargetProcessCommandLine contains \"0\") and (TargetProcessCommandLine contains \"storage\" or TargetProcessCommandLine contains \"storagedevicepolicies\"))|extend RuleId=\"75f7a0e2-7154-4c4d-9eae-5cdb4e0a5c13\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_write_protect_for_storage_disabled.yml\";\nlet q7=_Im_ProcessCreate\n| where (TargetProcessFileProduct =~ \"UltraViewer\" or TargetProcessFileCompany =~ \"DucFabulous Co,ltd\" or TargetProcessFilename =~ \"UltraViewer_Desktop.exe\")|extend RuleId=\"88656cec-6c3b-487c-82c0-f73ebb805503\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_remote_access_software_ultraviewer.yml\";\nlet q8=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\AnyDesk.exe\" or TargetProcessFileDescription =~ \"AnyDesk\" or TargetProcessFileProduct =~ \"AnyDesk\" or TargetProcessFileCompany =~ \"AnyDesk Software GmbH\")|extend RuleId=\"b52e84a3-029e-4529-b09b-71d19dd27e94\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_remote_access_tools_anydesk.yml\";\nlet q9=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"/c \" and TargetProcessCommandLine contains \"echo \" and TargetProcessCommandLine contains \".exe --set-password\")|extend RuleId=\"b1377339-fda6-477a-b455-ac0923f9ec2c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_remote_access_tools_anydesk_piped_password_via_cli.yml\";\nlet q10=_Im_ProcessCreate\n| where (TargetProcessFileDescription =~ \"GoTo Opener\" or TargetProcessFileProduct =~ \"GoTo Opener\" or TargetProcessFileCompany =~ \"LogMeIn, Inc.\")|extend RuleId=\"b6d98a4f-cef0-4abf-bbf6-24132854a83d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_remote_access_tools_gotoopener.yml\";\nlet q11=_Im_ProcessCreate\n| where (TargetProcessFileDescription =~ \"LMIGuardianSvc\" or TargetProcessFileProduct =~ \"LMIGuardianSvc\" or TargetProcessFileCompany =~ \"LogMeIn, Inc.\")|extend RuleId=\"d85873ef-a0f8-4c48-a53a-6b621f11729d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_remote_access_tools_logmein.yml\";\nlet q12=_Im_ProcessCreate\n| where (TargetProcessFileDescription =~ \"NetSupport Client Configurator\" or TargetProcessFileProduct =~ \"NetSupport Remote Control\" or TargetProcessFileCompany =~ \"NetSupport Ltd\" or TargetProcessFilename =~ \"PCICFGUI.EXE\")|extend RuleId=\"758ff488-18d5-4cbe-8ec4-02b6285a434f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_remote_access_tools_netsupport.yml\";\nlet q13=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\client32.exe\" or TargetProcessFileProduct contains \"NetSupport Remote Control\" or TargetProcessFilename contains \"client32.exe\" or TargetProcessIMPHASH =~ \"a9d50692e95b79723f3e76fcf70d023e\" or TargetProcessIMPHASH=~\"a9d50692e95b79723f3e76fcf70d023e\") and (not((TargetProcessName startswith \"C:\\\\Program Files\\\\\" or TargetProcessName startswith \"C:\\\\Program Files (x86)\\\\\"))))|extend RuleId=\"37e8d358-6408-4853-82f4-98333fca7014\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_remote_access_tools_netsupport_susp_exec.yml\";\nlet q14=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\rutserv.exe\" or TargetProcessName endswith \"\\\\rfusclient.exe\") or TargetProcessFileProduct =~ \"Remote Utilities\") and (not((TargetProcessName startswith \"C:\\\\Program Files\\\\Remote Utilities\" or TargetProcessName startswith \"C:\\\\Program Files (x86)\\\\Remote Utilities\"))))|extend RuleId=\"e01fa958-6893-41d4-ae03-182477c5e77d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_remote_access_tools_rurat_non_default_location.yml\";\nlet q15=_Im_ProcessCreate\n| where (TargetProcessFileDescription =~ \"ScreenConnect Service\" or TargetProcessFileProduct =~ \"ScreenConnect\" or TargetProcessFileCompany =~ \"ScreenConnect Software\")|extend RuleId=\"57bff678-25d1-4d6c-8211-8ca106d12053\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_remote_access_tools_screenconnect.yml\";\nlet q16=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\ScreenConnect.ClientService.exe\" and (TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessFilename =~ \"Cmd.Exe\") and TargetProcessCommandLine contains \"\\\\TEMP\\\\ScreenConnect\\\\\")|extend RuleId=\"b1f73849-6329-4069-bc8f-78a604bb8b23\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_remote_access_tools_screenconnect_remote_exec.yml\";\nlet q17=_Im_ProcessCreate\n| where ((TargetProcessFileProduct contains \"AutoHotkey\" or TargetProcessFileDescription contains \"AutoHotkey\" or (TargetProcessFilename =~ \"AutoHotkey.exe\" or TargetProcessFilename =~ \"AutoHotkey.rc\")) and (not(((TargetProcessName endswith \"\\\\AutoHotkey.exe\" or TargetProcessName endswith \"\\\\AutoHotkey32.exe\" or TargetProcessName endswith \"\\\\AutoHotkey32_UIA.exe\" or TargetProcessName endswith \"\\\\AutoHotkey64.exe\" or TargetProcessName endswith \"\\\\AutoHotkey64_UIA.exe\" or TargetProcessName endswith \"\\\\AutoHotkeyA32.exe\" or TargetProcessName endswith \"\\\\AutoHotkeyA32_UIA.exe\" or TargetProcessName endswith \"\\\\AutoHotkeyU32.exe\" or TargetProcessName endswith \"\\\\AutoHotkeyU32_UIA.exe\" or TargetProcessName endswith \"\\\\AutoHotkeyU64.exe\" or TargetProcessName endswith \"\\\\AutoHotkeyU64_UIA.exe\") or TargetProcessName contains \"\\\\AutoHotkey\"))))|extend RuleId=\"0f16d9cf-0616-45c8-8fad-becc11b5a41c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_autohotkey.yml\";\nlet q18=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"Cmd.Exe\" or TargetProcessFilename =~ \"CONHOST.EXE\" or TargetProcessFilename =~ \"7z.exe\" or TargetProcessFilename =~ \"WinRAR.exe\" or TargetProcessFilename =~ \"wevtutil.exe\" or TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\" or TargetProcessFilename =~ \"netsh.exe\" or TargetProcessFilename =~ \"InstallUtil.exe\") and (not((TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\conhost.exe\" or TargetProcessName endswith \"\\\\7z.exe\" or TargetProcessName endswith \"\\\\WinRAR.exe\" or TargetProcessName endswith \"\\\\wevtutil.exe\" or TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\" or TargetProcessName endswith \"\\\\netsh.exe\" or TargetProcessName endswith \"\\\\InstallUtil.exe\"))))|extend RuleId=\"36480ae1-a1cb-4eaa-a0d6-29801d7e9142\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_binary.yml\";\nlet q19=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"curl.exe\" or TargetProcessFileDescription =~ \"The curl executable\") and (not(TargetProcessName contains \"\\\\curl\")))|extend RuleId=\"7530cd3d-7671-43e3-b209-976966f6ea48\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_curl.yml\";\nlet q20=_Im_ProcessCreate\n| where (TargetProcessFilename =~ \"ftp.exe\" and (not(TargetProcessName endswith \"\\\\ftp.exe\")))|extend RuleId=\"277a4393-446c-449a-b0ed-7fdc7795244c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_ftp.yml\";\nlet q21=_Im_ProcessCreate\n| where (TargetProcessFilename =~ \"Microsoft.NodejsTools.PressAnyKey.exe\" and (not(TargetProcessName endswith \"\\\\Microsoft.NodejsTools.PressAnyKey.exe\")))|extend RuleId=\"65c3ca2c-525f-4ced-968e-246a713d164f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_pressanykey.yml\";\nlet q22=_Im_ProcessCreate\n| where (TargetProcessFileProduct =~ \"Remote Utilities\" and (not((TargetProcessName endswith \"\\\\rutserv.exe\" or TargetProcessName endswith \"\\\\rfusclient.exe\"))))|extend RuleId=\"9ef27c24-4903-4192-881a-3adde7ff92a5\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_rurat.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19, q20, q21, q22;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["PrivilegeEscalation", "CommandAndControl", "CredentialAccess", "DefenseEvasion", "Discovery", "Persistence", "Collection", "Execution"],
                "techniques": ["T1219", "T1218", "T1059", "T1036", "T1574", "T1484", "T1003", "T1202", "T1007", "T1012", "T1518", "T1546", "T1562"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000112",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}