{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000219')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000219')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 19",
                "description": "Sigma Windows Process Creation medium 19",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \".DownloadString(\" or TargetProcessCommandLine contains \".DownloadFile(\" or TargetProcessCommandLine contains \"Invoke-WebRequest \" or TargetProcessCommandLine contains \"iwr \") and (TargetProcessCommandLine contains \";iex $\" or TargetProcessCommandLine contains \"| IEX\" or TargetProcessCommandLine contains \"|IEX \" or TargetProcessCommandLine contains \"I`E`X\" or TargetProcessCommandLine contains \"I`EX\" or TargetProcessCommandLine contains \"IE`X\" or TargetProcessCommandLine contains \"iex \" or TargetProcessCommandLine contains \"IEX (\" or TargetProcessCommandLine contains \"IEX(\" or TargetProcessCommandLine contains \"Invoke-Expression\"))|extend RuleId=\"85b0b087-eddf-4a2b-b033-d771fa2b9775\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_download_iex.yml\"|extend RuleTitle=\"PowerShell Download and Execution Cradles\"|extend RuleDescription=\"Detects PowerShell download and execution cradles.\";\nlet q1=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and (TargetProcessCommandLine contains \"anonfiles.com\" or TargetProcessCommandLine contains \"cdn.discordapp.com\" or TargetProcessCommandLine contains \"cdn.discordapp.com/attachments/\" or TargetProcessCommandLine contains \"ddns.net\" or TargetProcessCommandLine contains \"dl.dropboxusercontent.com\" or TargetProcessCommandLine contains \"ghostbin.co\" or TargetProcessCommandLine contains \"glitch.me\" or TargetProcessCommandLine contains \"gofile.io\" or TargetProcessCommandLine contains \"hastebin.com\" or TargetProcessCommandLine contains \"mediafire.com\" or TargetProcessCommandLine contains \"mega.nz\" or TargetProcessCommandLine contains \"onrender.com\" or TargetProcessCommandLine contains \"paste.ee\" or TargetProcessCommandLine contains \"pastebin.com\" or TargetProcessCommandLine contains \"pastebin.pl\" or TargetProcessCommandLine contains \"pastetext.net\" or TargetProcessCommandLine contains \"privatlab.com\" or TargetProcessCommandLine contains \"privatlab.net\" or TargetProcessCommandLine contains \"send.exploit.in\" or TargetProcessCommandLine contains \"sendspace.com\" or TargetProcessCommandLine contains \"storage.googleapis.com\" or TargetProcessCommandLine contains \"storjshare.io\" or TargetProcessCommandLine contains \"supabase.co\" or TargetProcessCommandLine contains \"temp.sh\" or TargetProcessCommandLine contains \"transfer.sh\" or TargetProcessCommandLine contains \"ufile.io\") and (TargetProcessCommandLine contains \".DownloadString(\" or TargetProcessCommandLine contains \".DownloadFile(\" or TargetProcessCommandLine contains \"Invoke-WebRequest \" or TargetProcessCommandLine contains \"iwr \" or TargetProcessCommandLine contains \"wget \"))|extend RuleId=\"b6e04788-29e1-4557-bb14-77f761848ab8\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_download_susp_file_sharing_domains.yml\"|extend RuleTitle=\"Potentially Suspicious File Download From File Sharing Domain Via PowerShell.EXE\"|extend RuleDescription=\"Detects potentially suspicious file downloads from file sharing domains using PowerShell.exe\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") and (TargetProcessCommandLine contains \"Add-PSSnapin\" and TargetProcessCommandLine contains \"Get-Recipient\" and TargetProcessCommandLine contains \"-ExpandProperty\" and TargetProcessCommandLine contains \"EmailAddresses\" and TargetProcessCommandLine contains \"SmtpAddress\" and TargetProcessCommandLine contains \"-hidetableheaders\"))|extend RuleId=\"312d0384-401c-4b8b-abdf-685ffba9a332\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_email_exfil.yml\"|extend RuleTitle=\"Email Exifiltration Via Powershell\"|extend RuleDescription=\"Detects email exfiltration via powershell cmdlets\";\nlet q3=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"::FromBase64String(\"|extend RuleId=\"e32d4572-9826-4738-b651-95fa63747e8a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_frombase64string.yml\"|extend RuleTitle=\"Base64 Encoded PowerShell Command Detected\"|extend RuleDescription=\"Detects usage of the \\\"FromBase64String\\\" function in the commandline which is used to decode a base64 encoded string\";\nlet q4=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"Get-Process lsas\" or TargetProcessCommandLine contains \"ps lsas\" or TargetProcessCommandLine contains \"gps lsas\")|extend RuleId=\"b2815d0d-7481-4bf0-9b6c-a4c48a94b349\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_getprocess_lsass.yml\"|extend RuleTitle=\"PowerShell Get-Process LSASS\"|extend RuleDescription=\"Detects a \\\"Get-Process\\\" cmdlet and it's aliases on lsass process, which is in almost all cases a sign of malicious activity\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessFilename =~ \"pwsh.dll\") and (TargetProcessCommandLine contains \"Set-Service \" and TargetProcessCommandLine contains \"DCLCWPDTSD\") and (TargetProcessCommandLine contains \"-SecurityDescriptorSddl \" or TargetProcessCommandLine contains \"-sd \"))|extend RuleId=\"514e4c3a-c77d-4cde-a00f-046425e2301e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_hide_services_via_set_service.yml\"|extend RuleTitle=\"Abuse of Service Permissions to Hide Services Via Set-Service\"|extend RuleDescription=\"Detects usage of the \\\"Set-Service\\\" powershell cmdlet to configure a new SecurityDescriptor that allows a service to be hidden from other utilities such as \\\"sc.exe\\\", \\\"Get-Service\\\"...etc. (Works only in powershell 7)\";\nlet q6=_Im_ProcessCreate\n| where ((((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") and (TargetProcessCommandLine contains \" | iex;\" or TargetProcessCommandLine contains \" | iex \" or TargetProcessCommandLine contains \" | iex}\" or TargetProcessCommandLine contains \" | IEX ;\" or TargetProcessCommandLine contains \" | IEX -Error\" or TargetProcessCommandLine contains \" | IEX (new\" or TargetProcessCommandLine contains \");IEX \")) and (TargetProcessCommandLine contains \"::FromBase64String\" or TargetProcessCommandLine contains \".GetString([System.Convert]::\")) or (TargetProcessCommandLine contains \")|iex;$\" or TargetProcessCommandLine contains \");iex($\" or TargetProcessCommandLine contains \");iex $\" or TargetProcessCommandLine contains \" | IEX | \" or TargetProcessCommandLine contains \" | iex\\\\\\\"\"))|extend RuleId=\"09576804-7a05-458e-a817-eb718ca91f54\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_iex_patterns.yml\"|extend RuleTitle=\"Suspicious PowerShell IEX Execution Patterns\"|extend RuleDescription=\"Detects suspicious ways to run Invoke-Execution using IEX alias\";\nlet q7=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"Import-Certificate\" and TargetProcessCommandLine contains \" -FilePath \" and TargetProcessCommandLine contains \"Cert:\\\\LocalMachine\\\\Root\") and (TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\TEMP\\\\\" or TargetProcessCommandLine contains \"\\\\Desktop\\\\\" or TargetProcessCommandLine contains \"\\\\Downloads\\\\\" or TargetProcessCommandLine contains \"\\\\Perflogs\\\\\" or TargetProcessCommandLine contains \":\\\\Users\\\\Public\\\\\"))|extend RuleId=\"5f6a601c-2ecb-498b-9c33-660362323afa\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_import_cert_susp_locations.yml\"|extend RuleTitle=\"Root Certificate Installed From Susp Locations\"|extend RuleDescription=\"Adversaries may install a root certificate on a compromised system to avoid warnings when connecting to adversary controlled web servers.\";\nlet q8=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and (TargetProcessCommandLine contains \"curl \" or TargetProcessCommandLine contains \"Invoke-WebRequest\" or TargetProcessCommandLine contains \"iwr \" or TargetProcessCommandLine contains \"wget \") and (TargetProcessCommandLine contains \" -ur\" or TargetProcessCommandLine contains \" -o\") and (TargetProcessCommandLine contains \"\\\\AppData\\\\\" or TargetProcessCommandLine contains \"\\\\Desktop\\\\\" or TargetProcessCommandLine contains \"\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \"%AppData%\" or TargetProcessCommandLine contains \"%Public%\" or TargetProcessCommandLine contains \"%Temp%\" or TargetProcessCommandLine contains \"%tmp%\" or TargetProcessCommandLine contains \":\\\\Windows\\\\\"))|extend RuleId=\"5e3cc4d8-3e68-43db-8656-eaaeefdec9cc\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_invoke_webrequest_download.yml\"|extend RuleTitle=\"Suspicious Invoke-WebRequest Execution\"|extend RuleDescription=\"Detects a suspicious call to Invoke-WebRequest cmdlet where the and output is located in a suspicious location\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "CredentialAccess", "CommandAndControl", "Exfiltration", "Persistence", "PrivilegeEscalation", "Execution"],
                "techniques": ["T1553", "T1105", "T1552", "T1140", "T1574", "T1059", "T1027"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000219",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}