{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000233')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000233')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation high 33",
                "description": "Sigma Windows Process Creation medium 33",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\") and ActingProcessName endswith \"\\\\ieinstalexe\" and TargetProcessName contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" and TargetProcessName endswith \"consentexe\")|extend RuleId=\"5163A000-5160-5160-5160-5163A0000232\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_ieinstal.yml\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\") and ActingProcessName endswith \"\\\\AppData\\\\Local\\\\Temp\\\\pkgmgrexe\" and TargetProcessCommandLine =~ \"\\\"C:\\\\Windows\\\\system32\\\\msconfigexe\\\" -5\")|extend RuleId=\"ad92e3f9-7eb6-460e-96b1-582b0ccbb980\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_msconfig_gui.yml\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessCommandLine startswith \"\\\"C:\\\\Windows\\\\system32\\\\wusaexe\\\"  /quiet C:\\\\Users\\\\\" and TargetProcessCommandLine endswith \"\\\\AppData\\\\Local\\\\Temp\\\\updatemsu\" and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\")) or (ActingProcessCommandLine =~ \"\\\"C:\\\\Windows\\\\system32\\\\dismexe\\\" /online /quiet /norestart /add-package /packagepath:\\\"C:\\\\Windows\\\\system32\\\\pe386\\\" /ignorecheck\" and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\") and (TargetProcessCommandLine contains \"C:\\\\Users\\\\\" and TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" and TargetProcessCommandLine contains \"\\\\dismhostexe {\") and TargetProcessName endswith \"\\\\DismHostexe\"))|extend RuleId=\"39ed3c80-e6a1-431b-9df3-911ac53d08a7\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_ntfs_reparse_point.yml\";\nlet q3=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\pkgmgrexe\" and TargetProcessName endswith \"\\\\dismexe\" and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\"))|extend RuleId=\"a743ceba-c771-4d75-97eb-8a90f7f4844c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_pkgmgr_dism.yml\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\") and ActingProcessName endswith \"\\\\AppData\\\\Local\\\\Temp\\\\system32\\\\winsatexe\" and ActingProcessCommandLine contains \"C:\\\\Windows \\\\system32\\\\winsatexe\")|extend RuleId=\"7a01183d-71a2-46ad-ad5c-acd989ac1793\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_winsat.yml\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessName =~ \"C:\\\\Program Files\\\\Windows Media Player\\\\oskexe\" and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\")) or (TargetProcessName =~ \"C:\\\\Windows\\\\System32\\\\cmdexe\" and ActingProcessCommandLine =~ \"\\\"C:\\\\Windows\\\\system32\\\\mmcexe\\\" \\\"C:\\\\Windows\\\\system32\\\\eventvwrmsc\\\" /s\" and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\")))|extend RuleId=\"0058b9e5-bcd7-40d4-9205-95ca5a16d7b2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_wmp.yml\";\nlet q6=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\wsresetexe\" and (not((TargetProcessName endswith \"\\\\conhostexe\" or TargetProcessFilename =~ \"CONHOSTEXE\"))))|extend RuleId=\"d797268e-28a9-49a7-b9a8-2f5039011c5c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_wsreset.yml\";\nlet q7=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\wsresetexe\" and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\"))|extend RuleId=\"89a9a0e0-f61a-42e5-8957-b1479565a658\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_wsreset_integrity_level.yml\";\nlet q8=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"-autoreconnect \" and TargetProcessCommandLine contains \"-connect \" and TargetProcessCommandLine contains \"-id:\")|extend RuleId=\"871b9555-69ca-4993-99d3-35a59f9f3599\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_ultravnc_susp_execution.yml\";\nlet q9=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"\\\\WindowsSensorexe\" and TargetProcessCommandLine contains \" /uninstall\" and TargetProcessCommandLine contains \" /quiet\")|extend RuleId=\"f0f7be61-9cf5-43be-9836-99d6ef448a18\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uninstall_crowdstrike_falcon.yml\";\nlet q10=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\userinitexe\" and (not(TargetProcessName =~ \"C:\\\\WINDOWS\\\\explorerexe\")) and (not(((TargetProcessCommandLine contains \"netlogonbat\" or TargetProcessCommandLine contains \"UsrLogoncmd\") or TargetProcessCommandLine =~ \"PowerShellexe\" or (TargetProcessName =~ \"C:\\\\Windows\\\\System32\\\\proquotaexe\" or TargetProcessName =~ \"C:\\\\Windows\\\\SysWOW64\\\\proquotaexe\") or TargetProcessName endswith \"\\\\Citrix\\\\System32\\\\icastexe\" or isnull(TargetProcessName)))))|extend RuleId=\"0a98a10c-685d-4ab0-bddc-b6bdd1d48458\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_userinit_uncommon_child_processes.yml\";\nlet q11=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\VMwareToolBoxCmdexe\" or TargetProcessFilename =~ \"toolbox-cmdexe\") and (TargetProcessCommandLine contains \" script \" and TargetProcessCommandLine contains \" set \") and (TargetProcessCommandLine contains \":\\\\PerfLogs\\\\\" or TargetProcessCommandLine contains \":\\\\Temp\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\System32\\\\Tasks\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\Tasks\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\"))|extend RuleId=\"236d8e89-ed95-4789-a982-36f4643738ba\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_vmware_toolbox_cmd_persistence_susp.yml\";\nlet q12=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\vmtoolsdexe\" and ((TargetProcessName endswith \"\\\\cmdexe\" or TargetProcessName endswith \"\\\\cscriptexe\" or TargetProcessName endswith \"\\\\mshtaexe\" or TargetProcessName endswith \"\\\\powershellexe\" or TargetProcessName endswith \"\\\\pwshexe\" or TargetProcessName endswith \"\\\\regsvr32exe\" or TargetProcessName endswith \"\\\\rundll32exe\" or TargetProcessName endswith \"\\\\wscriptexe\") or (TargetProcessFilename =~ \"CmdExe\" or TargetProcessFilename =~ \"cscriptexe\" or TargetProcessFilename =~ \"MSHTAEXE\" or TargetProcessFilename =~ \"PowerShellEXE\" or TargetProcessFilename =~ \"pwshdll\" or TargetProcessFilename =~ \"REGSVR32EXE\" or TargetProcessFilename =~ \"RUNDLL32EXE\" or TargetProcessFilename =~ \"wscriptexe\"))) and (not(((TargetProcessName endswith \"\\\\cmdexe\" and (TargetProcessCommandLine contains \"\\\\VMware\\\\VMware Tools\\\\poweron-vm-defaultbat\" or TargetProcessCommandLine contains \"\\\\VMware\\\\VMware Tools\\\\poweroff-vm-defaultbat\" or TargetProcessCommandLine contains \"\\\\VMware\\\\VMware Tools\\\\resume-vm-defaultbat\" or TargetProcessCommandLine contains \"\\\\VMware\\\\VMware Tools\\\\suspend-vm-defaultbat\")) or (TargetProcessName endswith \"\\\\cmdexe\" and TargetProcessCommandLine =~ \"\") or (TargetProcessName endswith \"\\\\cmdexe\" and isnull(TargetProcessCommandLine))))))|extend RuleId=\"5687f942-867b-4578-ade7-1e341c46e99a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_vmware_vmtoolsd_susp_child_process.yml\";\nlet q13=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\w32tmexe\" or TargetProcessFilename =~ \"w32timedll\") and (TargetProcessCommandLine contains \"/stripchart\" and TargetProcessCommandLine contains \"/computer:\" and TargetProcessCommandLine contains \"/period:\" and TargetProcessCommandLine contains \"/dataonly\" and TargetProcessCommandLine contains \"/samples:\"))|extend RuleId=\"6da2c9f5-7c53-401b-aacb-92c040ce1215\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_w32tm.yml\";\nlet q14=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\wabexe\" or TargetProcessName endswith \"\\\\wabmigexe\") and (not((TargetProcessName startswith \"C:\\\\Windows\\\\WinSxS\\\\\" or TargetProcessName startswith \"C:\\\\Program Files\\\\Windows Mail\\\\\" or TargetProcessName startswith \"C:\\\\Program Files (x86)\\\\Windows Mail\\\\\"))))|extend RuleId=\"395907ee-96e5-4666-af2e-2ca91688e151\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wab_execution_from_non_default_location.yml\";\nlet q15=_Im_ProcessCreate\n| where (((ActingProcessName endswith \"\\\\WmiPrvSEexe\" or ActingProcessName endswith \"\\\\svchostexe\" or ActingProcessName endswith \"\\\\dllhostexe\") and (TargetProcessName endswith \"\\\\wabexe\" or TargetProcessName endswith \"\\\\wabmigexe\")) or (ActingProcessName endswith \"\\\\wabexe\" or ActingProcessName endswith \"\\\\wabmigexe\"))|extend RuleId=\"63d1ccc0-2a43-4f4b-9289-361b308991ff\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wab_unusual_parents.yml\";\nlet q16=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\wbadminexe\" or TargetProcessFilename =~ \"WBADMINEXE\") and (TargetProcessCommandLine contains \"delete \" and TargetProcessCommandLine contains \"systemstatebackup \" and TargetProcessCommandLine contains \"-keepVersions:0\"))|extend RuleId=\"89f75308-5b1b-4390-b2d8-d6b2340efaf8\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wbadmin_delete_systemstatebackup.yml\";\nlet q17=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\w3wpexe\" or ActingProcessName endswith \"\\\\w3wpexe\") and (TargetProcessCommandLine contains \"&ipconfig&echo\" or TargetProcessCommandLine contains \"&quser&echo\" or TargetProcessCommandLine contains \"&whoami&echo\" or TargetProcessCommandLine contains \"&c:&echo\" or TargetProcessCommandLine contains \"&cd&echo\" or TargetProcessCommandLine contains \"&dir&echo\" or TargetProcessCommandLine contains \"&echo [E]\" or TargetProcessCommandLine contains \"&echo [S]\"))|extend RuleId=\"fa3c117a-bc0d-416e-a31b-0c0e80653efb\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_webshell_chopper.yml\";\nlet q18=_Im_ProcessCreate\n| where (((ActingProcessName endswith \"\\\\w3wpexe\" or ActingProcessName endswith \"\\\\php-cgiexe\" or ActingProcessName endswith \"\\\\nginxexe\" or ActingProcessName endswith \"\\\\httpdexe\" or ActingProcessName endswith \"\\\\caddyexe\" or ActingProcessName endswith \"\\\\ws_tomcatserviceexe\") or ((ActingProcessName endswith \"\\\\javaexe\" or ActingProcessName endswith \"\\\\javawexe\") and (ActingProcessName contains \"-tomcat-\" or ActingProcessName contains \"\\\\tomcat\")) or ((ActingProcessName endswith \"\\\\javaexe\" or ActingProcessName endswith \"\\\\javawexe\") and (TargetProcessCommandLine contains \"catalinajar\" or TargetProcessCommandLine contains \"CATALINA_HOME\"))) and (((TargetProcessFilename =~ \"netexe\" or TargetProcessFilename =~ \"net1exe\") and (TargetProcessCommandLine contains \" user \" or TargetProcessCommandLine contains \" use \" or TargetProcessCommandLine contains \" group \")) or (TargetProcessFilename =~ \"pingexe\" and TargetProcessCommandLine contains \" -n \") or (TargetProcessCommandLine contains \"&cd&echo\" or TargetProcessCommandLine contains \"cd /d \") or (TargetProcessFilename =~ \"wmicexe\" and TargetProcessCommandLine contains \" /node:\") or ((TargetProcessName endswith \"\\\\whoamiexe\" or TargetProcessName endswith \"\\\\systeminfoexe\" or TargetProcessName endswith \"\\\\quserexe\" or TargetProcessName endswith \"\\\\ipconfigexe\" or TargetProcessName endswith \"\\\\pathpingexe\" or TargetProcessName endswith \"\\\\tracertexe\" or TargetProcessName endswith \"\\\\netstatexe\" or TargetProcessName endswith \"\\\\schtasksexe\" or TargetProcessName endswith \"\\\\vssadminexe\" or TargetProcessName endswith \"\\\\wevtutilexe\" or TargetProcessName endswith \"\\\\tasklistexe\") or (TargetProcessFilename =~ \"whoamiexe\" or TargetProcessFilename =~ \"sysinfoexe\" or TargetProcessFilename =~ \"quserexe\" or TargetProcessFilename =~ \"ipconfigexe\" or TargetProcessFilename =~ \"pathpingexe\" or TargetProcessFilename =~ \"tracertexe\" or TargetProcessFilename =~ \"netstatexe\" or TargetProcessFilename =~ \"schtasksexe\" or TargetProcessFilename =~ \"VSSADMINEXE\" or TargetProcessFilename =~ \"wevtutilexe\" or TargetProcessFilename =~ \"tasklistexe\")) or (TargetProcessCommandLine contains \" Test-NetConnection \" or TargetProcessCommandLine contains \"dir \\\\\")))|extend RuleId=\"bed2a484-9348-4143-8a8a-b801c979301c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_webshell_detection.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Impact", "DefenseEvasion", "Discovery", "Persistence", "Execution", "LateralMovement", "PrivilegeEscalation"],
                "techniques": ["T1505", "T1018", "T1490", "T1033", "T1037", "T1562", "T1548", "T1059", "T1021", "T1124", "T1087"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000233",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}