{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000211')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000211')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation high 11",
                "description": "Sigma Windows Process Creation medium 11",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") or (TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\")) and (TargetProcessCommandLine contains \" use \" and TargetProcessCommandLine contains \" http\"))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000210\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_use_mount_internet_share.yml\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\nltest.exe\" or TargetProcessFilename =~ \"nltestrk.exe\") and ((TargetProcessCommandLine contains \"/server\" and TargetProcessCommandLine contains \"/query\") or (TargetProcessCommandLine contains \"/dclist:\" or TargetProcessCommandLine contains \"/parentdomain\" or TargetProcessCommandLine contains \"/domain_trusts\" or TargetProcessCommandLine contains \"/all_trusts\" or TargetProcessCommandLine contains \"/trusted_domains\" or TargetProcessCommandLine contains \"/user\")))|extend RuleId=\"5cc90652-4cbd-4241-aa3b-4b462fa5a248\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_nltest_recon.yml\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\node.exe\" and (TargetProcessCommandLine contains \" -e \" or TargetProcessCommandLine contains \" --eval \")) and (TargetProcessCommandLine contains \".exec(\" and TargetProcessCommandLine contains \"net.socket\" and TargetProcessCommandLine contains \".connect\" and TargetProcessCommandLine contains \"child_process\"))|extend RuleId=\"6640f31c-01ad-49b5-beb5-83498a5cd8bd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_node_abuse.yml\";\nlet q3=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"nslookup\" and TargetProcessCommandLine contains \"_ldap._tcp.dc._msdcs.\")|extend RuleId=\"e6313acd-208c-44fc-a0ff-db85d572e90e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_nslookup_domain_discovery.yml\";\nlet q4=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\odbcconf.exe\" or TargetProcessFilename =~ \"odbcconf.exe\") and TargetProcessCommandLine contains \"INSTALLDRIVER \") and (not(TargetProcessCommandLine contains \".dll\")))|extend RuleId=\"cb0fe7c5-f3a3-484d-aa25-d350a7912729\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_odbcconf_driver_install_susp.yml\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\odbcconf.exe\" or TargetProcessFilename =~ \"odbcconf.exe\") and (TargetProcessCommandLine contains \":\\\\PerfLogs\\\\\" or TargetProcessCommandLine contains \":\\\\ProgramData\\\\\" or TargetProcessCommandLine contains \":\\\\Temp\\\\\" or TargetProcessCommandLine contains \":\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\Registration\\\\CRMLog\" or TargetProcessCommandLine contains \":\\\\Windows\\\\System32\\\\com\\\\dmp\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\System32\\\\FxsTmp\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\System32\\\\Microsoft\\\\Crypto\\\\RSA\\\\MachineKeys\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\color\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\System32\\\\spool\\\\PRINTERS\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\System32\\\\spool\\\\SERVERS\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\System32\\\\Tasks_Migrated\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\System32\\\\Tasks\\\\Microsoft\\\\Windows\\\\SyncCenter\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\SysWOW64\\\\com\\\\dmp\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\SysWOW64\\\\FxsTmp\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\SysWOW64\\\\Tasks\\\\Microsoft\\\\Windows\\\\PLA\\\\System\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\SysWOW64\\\\Tasks\\\\Microsoft\\\\Windows\\\\SyncCenter\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\Tasks\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\Temp\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\Tracing\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\\"))|extend RuleId=\"6b65c28e-11f3-46cb-902a-68f2cafaf474\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_odbcconf_exec_susp_locations.yml\";\nlet q6=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\odbcconf.exe\" or TargetProcessFilename =~ \"odbcconf.exe\") and TargetProcessCommandLine contains \"REGSVR \") and (not(TargetProcessCommandLine contains \".dll\")))|extend RuleId=\"ba4cfc11-d0fa-4d94-bf20-7c332c412e76\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_odbcconf_register_dll_regsvr_susp.yml\";\nlet q7=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\odbcconf.exe\" or TargetProcessFilename =~ \"odbcconf.exe\") and (TargetProcessCommandLine contains \" -f \" or TargetProcessCommandLine contains \" /f \")) and (not((TargetProcessCommandLine contains \".rsp\" or (ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\runonce.exe\" and TargetProcessName =~ \"C:\\\\Windows\\\\System32\\\\odbcconf.exe\" and TargetProcessCommandLine contains \".exe /E /F \\\"C:\\\\WINDOWS\\\\system32\\\\odbcconf.tmp\\\"\")))))|extend RuleId=\"2d32dd6f-3196-4093-b9eb-1ad8ab088ca5\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_odbcconf_response_file_susp.yml\";\nlet q8=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\EXCEL.EXE\" or TargetProcessName endswith \"\\\\POWERPNT.EXE\" or TargetProcessName endswith \"\\\\WINWORD.exe\") or (TargetProcessFilename =~ \"Excel.exe\" or TargetProcessFilename =~ \"POWERPNT.EXE\" or TargetProcessFilename =~ \"WinWord.exe\")) and (TargetProcessCommandLine contains \"http://\" or TargetProcessCommandLine contains \"https://\"))|extend RuleId=\"4ae3e30b-b03f-43aa-87e3-b622f4048eed\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_office_arbitrary_cli_download.yml\";\nlet q9=_Im_ProcessCreate\n| where (((ActingProcessName endswith \"\\\\explorer.exe\" or ActingProcessName endswith \"\\\\dopus.exe\") and ((TargetProcessName endswith \"\\\\EXCEL.EXE\" or TargetProcessName endswith \"\\\\POWERPNT.EXE\" or TargetProcessName endswith \"\\\\WINWORD.exe\") or (TargetProcessFilename =~ \"Excel.exe\" or TargetProcessFilename =~ \"POWERPNT.EXE\" or TargetProcessFilename =~ \"WinWord.exe\")) and (TargetProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\Microsoft\\\\Templates\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\Microsoft\\\\Word\\\\Startup\\\\\" or TargetProcessCommandLine contains \"\\\\Microsoft Office\\\\root\\\\Templates\\\\\" or TargetProcessCommandLine contains \"\\\\Microsoft Office\\\\Templates\\\\\")) and (not((TargetProcessCommandLine endswith \".dotx\" or TargetProcessCommandLine endswith \".xltx\" or TargetProcessCommandLine endswith \".potx\"))))|extend RuleId=\"f99abdf0-6283-4e71-bd2b-b5c048a94743\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_office_exec_from_trusted_locations.yml\";\nlet q10=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\onenote.exe\" and (((TargetProcessFilename =~ \"bitsadmin.exe\" or TargetProcessFilename =~ \"CertOC.exe\" or TargetProcessFilename =~ \"CertUtil.exe\" or TargetProcessFilename =~ \"Cmd.Exe\" or TargetProcessFilename =~ \"CMSTP.EXE\" or TargetProcessFilename =~ \"cscript.exe\" or TargetProcessFilename =~ \"curl.exe\" or TargetProcessFilename =~ \"HH.exe\" or TargetProcessFilename =~ \"IEExec.exe\" or TargetProcessFilename =~ \"InstallUtil.exe\" or TargetProcessFilename =~ \"javaw.exe\" or TargetProcessFilename =~ \"Microsoft.Workflow.Compiler.exe\" or TargetProcessFilename =~ \"msdt.exe\" or TargetProcessFilename =~ \"MSHTA.EXE\" or TargetProcessFilename =~ \"msiexec.exe\" or TargetProcessFilename =~ \"Msxsl.exe\" or TargetProcessFilename =~ \"odbcconf.exe\" or TargetProcessFilename =~ \"pcalua.exe\" or TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"RegAsm.exe\" or TargetProcessFilename =~ \"RegSvcs.exe\" or TargetProcessFilename =~ \"REGSVR32.exe\" or TargetProcessFilename =~ \"RUNDLL32.exe\" or TargetProcessFilename =~ \"schtasks.exe\" or TargetProcessFilename =~ \"ScriptRunner.exe\" or TargetProcessFilename =~ \"wmic.exe\" or TargetProcessFilename =~ \"WorkFolders.exe\" or TargetProcessFilename =~ \"wscript.exe\") or (TargetProcessName endswith \"\\\\AppVLP.exe\" or TargetProcessName endswith \"\\\\bash.exe\" or TargetProcessName endswith \"\\\\bitsadmin.exe\" or TargetProcessName endswith \"\\\\certoc.exe\" or TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\cmstp.exe\" or TargetProcessName endswith \"\\\\control.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\curl.exe\" or TargetProcessName endswith \"\\\\forfiles.exe\" or TargetProcessName endswith \"\\\\hh.exe\" or TargetProcessName endswith \"\\\\ieexec.exe\" or TargetProcessName endswith \"\\\\installutil.exe\" or TargetProcessName endswith \"\\\\javaw.exe\" or TargetProcessName endswith \"\\\\mftrace.exe\" or TargetProcessName endswith \"\\\\Microsoft.Workflow.Compiler.exe\" or TargetProcessName endswith \"\\\\msbuild.exe\" or TargetProcessName endswith \"\\\\msdt.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\msidb.exe\" or TargetProcessName endswith \"\\\\msiexec.exe\" or TargetProcessName endswith \"\\\\msxsl.exe\" or TargetProcessName endswith \"\\\\odbcconf.exe\" or TargetProcessName endswith \"\\\\pcalua.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\regasm.exe\" or TargetProcessName endswith \"\\\\regsvcs.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessName endswith \"\\\\scrcons.exe\" or TargetProcessName endswith \"\\\\scriptrunner.exe\" or TargetProcessName endswith \"\\\\sh.exe\" or TargetProcessName endswith \"\\\\svchost.exe\" or TargetProcessName endswith \"\\\\verclsid.exe\" or TargetProcessName endswith \"\\\\wmic.exe\" or TargetProcessName endswith \"\\\\workfolders.exe\" or TargetProcessName endswith \"\\\\wscript.exe\")) or (TargetProcessName endswith \"\\\\explorer.exe\" and (TargetProcessCommandLine contains \".hta\" or TargetProcessCommandLine contains \".vb\" or TargetProcessCommandLine contains \".wsh\" or TargetProcessCommandLine contains \".js\" or TargetProcessCommandLine contains \".ps\" or TargetProcessCommandLine contains \".scr\" or TargetProcessCommandLine contains \".pif\" or TargetProcessCommandLine contains \".bat\" or TargetProcessCommandLine contains \".cmd\")) or (TargetProcessName contains \"\\\\AppData\\\\\" or TargetProcessName contains \"\\\\Users\\\\Public\\\\\" or TargetProcessName contains \"\\\\ProgramData\\\\\" or TargetProcessName contains \"\\\\Windows\\\\Tasks\\\\\" or TargetProcessName contains \"\\\\Windows\\\\Temp\\\\\" or TargetProcessName contains \"\\\\Windows\\\\System32\\\\Tasks\\\\\")) and (not(((TargetProcessName endswith \"\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\current\\\\Teams.exe\" and TargetProcessCommandLine endswith \"-Embedding\") or (TargetProcessName contains \"\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\\" and TargetProcessName endswith \"\\\\FileCoAuth.exe\" and TargetProcessCommandLine endswith \"-Embedding\")))))|extend RuleId=\"c27515df-97a9-4162-8a60-dc0eeb51b775\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_office_onenote_susp_child_processes.yml\";\nlet q11=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"\\\\Outlook\\\\Security\\\\EnableUnsafeClientMailRules\"|extend RuleId=\"55f0a3a1-846e-40eb-8273-677371b8d912\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_office_outlook_enable_unsafe_client_mail_rules.yml\";\nlet q12=_Im_ProcessCreate\n| where TargetProcessName contains \"\\\\Temporary Internet Files\\\\Content.Outlook\\\\\"|extend RuleId=\"a018fdc3-46a3-44e5-9afb-2cd4af1d4b39\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_office_outlook_execution_from_temp.yml\";\nlet q13=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\OUTLOOK.EXE\" and (TargetProcessName endswith \"\\\\AppVLP.exe\" or TargetProcessName endswith \"\\\\bash.exe\" or TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\forfiles.exe\" or TargetProcessName endswith \"\\\\hh.exe\" or TargetProcessName endswith \"\\\\mftrace.exe\" or TargetProcessName endswith \"\\\\msbuild.exe\" or TargetProcessName endswith \"\\\\msdt.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\msiexec.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessName endswith \"\\\\scrcons.exe\" or TargetProcessName endswith \"\\\\scriptrunner.exe\" or TargetProcessName endswith \"\\\\sh.exe\" or TargetProcessName endswith \"\\\\svchost.exe\" or TargetProcessName endswith \"\\\\wmic.exe\" or TargetProcessName endswith \"\\\\wscript.exe\"))|extend RuleId=\"208748f7-881d-47ac-a29c-07ea84bf691d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_office_outlook_susp_child_processes.yml\";\nlet q14=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\outlook.exe\" and TargetProcessName startswith \"\\\\\\\\\")|extend RuleId=\"e212d415-0e93-435f-9e1a-f29005bb4723\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_office_outlook_susp_child_processes_remote.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["LateralMovement", "Execution", "InitialAccess", "Discovery", "DefenseEvasion"],
                "techniques": ["T1218", "T1482", "T1204", "T1021", "T1127", "T1202", "T1082", "T1087", "T1059", "T1566", "T1016"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000211",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}