{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-4c76-45a9-804d-dc3f355f2033')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-4c76-45a9-804d-dc3f355f2033')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation high 033",
                "description": "Sigma Windows Process Creation high 033",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"\\\\Microsoft\\\\Teams\\\\Cookies\" or TargetProcessCommandLine contains \"\\\\Microsoft\\\\Teams\\\\Local Storage\\\\leveldb\") and (not(TargetProcessName endswith \"\\\\Microsoft\\\\Teams\\\\current\\\\Teams.exe\")))|extend RuleId=\"d2eb17db-1d39-41dc-b57f-301f6512fa75\";\nlet q1=_Im_ProcessCreate\n| where ((TargetUsername contains \"AUTHORI\" or TargetUsername contains \"AUTORI\") and TargetProcessName endswith \"\\\\tscon.exe\")|extend RuleId=\"9847f263-4a81-424f-970c-875dab15b79b\";\nlet q2=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \" /dest:rdp-tcp#\"|extend RuleId=\"f72aa3e8-49f9-4c7d-bd74-f8ab84ff9bbb\";\nlet q3=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\changepk.exe\" and ActingProcessName endswith \"\\\\slui.exe\" and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\"))|extend RuleId=\"503d581c-7df0-4bbe-b9be-5840c0ecc1fc\";\nlet q4=_Im_ProcessCreate\n| where (TargetProcessCommandLine endswith \"\\\"\\\\system32\\\\cleanmgr.exe /autoclean /d C:\" and ActingProcessCommandLine =~ \"C:\\\\Windows\\\\system32\\\\svchost.exe -k netsvcs -p -s Schedule\" and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\"))|extend RuleId=\"b697e69c-746f-4a86-9f59-7bfff8eab881\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\cmstp.exe\" or TargetProcessFilename =~ \"CMSTP.EXE\") and (TargetProcessCommandLine contains \"/s\" or TargetProcessCommandLine contains \"-s\" or TargetProcessCommandLine contains \"/au\" or TargetProcessCommandLine contains \"-au\" or TargetProcessCommandLine contains \"/ni\" or TargetProcessCommandLine contains \"-ni\"))|extend RuleId=\"e66779cc-383e-4224-a3a4-267eeb585c40\";\nlet q6=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\DllHost.exe\" and (ActingProcessCommandLine contains \" /Processid:{3E5FC7F9-9A51-4367-9063-A120244FBEC7}\" or ActingProcessCommandLine contains \" /Processid:{3E000D72-A845-4CD9-BD83-80C07C3B881F}\" or ActingProcessCommandLine contains \" /Processid:{BD54C901-076B-434E-B6C7-17C531F4AB41}\" or ActingProcessCommandLine contains \" /Processid:{D2E7041B-2927-42FB-8E9F-7CE93B6DC937}\" or ActingProcessCommandLine contains \" /Processid:{E9495B87-D950-4AB5-87A5-FF6D70BF3E90}\") and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\"))|extend RuleId=\"4b60e6f2-bf39-47b4-b4ea-398e33cfe253\";\nlet q7=_Im_ProcessCreate\n| where (((TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\") and TargetProcessName =~ \"C:\\\\Windows\\\\System32\\\\ComputerDefaults.exe\") and (not((ActingProcessName contains \":\\\\Windows\\\\System32\" or ActingProcessName contains \":\\\\Program Files\"))))|extend RuleId=\"3c05e90d-7eba-4324-9972-5d7f711a60a8\";\nlet q8=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\consent.exe\" and TargetProcessName endswith \"\\\\werfault.exe\" and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\"))|extend RuleId=\"1ca6bd18-0ba0-44ca-851c-92ed89a61085\";\nlet q9=_Im_ProcessCreate\n| where ((ActingProcessName contains \"C:\\\\Users\\\\\" and ActingProcessName contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" and ActingProcessName contains \"\\\\DismHost.exe\") and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\"))|extend RuleId=\"853e74f9-9392-4935-ad3b-2e8c040dae86\";\nlet q10=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\eventvwr.exe\" and (not((TargetProcessName endswith \"\\\\mmc.exe\" or TargetProcessName endswith \":\\\\Windows\\\\SysWOW64\\\\WerFault.exe\" or TargetProcessName endswith \":\\\\Windows\\\\System32\\\\WerFault.exe\"))))|extend RuleId=\"be344333-921d-4c4d-8bb8-e584cf584780\";\nlet q11=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"\\\\Event Viewer\\\\RecentViews\" or TargetProcessCommandLine contains \"\\\\EventV~1\\\\RecentViews\") and TargetProcessCommandLine contains \">\")|extend RuleId=\"30fc8de7-d833-40c4-96b6-28319fbc4f6c\";\nlet q12=_Im_ProcessCreate\n| where ActingProcessName endswith \"\\\\fodhelper.exe\"|extend RuleId=\"7f741dcf-fc22-4759-87b4-9ae8376676a2\";\nlet q13=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\dllhost.exe\" and (ActingProcessCommandLine contains \"/Processid:{3E5FC7F9-9A51-4367-9063-A120244FBEC7}\" or ActingProcessCommandLine contains \"/Processid:{D2E7041B-2927-42FB-8E9F-7CE93B6DC937}\")) and (not((TargetProcessName endswith \"\\\\WerFault.exe\" or TargetProcessFilename =~ \"WerFault.exe\"))))|extend RuleId=\"49f2f17b-b4c8-4172-a68b-d5bf95d05130\";\nlet q14=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\DllHost.exe\" and ActingProcessCommandLine contains \" /Processid:{12C21EA7-2EB8-4B55-9249-AC243DA8C666}\" and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\"))|extend RuleId=\"4cbef972-f347-4170-b62a-8253f6168e6d\";\nlet q15=_Im_ProcessCreate\n| where ((TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\") and ActingProcessName endswith \"\\\\ieinstal.exe\" and TargetProcessName contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" and TargetProcessName endswith \"consent.exe\")|extend RuleId=\"80fc36aa-945e-4181-89f2-2f907ab6775d\";\nlet q16=_Im_ProcessCreate\n| where ((TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\") and ActingProcessName endswith \"\\\\AppData\\\\Local\\\\Temp\\\\pkgmgr.exe\" and TargetProcessCommandLine =~ \"\\\"C:\\\\Windows\\\\system32\\\\msconfig.exe\\\" -5\")|extend RuleId=\"ad92e3f9-7eb6-460e-96b1-582b0ccbb980\";\nlet q17=_Im_ProcessCreate\n| where ((TargetProcessCommandLine startswith \"\\\"C:\\\\Windows\\\\system32\\\\wusa.exe\\\"  /quiet C:\\\\Users\\\\\" and TargetProcessCommandLine endswith \"\\\\AppData\\\\Local\\\\Temp\\\\update.msu\" and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\")) or (ActingProcessCommandLine =~ \"\\\"C:\\\\Windows\\\\system32\\\\dism.exe\\\" /online /quiet /norestart /add-package /packagepath:\\\"C:\\\\Windows\\\\system32\\\\pe386\\\" /ignorecheck\" and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\") and (TargetProcessCommandLine contains \"C:\\\\Users\\\\\" and TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" and TargetProcessCommandLine contains \"\\\\dismhost.exe {\") and TargetProcessName endswith \"\\\\DismHost.exe\"))|extend RuleId=\"39ed3c80-e6a1-431b-9df3-911ac53d08a7\";\nlet q18=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\pkgmgr.exe\" and TargetProcessName endswith \"\\\\dism.exe\" and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\"))|extend RuleId=\"a743ceba-c771-4d75-97eb-8a90f7f4844c\";\nlet q19=_Im_ProcessCreate\n| where ((TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\") and ActingProcessName endswith \"\\\\AppData\\\\Local\\\\Temp\\\\system32\\\\winsat.exe\" and ActingProcessCommandLine contains \"C:\\\\Windows \\\\system32\\\\winsat.exe\")|extend RuleId=\"7a01183d-71a2-46ad-ad5c-acd989ac1793\";\nlet q20=_Im_ProcessCreate\n| where ((TargetProcessName =~ \"C:\\\\Program Files\\\\Windows Media Player\\\\osk.exe\" and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\")) or (TargetProcessName =~ \"C:\\\\Windows\\\\System32\\\\cmd.exe\" and ActingProcessCommandLine =~ \"\\\"C:\\\\Windows\\\\system32\\\\mmc.exe\\\" \\\"C:\\\\Windows\\\\system32\\\\eventvwr.msc\\\" /s\" and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\")))|extend RuleId=\"0058b9e5-bcd7-40d4-9205-95ca5a16d7b2\";\nlet q21=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\wsreset.exe\" and (not((TargetProcessName endswith \"\\\\conhost.exe\" or TargetProcessFilename =~ \"CONHOST.EXE\"))))|extend RuleId=\"d797268e-28a9-49a7-b9a8-2f5039011c5c\";\nlet q22=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\wsreset.exe\" and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\"))|extend RuleId=\"89a9a0e0-f61a-42e5-8957-b1479565a658\";\nlet q23=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"-autoreconnect \" and TargetProcessCommandLine contains \"-connect \" and TargetProcessCommandLine contains \"-id:\")|extend RuleId=\"871b9555-69ca-4993-99d3-35a59f9f3599\";\nlet q24=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"\\\\WindowsSensor.exe\" and TargetProcessCommandLine contains \" /uninstall\" and TargetProcessCommandLine contains \" /quiet\")|extend RuleId=\"f0f7be61-9cf5-43be-9836-99d6ef448a18\";\nlet q25=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\userinit.exe\" and (not(TargetProcessName =~ \"C:\\\\WINDOWS\\\\explorer.exe\")) and (not(((TargetProcessCommandLine contains \"netlogon.bat\" or TargetProcessCommandLine contains \"UsrLogon.cmd\") or TargetProcessCommandLine =~ \"PowerShell.exe\" or (TargetProcessName =~ \"C:\\\\Windows\\\\System32\\\\proquota.exe\" or TargetProcessName =~ \"C:\\\\Windows\\\\SysWOW64\\\\proquota.exe\") or TargetProcessName endswith \"\\\\Citrix\\\\System32\\\\icast.exe\" or isnull(TargetProcessName)))))|extend RuleId=\"0a98a10c-685d-4ab0-bddc-b6bdd1d48458\";\nlet q26=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\VMwareToolBoxCmd.exe\" or TargetProcessFilename =~ \"toolbox-cmd.exe\") and (TargetProcessCommandLine contains \" script \" and TargetProcessCommandLine contains \" set \") and (TargetProcessCommandLine contains \":\\\\PerfLogs\\\\\" or TargetProcessCommandLine contains \":\\\\Temp\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\System32\\\\Tasks\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\Tasks\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\"))|extend RuleId=\"236d8e89-ed95-4789-a982-36f4643738ba\";\nlet q27=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\vmtoolsd.exe\" and ((TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\wscript.exe\") or (TargetProcessFilename =~ \"Cmd.Exe\" or TargetProcessFilename =~ \"cscript.exe\" or TargetProcessFilename =~ \"MSHTA.EXE\" or TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\" or TargetProcessFilename =~ \"REGSVR32.EXE\" or TargetProcessFilename =~ \"RUNDLL32.EXE\" or TargetProcessFilename =~ \"wscript.exe\"))) and (not(((TargetProcessName endswith \"\\\\cmd.exe\" and (TargetProcessCommandLine contains \"\\\\VMware\\\\VMware Tools\\\\poweron-vm-default.bat\" or TargetProcessCommandLine contains \"\\\\VMware\\\\VMware Tools\\\\poweroff-vm-default.bat\" or TargetProcessCommandLine contains \"\\\\VMware\\\\VMware Tools\\\\resume-vm-default.bat\" or TargetProcessCommandLine contains \"\\\\VMware\\\\VMware Tools\\\\suspend-vm-default.bat\")) or (TargetProcessName endswith \"\\\\cmd.exe\" and TargetProcessCommandLine =~ \"\") or (TargetProcessName endswith \"\\\\cmd.exe\" and isnull(TargetProcessCommandLine))))))|extend RuleId=\"5687f942-867b-4578-ade7-1e341c46e99a\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19, q20, q21, q22, q23, q24, q25, q26, q27;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["PrivilegeEscalation", "LateralMovement", "DefenseEvasion", "CommandAndControl", "CredentialAccess", "Persistence", "Execution"],
                "techniques": ["T1218", "T1563", "T1562", "T1548", "T1059", "T1021", "T1219", "T1528", "T1037"],
                "alertRuleTemplateName": "5163A000-4c76-45a9-804d-dc3f355f2033",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}