{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000106')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000106')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 06",
                "description": "Sigma Windows Process Creation low 06",
                "severity": "low",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ActingProcessName endswith \"\\\\runexehelperexe\"|extend RuleId=\"5163A000-5160-5160-5160-5163A0000105\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_runexehelper.yml\";\nlet q1=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\Runscripthelperexe\" and TargetProcessCommandLine contains \"surfacecheck\")|extend RuleId=\"eca49c87-8a75-4f13-9c73-a5a29e845f03\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_runscripthelper.yml\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\ScriptRunnerexe\" or TargetProcessFilename =~ \"ScriptRunnerexe\") and TargetProcessCommandLine contains \" -appvscript \")|extend RuleId=\"64760eef-87f7-4ed3-93fd-655668ea9420\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_scriptrunner.yml\";\nlet q3=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\setresexe\" and TargetProcessName endswith \"\\\\choice\")|extend RuleId=\"835e75bf-4bfd-47a4-b8a6-b766cac8bcb7\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_setres.yml\";\nlet q4=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\sftpexe\" and (TargetProcessCommandLine contains \" -D \" or TargetProcessCommandLine contains \" -D C:\\\\\"))|extend RuleId=\"a85ffc3a-e8fd-4040-93bf-78aff284d801\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_sftp.yml\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\linkexe\" and TargetProcessCommandLine contains \"LINK /\") and (not(((ActingProcessName startswith \"C:\\\\Program Files\\\\Microsoft Visual Studio\\\\\" or ActingProcessName startswith \"C:\\\\Program Files (x86)\\\\Microsoft Visual Studio\\\\\") and ActingProcessName contains \"\\\\VC\\\\Tools\\\\MSVC\\\\\"))))|extend RuleId=\"6e968eb1-5f05-4dac-94e9-fd0c5cb49fd6\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_sideload_link_binary.yml\";\nlet q6=_Im_ProcessCreate\n| where ActingProcessName endswith \"\\\\sigverifexe\"|extend RuleId=\"7d4aaec2-08ed-4430-8b96-28420e030e04\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_sigverif.yml\";\nlet q7=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\squirrelexe\" or TargetProcessName endswith \"\\\\updateexe\") and (((TargetProcessCommandLine contains \" --download \" or TargetProcessCommandLine contains \" --update \" or TargetProcessCommandLine contains \" --updateRollback=\") and TargetProcessCommandLine contains \"http\") or (TargetProcessCommandLine contains \"--processStart\" or TargetProcessCommandLine contains \"--processStartAndWait\" or TargetProcessCommandLine contains \"--createShortcut\")) and (not(((TargetProcessCommandLine contains \"C:\\\\Users\\\\\" and TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Discord\\\\Updateexe\" and TargetProcessCommandLine contains \" --processStart\" and TargetProcessCommandLine contains \"Discordexe\") or ((TargetProcessCommandLine contains \"C:\\\\Users\\\\\" and TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\GitHubDesktop\\\\Updateexe\" and TargetProcessCommandLine contains \"GitHubDesktopexe\") and (TargetProcessCommandLine contains \"--createShortcut\" or TargetProcessCommandLine contains \"--processStartAndWait\")) or ((TargetProcessCommandLine contains \"C:\\\\Users\\\\\" and TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\Updateexe\" and TargetProcessCommandLine contains \"Teamsexe\") and (TargetProcessCommandLine contains \"--processStart\" or TargetProcessCommandLine contains \"--createShortcut\")) or ((TargetProcessCommandLine contains \"C:\\\\Users\\\\\" and TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\yammerdesktop\\\\Updateexe\" and TargetProcessCommandLine contains \"Yammerexe\") and (TargetProcessCommandLine contains \"--processStart\" or TargetProcessCommandLine contains \"--createShortcut\"))))))|extend RuleId=\"45239e6a-b035-4aaf-b339-8ad379fcb67e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_squirrel.yml\";\nlet q8=_Im_ProcessCreate\n| where (ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\OpenSSH\\\\sshdexe\" or (TargetProcessName endswith \"\\\\sshexe\" and (TargetProcessCommandLine contains \"ProxyCommand=\" or (TargetProcessCommandLine contains \"PermitLocalCommand\" and TargetProcessCommandLine contains \"LocalCommand\"))))|extend RuleId=\"7d6d30b8-5b91-4b90-a891-46cccaf29598\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_ssh.yml\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"-i\" or TargetProcessCommandLine contains \"/install\" or TargetProcessCommandLine contains \"-a\" or TargetProcessCommandLine contains \"/add-driver\" or TargetProcessCommandLine contains \"inf\") and TargetProcessName endswith \"\\\\pnputilexe\")|extend RuleId=\"a2ea3ae7-d3d0-40a0-a55c-25a45c87cac1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_susp_driver_installed_by_pnputil.yml\";\nlet q10=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\DXCapexe\" or TargetProcessFilename =~ \"DXCapexe\") and TargetProcessCommandLine contains \" -c \")|extend RuleId=\"60f16a96-db70-42eb-8f76-16763e333590\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_susp_dxcap.yml\";\nlet q11=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\sqldumperexe\" and (TargetProcessCommandLine contains \"0x0110\" or TargetProcessCommandLine contains \"0x01100:40\"))|extend RuleId=\"23ceaf5c-b6f1-4a32-8559-f2ff734be516\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_susp_sqldumper_activity.yml\";\nlet q12=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\SyncAppvPublishingServerexe\" or TargetProcessFilename =~ \"syncappvpublishingserverexe\") and TargetProcessCommandLine contains \"\\\"n; \")|extend RuleId=\"fbd7c32d-db2a-4418-b92c-566eb8911133\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_syncappvpublishingserver_execute_psh.yml\";\nlet q13=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"\\\\SyncAppvPublishingServervbs\" and TargetProcessCommandLine contains \";\")|extend RuleId=\"36475a7d-0f6d-4dce-9b01-6aeb473bbaf1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_syncappvpublishingserver_vbs_execute_psh.yml\";\nlet q14=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\trackerexe\" or TargetProcessFileDescription =~ \"Tracker\") and (TargetProcessCommandLine contains \" /d \" or TargetProcessCommandLine contains \" /c \")) and (not((TargetProcessCommandLine contains \" /ERRORREPORT:PROMPT \" or (ActingProcessName endswith \"\\\\Msbuild\\\\Current\\\\Bin\\\\MSBuildexe\" or ActingProcessName endswith \"\\\\Msbuild\\\\Current\\\\Bin\\\\amd64\\\\MSBuildexe\")))))|extend RuleId=\"148431ce-4b70-403d-8525-fcc2993f29ea\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_tracker.yml\";\nlet q15=_Im_ProcessCreate\n| where (TargetProcessName endswith \"ttdinjectexe\" or TargetProcessFilename =~ \"TTDInjectEXE\")|extend RuleId=\"b27077d6-23e6-45d2-81a0-e2b356eea5fd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_ttdinject.yml\";\nlet q16=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"type \" and TargetProcessCommandLine contains \" > \\\\\\\\\") or (TargetProcessCommandLine contains \"type \\\\\\\\\" and TargetProcessCommandLine contains \" > \"))|extend RuleId=\"aa0b3a82-eacc-4ec3-9150-b5a9a3e3f82f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_type.yml\";\nlet q17=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\unregmp2exe\" or TargetProcessFilename =~ \"unregmp2exe\") and TargetProcessCommandLine contains \" /HideWMP\")|extend RuleId=\"727454c0-d851-48b0-8b89-385611ab0704\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_unregmp2.yml\";\nlet q18=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"UtilityFunctionsps1\" or TargetProcessCommandLine contains \"RegSnapin \")|extend RuleId=\"0403d67d-6227-4ea8-8145-4e72db7da120\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_utilityfunctions.yml\";\nlet q19=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\VisualUiaVerifyNativeexe\" or TargetProcessFilename =~ \"VisualUiaVerifyNativeexe\")|extend RuleId=\"b30a8bc5-e21b-4ca2-9420-0a94019ac56a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_visualuiaverifynative.yml\";\nlet q20=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\VSIISExeLauncherexe\" or TargetProcessFilename =~ \"VSIISExeLauncherexe\") and (TargetProcessCommandLine contains \" -p \" or TargetProcessCommandLine contains \" -a \"))|extend RuleId=\"18749301-f1c5-4efc-a4c3-276ff1f5b6f8\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_vsiisexelauncher.yml\";\nlet q21=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\wfcexe\" or TargetProcessFilename =~ \"wfcexe\")|extend RuleId=\"49be8799-7b4d-4fda-ad23-cafbefdebbc5\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_wfc.yml\";\nlet q22=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\wlrmdrexe\" or (((TargetProcessName endswith \"\\\\wlrmdrexe\" or TargetProcessFilename =~ \"WLRMNDREXE\") and (TargetProcessCommandLine contains \"-s \" and TargetProcessCommandLine contains \"-f \" and TargetProcessCommandLine contains \"-t \" and TargetProcessCommandLine contains \"-m \" and TargetProcessCommandLine contains \"-a \" and TargetProcessCommandLine contains \"-u \")) and (not((ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\winlogonexe\" or ActingProcessName =~ \"-\")))))|extend RuleId=\"9cfc00b6-bfb7-49ce-9781-ef78503154bb\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_wlrmdr.yml\";\nlet q23=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\MicrosoftWorkflowCompilerexe\" or TargetProcessFilename =~ \"MicrosoftWorkflowCompilerexe\")|extend RuleId=\"419dbf2b-8a9b-4bea-bf99-7544b050ec8d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_workflow_compiler.yml\";\nlet q24=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\cscriptexe\" or TargetProcessName endswith \"\\\\wscriptexe\") or (TargetProcessFilename =~ \"cscriptexe\" or TargetProcessFilename =~ \"wscriptexe\")) and TargetProcessCommandLine contains \"vbs -register \")|extend RuleId=\"28c8f68b-098d-45af-8d43-8089f3e35403\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolscript_register_app.yml\";\nlet q25=_Im_ProcessCreate\n| where ActingProcessName endswith \"\\\\mftraceexe\"|extend RuleId=\"3d48c9d3-1aa6-418d-98d3-8fd3c01a564e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_mftrace_child_process.yml\";\nlet q26=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\MSBuildexe\" or TargetProcessFilename =~ \"MSBuildexe\") and (not((ActingProcessName endswith \"\\\\devenvexe\" or ActingProcessName endswith \"\\\\cmdexe\" or ActingProcessName endswith \"\\\\msbuildexe\" or ActingProcessName endswith \"\\\\pythonexe\" or ActingProcessName endswith \"\\\\explorerexe\" or ActingProcessName endswith \"\\\\nugetexe\"))))|extend RuleId=\"33be4333-2c6b-44f4-ae28-102cdbde0a31\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_msbuild_susp_parent_process.yml\";\nlet q27=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\msdtexe\" or TargetProcessFilename =~ \"msdtexe\") and (TargetProcessCommandLine contains \" /cab \" or TargetProcessCommandLine contains \" -cab \"))|extend RuleId=\"dc4576d4-7467-424f-9eee-fd2b02855fe0\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_msdt_susp_cab_options.yml\";\nlet q28=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"Wscript\" and TargetProcessCommandLine contains \"Shell\" and TargetProcessCommandLine contains \"Run\")|extend RuleId=\"2c28c248-7f50-417a-9186-a85b223010ee\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_mshta_inline_vbscript.yml\";\nlet q29=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\msiexecexe\" or TargetProcessFilename =~ \"\\\\msiexecexe\") and (TargetProcessCommandLine contains \" /z \" or TargetProcessCommandLine contains \" -z \") and TargetProcessCommandLine contains \"dll\")|extend RuleId=\"84f52741-8834-4a8c-a413-2eb2269aa6c8\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_msiexec_dll.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19, q20, q21, q22, q23, q24, q25, q26, q27, q28, q29;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Persistence", "Execution", "CommandAndControl", "DefenseEvasion", "PrivilegeEscalation", "CredentialAccess"],
                "techniques": ["T1547", "T1055", "T1127", "T1218", "T1105", "T1059", "T1216", "T1202", "T1003"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000106",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}