{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000114')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000114')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 14",
                "description": "Sigma Windows Process Creation low 14",
                "severity": "low",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\shutdown.exe\" and (TargetProcessCommandLine contains \"/r \" or TargetProcessCommandLine contains \"/s \"))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000113\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_shutdown_execution.yml\";\nlet q1=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\shutdown.exe\" and TargetProcessCommandLine contains \"/l\")|extend RuleId=\"ec290c06-9b6b-4338-8b6b-095c0f284f10\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_shutdown_logoff.yml\";\nlet q2=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\SndVol.exe\" and (not((TargetProcessName endswith \"\\\\rundll32.exe\" and TargetProcessCommandLine contains \" shell32.dll,Control_RunDLL \"))))|extend RuleId=\"ba42babc-0666-4393-a4f7-ceaf5a69191e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sndvol_susp_child_processes.yml\";\nlet q3=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\SoundRecorder.exe\" and TargetProcessCommandLine contains \"/FILE\")|extend RuleId=\"83865853-59aa-449e-9600-74b9d89a6d6e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_soundrecorder_audio_capture.yml\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\sqlcmd.exe\" and (TargetProcessCommandLine contains \"VeeamBackup\" and TargetProcessCommandLine contains \"From \")) and (TargetProcessCommandLine contains \"BackupRepositories\" or TargetProcessCommandLine contains \"Backups\" or TargetProcessCommandLine contains \"Credentials\" or TargetProcessCommandLine contains \"HostCreds\" or TargetProcessCommandLine contains \"SmbFileShares\" or TargetProcessCommandLine contains \"Ssh_creds\" or TargetProcessCommandLine contains \"VSphereInfo\"))|extend RuleId=\"696bfb54-227e-4602-ac5b-30d9d2053312\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sqlcmd_veeam_db_recon.yml\";\nlet q5=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\amazon-ssm-agent.exe\" and (TargetProcessCommandLine contains \"-register \" and TargetProcessCommandLine contains \"-code \" and TargetProcessCommandLine contains \"-id \" and TargetProcessCommandLine contains \"-region \"))|extend RuleId=\"d20ee2f4-822c-4827-9e15-41500b1fff10\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_ssm_agent_abuse.yml\";\nlet q6=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\ntvdm.exe\" or TargetProcessName endswith \"\\\\csrstub.exe\")|extend RuleId=\"16905e21-66ee-42fe-b256-1318ada2d770\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_16bit_application.yml\";\nlet q7=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \"localgroup \" and TargetProcessCommandLine contains \" /add\") or (TargetProcessCommandLine contains \"Add-LocalGroupMember \" and TargetProcessCommandLine contains \" -Group \")) and (TargetProcessCommandLine contains \" administrators \" or TargetProcessCommandLine contains \" administrateur\"))|extend RuleId=\"ad720b90-25ad-43ff-9b5e-5c841facc8e5\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_add_user_local_admin_group.yml\";\nlet q8=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"txt:\" and ((TargetProcessCommandLine contains \"type \" and TargetProcessCommandLine contains \" > \") or (TargetProcessCommandLine contains \"makecab \" and TargetProcessCommandLine contains \".cab\") or (TargetProcessCommandLine contains \"reg \" and TargetProcessCommandLine contains \" export \") or (TargetProcessCommandLine contains \"regedit \" and TargetProcessCommandLine contains \" /E \") or (TargetProcessCommandLine contains \"esentutl \" and TargetProcessCommandLine contains \" /y \" and TargetProcessCommandLine contains \" /d \" and TargetProcessCommandLine contains \" /o \")))|extend RuleId=\"7f43c430-5001-4f8b-aaa9-c3b88f18fa5c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_alternate_data_streams.yml\";\nlet q9=_Im_ProcessCreate\n| where ((((TargetProcessName contains \"\\\\Windows\\\\Installer\\\\\" and TargetProcessName contains \"msi\") and TargetProcessName endswith \"tmp\") or (TargetProcessName endswith \"\\\\msiexec.exe\" and TargetProcessIntegrityLevel =~ \"System\")) and (TargetUsername contains \"AUTHORI\" or TargetUsername contains \"AUTORI\") and (not((ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\services.exe\" or (TargetProcessCommandLine endswith \"\\\\system32\\\\msiexec.exe /V\" or ActingProcessCommandLine endswith \"\\\\system32\\\\msiexec.exe /V\") or ActingProcessName startswith \"C:\\\\ProgramData\\\\Sophos\\\\\" or ActingProcessName startswith \"C:\\\\ProgramData\\\\Avira\\\\\" or (ActingProcessName startswith \"C:\\\\Program Files\\\\Avast Software\\\\\" or ActingProcessName startswith \"C:\\\\Program Files (x86)\\\\Avast Software\\\\\") or (ActingProcessName startswith \"C:\\\\Program Files\\\\Google\\\\Update\\\\\" or ActingProcessName startswith \"C:\\\\Program Files (x86)\\\\Google\\\\Update\\\\\")))))|extend RuleId=\"cd951fdc-4b2f-47f5-ba99-a33bf61e3770\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_always_install_elevated_windows_installer.yml\";\nlet q10=_Im_ProcessCreate\n| where (ActingProcessName contains \"C:\\\\Program Files\\\\WindowsApps\\\\\" and ((TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\wscript.exe\") or (TargetProcessCommandLine contains \"cmd /c\" or TargetProcessCommandLine contains \"Invoke-\" or TargetProcessCommandLine contains \"Base64\")) and (not((ActingProcessName contains \":\\\\Program Files\\\\WindowsApps\\\\Microsoft.WindowsTerminal\" and ActingProcessName endswith \"\\\\WindowsTerminal.exe\" and (TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\")))))|extend RuleId=\"f91ed517-a6ba-471d-9910-b3b4a398c0f3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_appx_execution.yml\";\nlet q11=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \".SettingContent-ms\" and (not(TargetProcessCommandLine contains \"immersivecontrolpanel\")))|extend RuleId=\"24de4f3b-804c-4165-b442-5a06a2302c7e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_arbitrary_shell_execution_via_settingcontent.yml\";\nlet q12=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \".doc\" or TargetProcessCommandLine contains \".docx\" or TargetProcessCommandLine contains \".xls\" or TargetProcessCommandLine contains \".xlsx\" or TargetProcessCommandLine contains \".ppt\" or TargetProcessCommandLine contains \".pptx\" or TargetProcessCommandLine contains \".rtf\" or TargetProcessCommandLine contains \".pdf\" or TargetProcessCommandLine contains \".txt\") and ((TargetProcessCommandLine contains \"dir \" and TargetProcessCommandLine contains \" /b \" and TargetProcessCommandLine contains \" /s \") or (TargetProcessFilename =~ \"FINDSTR.EXE\" and (TargetProcessCommandLine contains \" /e \" or TargetProcessCommandLine contains \" /si \"))))|extend RuleId=\"f576a613-2392-4067-9d1a-9345fb58d8d1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_automated_collection.yml\";\nlet q13=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"h^t^t^p\" or TargetProcessCommandLine contains \"h\\\"t\\\"t\\\"p\")|extend RuleId=\"f0cdd048-82dc-4f7a-8a7a-b87a52b6d0fd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_cli_obfuscation_escape_char.yml\";\nlet q14=_Im_ProcessCreate\n| where (((TargetProcessName contains \"\\\\Windows\\\\\" and (TargetProcessCommandLine contains \"\\\\..\\\\Windows\\\\\" or TargetProcessCommandLine contains \"\\\\..\\\\System32\\\\\" or TargetProcessCommandLine contains \"\\\\..\\\\..\\\\\")) or TargetProcessCommandLine contains \".exe\\\\..\\\\\") and (not((TargetProcessCommandLine contains \"\\\\Google\\\\Drive\\\\googledrivesync.exe\\\\..\\\\\" or TargetProcessCommandLine contains \"\\\\Citrix\\\\Virtual Smart Card\\\\Citrix.Authentication.VirtualSmartcard.Launcher.exe\\\\..\\\\\"))))|extend RuleId=\"1327381e-6ab0-4f38-b583-4c1b8346a56b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_commandline_path_traversal_evasion.yml\";\nlet q15=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \"copy-item\" or TargetProcessCommandLine contains \"copy \" or TargetProcessCommandLine contains \"cpi \" or TargetProcessCommandLine contains \" cp \" or TargetProcessCommandLine contains \"move \" or TargetProcessCommandLine contains \"move-item\" or TargetProcessCommandLine contains \" mi \" or TargetProcessCommandLine contains \" mv \") or (TargetProcessName endswith \"\\\\xcopy.exe\" or TargetProcessName endswith \"\\\\robocopy.exe\") or (TargetProcessFilename =~ \"XCOPY.EXE\" or TargetProcessFilename =~ \"robocopy.exe\")) and (TargetProcessCommandLine contains \"\\\\Amigo\\\\User Data\" or TargetProcessCommandLine contains \"\\\\BraveSoftware\\\\Brave-Browser\\\\User Data\" or TargetProcessCommandLine contains \"\\\\CentBrowser\\\\User Data\" or TargetProcessCommandLine contains \"\\\\Chromium\\\\User Data\" or TargetProcessCommandLine contains \"\\\\CocCoc\\\\Browser\\\\User Data\" or TargetProcessCommandLine contains \"\\\\Comodo\\\\Dragon\\\\User Data\" or TargetProcessCommandLine contains \"\\\\Elements Browser\\\\User Data\" or TargetProcessCommandLine contains \"\\\\Epic Privacy Browser\\\\User Data\" or TargetProcessCommandLine contains \"\\\\Google\\\\Chrome Beta\\\\User Data\" or TargetProcessCommandLine contains \"\\\\Google\\\\Chrome SxS\\\\User Data\" or TargetProcessCommandLine contains \"\\\\Google\\\\Chrome\\\\User Data\\\\\" or TargetProcessCommandLine contains \"\\\\Kometa\\\\User Data\" or TargetProcessCommandLine contains \"\\\\Maxthon5\\\\Users\" or TargetProcessCommandLine contains \"\\\\Microsoft\\\\Edge\\\\User Data\" or TargetProcessCommandLine contains \"\\\\Mozilla\\\\Firefox\\\\Profiles\" or TargetProcessCommandLine contains \"\\\\Nichrome\\\\User Data\" or TargetProcessCommandLine contains \"\\\\Opera Software\\\\Opera GX Stable\\\\\" or TargetProcessCommandLine contains \"\\\\Opera Software\\\\Opera Neon\\\\User Data\" or TargetProcessCommandLine contains \"\\\\Opera Software\\\\Opera Stable\\\\\" or TargetProcessCommandLine contains \"\\\\Orbitum\\\\User Data\" or TargetProcessCommandLine contains \"\\\\QIP Surf\\\\User Data\" or TargetProcessCommandLine contains \"\\\\Sputnik\\\\User Data\" or TargetProcessCommandLine contains \"\\\\Torch\\\\User Data\" or TargetProcessCommandLine contains \"\\\\uCozMedia\\\\Uran\\\\User Data\" or TargetProcessCommandLine contains \"\\\\Vivaldi\\\\User Data\"))|extend RuleId=\"47147b5b-9e17-4d76-b8d2-7bac24c5ce1b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_copy_browser_data.yml\";\nlet q16=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\cmd.exe\" and TargetProcessCommandLine contains \"copy \") or ((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") and (TargetProcessCommandLine contains \"copy-item\" or TargetProcessCommandLine contains \" copy \" or TargetProcessCommandLine contains \"cpi \" or TargetProcessCommandLine contains \" cp \")) or ((TargetProcessName endswith \"\\\\robocopy.exe\" or TargetProcessName endswith \"\\\\xcopy.exe\") or (TargetProcessFilename =~ \"robocopy.exe\" or TargetProcessFilename =~ \"XCOPY.EXE\"))) and (TargetProcessCommandLine contains \"\\\\System32\" or TargetProcessCommandLine contains \"\\\\SysWOW64\" or TargetProcessCommandLine contains \"\\\\WinSxS\"))|extend RuleId=\"fff9d2b7-e11c-4a69-93d3-40ef66189767\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_copy_system_dir.yml\";\nlet q17=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"Cmd.Exe\" or TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and ((ActingProcessName contains \"\\\\Windows\\\\Installer\\\\\" and ActingProcessName contains \"msi\") and ActingProcessName endswith \"tmp\"))|extend RuleId=\"1e53dd56-8d83-4eb4-a43e-b790a05510aa\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_elavated_msi_spawned_shell.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["PrivilegeEscalation", "CredentialAccess", "CommandAndControl", "InitialAccess", "Impact", "Persistence", "Execution", "Collection", "DefenseEvasion"],
                "techniques": ["T1564", "T1123", "T1204", "T1036", "T1529", "T1219", "T1566", "T1119", "T1140", "T1555", "T1005", "T1548", "T1098", "T1552"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000114",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}