{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000104')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000104')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation low 04",
                "description": "Sigma Windows Process Creation low 04",
                "severity": "low",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\dsacls.exe\" or TargetProcessFilename =~ \"DSACLS.EXE\") and (TargetProcessCommandLine contains \"/user:\" and TargetProcessCommandLine contains \"/passwd:\"))|extend RuleId=\"bac9fb54-2da7-44e9-988f-11e9a5edbc0c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_dsacls_password_spray.yml\"|extend RuleTitle=\"Potential Password Spraying Attempt Using Dsacls.EXE\"|extend RuleDescription=\"Detects possible password spraying attempts using Dsacls\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\DismHost.exe\" and (ActingProcessCommandLine contains \"/Online\" and ActingProcessCommandLine contains \"/Disable-Feature\")) or (TargetProcessName endswith \"\\\\Dism.exe\" and (TargetProcessCommandLine contains \"/Online\" and TargetProcessCommandLine contains \"/Disable-Feature\")))|extend RuleId=\"43e32da2-fdd0-4156-90de-50dfd62636f9\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_dsim_remove.yml\"|extend RuleTitle=\"Dism Remove Online Package\"|extend RuleDescription=\"Deployment Image Servicing and Management tool. DISM is used to enumerate, install, uninstall, configure, and update features and packages in Windows images\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\dsquery.exe\" or TargetProcessFilename =~ \"dsquery.exe\") and TargetProcessCommandLine contains \"trustedDomain\")|extend RuleId=\"3bad990e-4848-4a78-9530-b427d854aac0\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_dsquery_domain_trust_discovery.yml\"|extend RuleTitle=\"Domain Trust Discovery Via Dsquery\"|extend RuleDescription=\"Detects execution of \"dsquery.exe\" for domain trust discovery\";\nlet q3=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\DumpMinitool.exe\" or TargetProcessName endswith \"\\\\DumpMinitool.x86.exe\" or TargetProcessName endswith \"\\\\DumpMinitool.arm64.exe\") or (TargetProcessFilename =~ \"DumpMinitool.exe\" or TargetProcessFilename =~ \"DumpMinitool.x86.exe\" or TargetProcessFilename =~ \"DumpMinitool.arm64.exe\")) and (TargetProcessCommandLine contains \" Full\" or TargetProcessCommandLine contains \" Mini\" or TargetProcessCommandLine contains \" WithHeap\"))|extend RuleId=\"dee0a7a3-f200-4112-a99b-952196d81e42\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_dumpminitool_execution.yml\"|extend RuleTitle=\"DumpMinitool Execution\"|extend RuleDescription=\"Detects the use of \"DumpMinitool.exe\" a tool that allows the dump of process memory via the use of the \"MiniDumpWriteDump\"\";\nlet q4=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"esentutl\" and TargetProcessCommandLine contains \" /p\")|extend RuleId=\"7df1713a-1a5b-4a4b-a071-dc83b144a101\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_esentutl_params.yml\"|extend RuleTitle=\"Esentutl Gather Credentials\"|extend RuleDescription=\"Conti recommendation to its affiliates to use esentutl to access NTDS dumped file. Trickbot also uses this utilities to get MSEdge info via its module pwgrab.\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\esentutl.exe\" or TargetProcessFilename =~ \"esentutl.exe\") and (TargetProcessCommandLine contains \"/r\" or TargetProcessCommandLine contains \"-r\") and TargetProcessCommandLine contains \"\\\\Windows\\\\WebCache\")|extend RuleId=\"6a69f62d-ce75-4b57-8dce-6351eb55b362\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_esentutl_webcache.yml\"|extend RuleTitle=\"Esentutl Steals Browser Information\"|extend RuleDescription=\"One way Qbot steals sensitive information is by extracting browser data from Internet Explorer and Microsoft Edge by using the built-in utility esentutl.exe\";\nlet q6=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\plink.exe\" or TargetProcessName endswith \"\\\\socat.exe\" or TargetProcessName endswith \"\\\\stunnel.exe\" or TargetProcessName endswith \"\\\\httptunnel.exe\")|extend RuleId=\"c75309a3-59f8-4a8d-9c2c-4c927ad50555\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_exfiltration_and_tunneling_tools_execution.yml\"|extend RuleTitle=\"Exfiltration and Tunneling Tools Execution\"|extend RuleDescription=\"Execution of well known tools for data exfiltration and tunneling\";\nlet q7=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\expand.exe\" and (TargetProcessCommandLine contains \".cab\" or TargetProcessCommandLine contains \"/F:\" or TargetProcessCommandLine contains \"-F:\" or TargetProcessCommandLine contains \"C:\\\\ProgramData\\\\\" or TargetProcessCommandLine contains \"C:\\\\Public\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\Temp\\\\\")) and (not((ActingProcessName =~ \"C:\\\\Program Files (x86)\\\\Dell\\\\UpdateService\\\\ServiceShell.exe\" and TargetProcessCommandLine contains \"C:\\\\ProgramData\\\\Dell\\\\UpdateService\\\\Temp\\\\\"))))|extend RuleId=\"9f107a84-532c-41af-b005-8d12a607639f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_expand_cabinet_files.yml\"|extend RuleTitle=\"Suspicious Cabinet File Expansion\"|extend RuleDescription=\"Adversaries can use the built-in expand utility to decompress cab files as seen in recent Iranian MeteorExpress attack\";\nlet q8=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"/factory,{75dff2b7-6936-4c06-a8bb-676a7b00b24b}\" or (TargetProcessCommandLine contains \"explorer.exe\" and TargetProcessCommandLine contains \" /root,\"))|extend RuleId=\"949f1ffb-6e85-4f00-ae1e-c3c5b190d605\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_explorer_break_process_tree.yml\"|extend RuleTitle=\"Explorer Process Tree Break\"|extend RuleDescription=\"Detects a command line process that uses explorer.exe to launch arbitrary commands or binaries,\nwhich is similar to cmd.exe /c, only it breaks the process tree and makes its parent a new instance of explorer spawning from \"svchost\"\n\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\findstr.exe\" or TargetProcessFilename =~ \"FINDSTR.EXE\") and TargetProcessCommandLine endswith \".lnk\")|extend RuleId=\"33339be3-148b-4e16-af56-ad16ec6c7e7b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_findstr_lnk.yml\"|extend RuleTitle=\"Findstr Launching .lnk File\"|extend RuleDescription=\"Detects usage of findstr to identify and execute a lnk file as seen within the HHS redirect attack\";\nlet q10=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\findstr.exe\" or TargetProcessFilename =~ \"FINDSTR.EXE\") and (TargetProcessCommandLine contains \"\\\"Everyone\\\"\" or TargetProcessCommandLine contains \"'Everyone'\" or TargetProcessCommandLine contains \"\\\"BUILTIN\\\\\\\"\" or TargetProcessCommandLine contains \"'BUILTIN\\\\'\")) or (TargetProcessCommandLine contains \"icacls \" and TargetProcessCommandLine contains \"findstr \" and TargetProcessCommandLine contains \"Everyone\"))|extend RuleId=\"47e4bab7-c626-47dc-967b-255608c9a920\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_findstr_recon_everyone.yml\"|extend RuleTitle=\"Permission Misconfiguration Reconnaissance Via Findstr.EXE\"|extend RuleDescription=\"Detects usage of findstr with the \"EVERYONE\" or \"BUILTIN\" keywords. This is seen being used in combination with \"icacls\" to look for misconfigured files or folders permissions\";\nlet q11=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\findstr.exe\" or TargetProcessFilename =~ \"FINDSTR.EXE\") and (ActingProcessCommandLine contains \"ipconfig \" or ActingProcessCommandLine contains \"tasklist\"))|extend RuleId=\"ccb5742c-c248-4982-8c5c-5571b9275ad3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_findstr_susp_parent.yml\"|extend RuleTitle=\"Potentially Suspicious Findstr.EXE Execution\"|extend RuleDescription=\"Detects execution of \"findstr\" as a child process of potentially suspicious parent command lines. This is often the case when \"findstr\" is used to filter out the results of certain reconnaissance commands such as \"tasklist\" or \"ipconfig /all\"\";\nlet q12=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\fsutil.exe\" or TargetProcessFilename =~ \"fsutil.exe\") and (TargetProcessCommandLine contains \"behavior \" and TargetProcessCommandLine contains \"set \" and TargetProcessCommandLine contains \"SymlinkEvaluation\"))|extend RuleId=\"c0b2768a-dd06-4671-8339-b16ca8d1f27f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_fsutil_symlinkevaluation.yml\"|extend RuleTitle=\"Fsutil Behavior Set SymlinkEvaluation\"|extend RuleDescription=\"A symbolic link is a type of file that contains a reference to another file.\nThis is probably done to make sure that the ransomware is able to follow shortcuts on the machine in order to find the original file to encrypt\n\";\nlet q13=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\GfxDownloadWrapper.exe\" and (TargetProcessCommandLine contains \"http://\" or TargetProcessCommandLine contains \"https://\")) and (not(TargetProcessCommandLine contains \"https://gameplayapi.intel.com/\")))|extend RuleId=\"eee00933-a761-4cd0-be70-c42fe91731e7\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_gfxdownloadwrapper_arbitrary_file_download.yml\"|extend RuleTitle=\"Arbitrary File Download Via GfxDownloadWrapper.EXE\"|extend RuleDescription=\"Detects execution of GfxDownloadWrapper.exe with a URL as an argument to download file.\";\nlet q14=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\git.exe\" or TargetProcessName endswith \"\\\\git-remote-https.exe\") or TargetProcessFilename =~ \"git.exe\") and (TargetProcessCommandLine contains \" clone \" or TargetProcessCommandLine contains \"git-remote-https \") and (TargetProcessCommandLine contains \"exploit\" or TargetProcessCommandLine contains \"Vulns\" or TargetProcessCommandLine contains \"vulnerability\" or TargetProcessCommandLine contains \"RemoteCodeExecution\" or TargetProcessCommandLine contains \"Invoke-\" or TargetProcessCommandLine contains \"CVE-\" or TargetProcessCommandLine contains \"poc-\" or TargetProcessCommandLine contains \"ProofOfConcept\" or TargetProcessCommandLine contains \"proxyshell\" or TargetProcessCommandLine contains \"log4shell\" or TargetProcessCommandLine contains \"eternalblue\" or TargetProcessCommandLine contains \"eternal-blue\" or TargetProcessCommandLine contains \"MS17-\"))|extend RuleId=\"aef9d1f1-7396-4e92-a927-4567c7a495c1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_git_susp_clone.yml\"|extend RuleTitle=\"Suspicious Git Clone\"|extend RuleDescription=\"Detects execution of \"git\" in order to clone a remote repository that contain suspicious keywords which might be suspicious\";\nlet q15=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\gpg.exe\" or TargetProcessName endswith \"\\\\gpg2.exe\") or TargetProcessFileDescription =~ \"GnuPG\u2019s OpenPGP tool\") and (TargetProcessCommandLine contains \" -d \" and TargetProcessCommandLine contains \"passphrase\"))|extend RuleId=\"037dcd71-33a8-4392-bb01-293c94663e5a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_gpg4win_decryption.yml\"|extend RuleTitle=\"File Decryption Using Gpg4win\"|extend RuleDescription=\"Detects usage of Gpg4win to decrypt files\";\nlet q16=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\gpg.exe\" or TargetProcessName endswith \"\\\\gpg2.exe\") or TargetProcessFileDescription =~ \"GnuPG\u2019s OpenPGP tool\") and (TargetProcessCommandLine contains \" -c \" and TargetProcessCommandLine contains \"passphrase\"))|extend RuleId=\"550bbb84-ce5d-4e61-84ad-e590f0024dcd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_gpg4win_encryption.yml\"|extend RuleTitle=\"File Encryption Using Gpg4win\"|extend RuleDescription=\"Detects usage of Gpg4win to encrypt files\";\nlet q17=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\gpresult.exe\" and (TargetProcessCommandLine contains \"/z\" or TargetProcessCommandLine contains \"/v\"))|extend RuleId=\"e56d3073-83ff-4021-90fe-c658e0709e72\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_gpresult_execution.yml\"|extend RuleTitle=\"Gpresult Display Group Policy Information\"|extend RuleDescription=\"Detects cases in which a user uses the built-in Windows utility gpresult to display the Resultant Set of Policy (RSoP) information\";\nlet q18=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\gup.exe\" and TargetProcessName endswith \"\\\\explorer.exe\") and (not(((TargetProcessName endswith \"\\\\explorer.exe\" and TargetProcessCommandLine contains \"\\\\Notepad++\\\\notepad++.exe\") or ActingProcessName contains \"\\\\Notepad++\\\\updater\\\\\" or isnull(TargetProcessCommandLine)))))|extend RuleId=\"d65aee4d-2292-4cea-b832-83accd6cfa43\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_gup_arbitrary_binary_execution.yml\"|extend RuleTitle=\"Arbitrary Binary Execution Using GUP Utility\"|extend RuleDescription=\"Detects execution of the Notepad++ updater (gup) to launch other commands or executables\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Collection", "Execution", "DefenseEvasion", "CommandAndControl", "CredentialAccess", "Reconnaissance", "Exfiltration", "Discovery"],
                "techniques": ["T1615", "T1036", "T1202", "T1003", "T1071", "T1105", "T1593", "T1057", "T1572", "T1552", "T1059", "T1482", "T1005", "T1027", "T1041", "T1218", "T1562"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000104",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}