{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000201')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000201')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 01",
                "description": "Sigma Windows Process Creation medium 01",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\bitsadmin.exe\" or TargetProcessFilename =~ \"bitsadmin.exe\") and (TargetProcessCommandLine contains \" /transfer \" or TargetProcessCommandLine contains \" /create \" or TargetProcessCommandLine contains \" /addfile \") and (TargetProcessCommandLine contains \".githubusercontent.com\" or TargetProcessCommandLine contains \"anonfiles.com\" or TargetProcessCommandLine contains \"cdn.discordapp.com\" or TargetProcessCommandLine contains \"cdn.discordapp.com/attachments/\" or TargetProcessCommandLine contains \"ddns.net\" or TargetProcessCommandLine contains \"dl.dropboxusercontent.com\" or TargetProcessCommandLine contains \"ghostbin.co\" or TargetProcessCommandLine contains \"gofile.io\" or TargetProcessCommandLine contains \"hastebin.com\" or TargetProcessCommandLine contains \"mediafire.com\" or TargetProcessCommandLine contains \"mega.nz\" or TargetProcessCommandLine contains \"paste.ee\" or TargetProcessCommandLine contains \"pastebin.com\" or TargetProcessCommandLine contains \"pastebin.pl\" or TargetProcessCommandLine contains \"pastetext.net\" or TargetProcessCommandLine contains \"privatlab.com\" or TargetProcessCommandLine contains \"privatlab.net\" or TargetProcessCommandLine contains \"send.exploit.in\" or TargetProcessCommandLine contains \"sendspace.com\" or TargetProcessCommandLine contains \"storage.googleapis.com\" or TargetProcessCommandLine contains \"storjshare.io\" or TargetProcessCommandLine contains \"temp.sh\" or TargetProcessCommandLine contains \"transfer.sh\" or TargetProcessCommandLine contains \"ufile.io\"))|extend RuleId=\"8518ed3d-f7c9-4601-a26c-f361a4256a0c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_bitsadmin_download_file_sharing_domains.yml\"|extend RuleTitle=\"Suspicious Download From File-Sharing Website Via Bitsadmin\"|extend RuleDescription=\"Detects usage of bitsadmin downloading a file from a suspicious domain\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\bitsadmin.exe\" or TargetProcessFilename =~ \"bitsadmin.exe\") and (TargetProcessCommandLine contains \" /transfer \" or TargetProcessCommandLine contains \" /create \" or TargetProcessCommandLine contains \" /addfile \") and (TargetProcessCommandLine contains \".7z\" or TargetProcessCommandLine contains \".asax\" or TargetProcessCommandLine contains \".ashx\" or TargetProcessCommandLine contains \".asmx\" or TargetProcessCommandLine contains \".asp\" or TargetProcessCommandLine contains \".aspx\" or TargetProcessCommandLine contains \".bat\" or TargetProcessCommandLine contains \".cfm\" or TargetProcessCommandLine contains \".cgi\" or TargetProcessCommandLine contains \".chm\" or TargetProcessCommandLine contains \".cmd\" or TargetProcessCommandLine contains \".dll\" or TargetProcessCommandLine contains \".gif\" or TargetProcessCommandLine contains \".jpeg\" or TargetProcessCommandLine contains \".jpg\" or TargetProcessCommandLine contains \".jsp\" or TargetProcessCommandLine contains \".jspx\" or TargetProcessCommandLine contains \".log\" or TargetProcessCommandLine contains \".png\" or TargetProcessCommandLine contains \".ps1\" or TargetProcessCommandLine contains \".psm1\" or TargetProcessCommandLine contains \".rar\" or TargetProcessCommandLine contains \".scf\" or TargetProcessCommandLine contains \".sct\" or TargetProcessCommandLine contains \".txt\" or TargetProcessCommandLine contains \".vbe\" or TargetProcessCommandLine contains \".vbs\" or TargetProcessCommandLine contains \".war\" or TargetProcessCommandLine contains \".wsf\" or TargetProcessCommandLine contains \".wsh\" or TargetProcessCommandLine contains \".xll\" or TargetProcessCommandLine contains \".zip\"))|extend RuleId=\"5b80a791-ad9b-4b75-bcc1-ad4e1e89c200\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_bitsadmin_download_susp_extensions.yml\"|extend RuleTitle=\"File With Suspicious Extension Downloaded Via Bitsadmin\"|extend RuleDescription=\"Detects usage of bitsadmin downloading a file with a suspicious extension\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\bitsadmin.exe\" or TargetProcessFilename =~ \"bitsadmin.exe\") and (TargetProcessCommandLine contains \" /transfer \" or TargetProcessCommandLine contains \" /create \" or TargetProcessCommandLine contains \" /addfile \") and (TargetProcessCommandLine contains \":\\\\Perflogs\" or TargetProcessCommandLine contains \":\\\\ProgramData\\\\\" or TargetProcessCommandLine contains \":\\\\Temp\\\\\" or TargetProcessCommandLine contains \":\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\\" or TargetProcessCommandLine contains \"\\\\Desktop\\\\\" or TargetProcessCommandLine contains \"%ProgramData%\" or TargetProcessCommandLine contains \"%public%\"))|extend RuleId=\"2ddef153-167b-4e89-86b6-757a9e65dcac\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_bitsadmin_download_susp_targetfolder.yml\"|extend RuleTitle=\"File Download Via Bitsadmin To A Suspicious Target Folder\"|extend RuleDescription=\"Detects usage of bitsadmin downloading a file to a suspicious target folder\";\nlet q3=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"--remote-debugging-\" and TargetProcessCommandLine contains \"--user-data-dir\" and TargetProcessCommandLine contains \"--headless\")|extend RuleId=\"3e8207c5-fcd2-4ea6-9418-15d45b4890e4\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_browsers_chromium_headless_debugging.yml\"|extend RuleTitle=\"Potential Data Stealing Via Chromium Headless Debugging\"|extend RuleDescription=\"Detects chromium based browsers starting in headless and debugging mode and pointing to a user profile. This could be a sign of data stealing or remote control\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\brave.exe\" or TargetProcessName endswith \"\\\\chrome.exe\" or TargetProcessName endswith \"\\\\msedge.exe\" or TargetProcessName endswith \"\\\\opera.exe\" or TargetProcessName endswith \"\\\\vivaldi.exe\") and (TargetProcessCommandLine contains \"--headless\" and TargetProcessCommandLine contains \"dump-dom\" and TargetProcessCommandLine contains \"http\"))|extend RuleId=\"0e8cfe08-02c9-4815-a2f8-0d157b7ed33e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_browsers_chromium_headless_file_download.yml\"|extend RuleTitle=\"File Download with Headless Browser\"|extend RuleDescription=\"Detects execution of chromium based browser in headless mode using the \"dump-dom\" command line to download files\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\brave.exe\" or TargetProcessName endswith \"\\\\chrome.exe\" or TargetProcessName endswith \"\\\\msedge.exe\" or TargetProcessName endswith \"\\\\opera.exe\" or TargetProcessName endswith \"\\\\vivaldi.exe\") and TargetProcessCommandLine contains \"--headless\" and (TargetProcessCommandLine contains \"://run.mocky\" or TargetProcessCommandLine contains \"://mockbin\"))|extend RuleId=\"1c526788-0abe-4713-862f-b520da5e5316\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_browsers_chromium_mockbin_abuse.yml\"|extend RuleTitle=\"Chromium Browser Headless Execution To Mockbin Like Site\"|extend RuleDescription=\"Detects the execution of a Chromium based browser process with the \"headless\" flag and a URL pointing to the mockbin.org service (which can be used to exfiltrate data).\";\nlet q6=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\cmd.exe\" or ActingProcessName endswith \"\\\\cscript.exe\" or ActingProcessName endswith \"\\\\mshta.exe\" or ActingProcessName endswith \"\\\\powershell.exe\" or ActingProcessName endswith \"\\\\pwsh.exe\" or ActingProcessName endswith \"\\\\regsvr32.exe\" or ActingProcessName endswith \"\\\\rundll32.exe\" or ActingProcessName endswith \"\\\\wscript.exe\") and (TargetProcessName endswith \"\\\\brave.exe\" or TargetProcessName endswith \"\\\\chrome.exe\" or TargetProcessName endswith \"\\\\msedge.exe\" or TargetProcessName endswith \"\\\\opera.exe\" or TargetProcessName endswith \"\\\\vivaldi.exe\") and TargetProcessCommandLine contains \"--load-extension=\")|extend RuleId=\"27ba3207-dd30-4812-abbf-5d20c57d474e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_browsers_chromium_susp_load_extension.yml\"|extend RuleTitle=\"Suspicious Chromium Browser Instance Executed With Custom Extensions\"|extend RuleDescription=\"Detects a suspicious process spawning a Chromium based browser process with the 'load-extension' flag to start a instance with custom extensions\";\nlet q7=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\tor.exe\" or TargetProcessName endswith \"\\\\Tor Browser\\\\Browser\\\\firefox.exe\")|extend RuleId=\"62f7c9bf-9135-49b2-8aeb-1e54a6ecc13c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_browsers_tor_execution.yml\"|extend RuleTitle=\"Tor Client/Browser Execution\"|extend RuleDescription=\"Detects the use of Tor or Tor-Browser to connect to onion routing networks\";\nlet q8=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\certoc.exe\" or TargetProcessFilename =~ \"CertOC.exe\") and TargetProcessCommandLine matches regex \"://[0-9]{1,3}\\\\.[0-9]{1,3}\\\\.[0-9]{1,3}\\\\.[0-9]{1,3}\" and TargetProcessCommandLine contains \"-GetCACAPS\")|extend RuleId=\"b86f6dea-0b2f-41f5-bdcc-a057bd19cd6a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_certoc_download_direct_ip.yml\"|extend RuleTitle=\"File Download From IP Based URL Via CertOC.EXE\"|extend RuleDescription=\"Detects when a user downloads a file from an IP based URL using CertOC.exe\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\certoc.exe\" or TargetProcessFilename =~ \"CertOC.exe\") and (TargetProcessCommandLine contains \" -LoadDLL \" or TargetProcessCommandLine contains \" /LoadDLL \") and (TargetProcessCommandLine contains \"\\\\Appdata\\\\Local\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\Desktop\\\\\" or TargetProcessCommandLine contains \"\\\\Downloads\\\\\" or TargetProcessCommandLine contains \"\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \"C:\\\\Windows\\\\Tasks\\\\\" or TargetProcessCommandLine contains \"C:\\\\Windows\\\\Temp\\\\\"))|extend RuleId=\"84232095-ecca-4015-b0d7-7726507ee793\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_certoc_load_dll_susp_locations.yml\"|extend RuleTitle=\"Suspicious DLL Loaded via CertOC.EXE\"|extend RuleDescription=\"Detects when a user installs certificates by using CertOC.exe to load the target DLL file.\";\nlet q10=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessFilename =~ \"CertUtil.exe\") and (TargetProcessCommandLine contains \"urlcache \" or TargetProcessCommandLine contains \"verifyctl \") and (TargetProcessCommandLine contains \"://1\" or TargetProcessCommandLine contains \"://2\" or TargetProcessCommandLine contains \"://3\" or TargetProcessCommandLine contains \"://4\" or TargetProcessCommandLine contains \"://5\" or TargetProcessCommandLine contains \"://6\" or TargetProcessCommandLine contains \"://7\" or TargetProcessCommandLine contains \"://8\" or TargetProcessCommandLine contains \"://9\")) and (not(TargetProcessCommandLine contains \"://7-\")))|extend RuleId=\"13e6fe51-d478-4c7e-b0f2-6da9b400a829\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_certutil_download_direct_ip.yml\"|extend RuleTitle=\"Suspicious File Downloaded From Direct IP Via Certutil.EXE\"|extend RuleDescription=\"Detects the execution of certutil with certain flags that allow the utility to download files from direct IPs.\";\nlet q11=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessFilename =~ \"CertUtil.exe\") and (TargetProcessCommandLine contains \"urlcache \" or TargetProcessCommandLine contains \"verifyctl \") and (TargetProcessCommandLine contains \".githubusercontent.com\" or TargetProcessCommandLine contains \"anonfiles.com\" or TargetProcessCommandLine contains \"cdn.discordapp.com\" or TargetProcessCommandLine contains \"cdn.discordapp.com/attachments/\" or TargetProcessCommandLine contains \"ddns.net\" or TargetProcessCommandLine contains \"dl.dropboxusercontent.com\" or TargetProcessCommandLine contains \"ghostbin.co\" or TargetProcessCommandLine contains \"gofile.io\" or TargetProcessCommandLine contains \"hastebin.com\" or TargetProcessCommandLine contains \"mediafire.com\" or TargetProcessCommandLine contains \"mega.nz\" or TargetProcessCommandLine contains \"paste.ee\" or TargetProcessCommandLine contains \"pastebin.com\" or TargetProcessCommandLine contains \"pastebin.pl\" or TargetProcessCommandLine contains \"pastetext.net\" or TargetProcessCommandLine contains \"privatlab.com\" or TargetProcessCommandLine contains \"privatlab.net\" or TargetProcessCommandLine contains \"send.exploit.in\" or TargetProcessCommandLine contains \"sendspace.com\" or TargetProcessCommandLine contains \"storage.googleapis.com\" or TargetProcessCommandLine contains \"storjshare.io\" or TargetProcessCommandLine contains \"temp.sh\" or TargetProcessCommandLine contains \"transfer.sh\" or TargetProcessCommandLine contains \"ufile.io\"))|extend RuleId=\"42a5f1e7-9603-4f6d-97ae-3f37d130d794\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_certutil_download_file_sharing_domains.yml\"|extend RuleTitle=\"Suspicious File Downloaded From File-Sharing Website Via Certutil.EXE\"|extend RuleDescription=\"Detects the execution of certutil with certain flags that allow the utility to download files from file-sharing websites.\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "CommandAndControl", "Collection", "CredentialAccess", "Execution", "Persistence"],
                "techniques": ["T1176", "T1036", "T1027", "T1185", "T1105", "T1218", "T1090", "T1197"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000201",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}