{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000212')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000212')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation high 12",
                "description": "Sigma Windows Process Creation medium 12",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\onenote\\.exe\" and (((TargetProcessFilename =~ \"bitsadmin\\.exe\" or TargetProcessFilename =~ \"CertOC\\.exe\" or TargetProcessFilename =~ \"CertUtil\\.exe\" or TargetProcessFilename =~ \"Cmd\\.Exe\" or TargetProcessFilename =~ \"CMSTP\\.EXE\" or TargetProcessFilename =~ \"cscript\\.exe\" or TargetProcessFilename =~ \"curl\\.exe\" or TargetProcessFilename =~ \"HH\\.exe\" or TargetProcessFilename =~ \"IEExec\\.exe\" or TargetProcessFilename =~ \"InstallUtil\\.exe\" or TargetProcessFilename =~ \"javaw\\.exe\" or TargetProcessFilename =~ \"Microsoft\\.Workflow\\.Compiler\\.exe\" or TargetProcessFilename =~ \"msdt\\.exe\" or TargetProcessFilename =~ \"MSHTA\\.EXE\" or TargetProcessFilename =~ \"msiexec\\.exe\" or TargetProcessFilename =~ \"Msxsl\\.exe\" or TargetProcessFilename =~ \"odbcconf\\.exe\" or TargetProcessFilename =~ \"pcalua\\.exe\" or TargetProcessFilename =~ \"PowerShell\\.EXE\" or TargetProcessFilename =~ \"RegAsm\\.exe\" or TargetProcessFilename =~ \"RegSvcs\\.exe\" or TargetProcessFilename =~ \"REGSVR32\\.exe\" or TargetProcessFilename =~ \"RUNDLL32\\.exe\" or TargetProcessFilename =~ \"schtasks\\.exe\" or TargetProcessFilename =~ \"ScriptRunner\\.exe\" or TargetProcessFilename =~ \"wmic\\.exe\" or TargetProcessFilename =~ \"WorkFolders\\.exe\" or TargetProcessFilename =~ \"wscript\\.exe\") or (TargetProcessName endswith \"\\\\AppVLP\\.exe\" or TargetProcessName endswith \"\\\\bash\\.exe\" or TargetProcessName endswith \"\\\\bitsadmin\\.exe\" or TargetProcessName endswith \"\\\\certoc\\.exe\" or TargetProcessName endswith \"\\\\certutil\\.exe\" or TargetProcessName endswith \"\\\\cmd\\.exe\" or TargetProcessName endswith \"\\\\cmstp\\.exe\" or TargetProcessName endswith \"\\\\control\\.exe\" or TargetProcessName endswith \"\\\\cscript\\.exe\" or TargetProcessName endswith \"\\\\curl\\.exe\" or TargetProcessName endswith \"\\\\forfiles\\.exe\" or TargetProcessName endswith \"\\\\hh\\.exe\" or TargetProcessName endswith \"\\\\ieexec\\.exe\" or TargetProcessName endswith \"\\\\installutil\\.exe\" or TargetProcessName endswith \"\\\\javaw\\.exe\" or TargetProcessName endswith \"\\\\mftrace\\.exe\" or TargetProcessName endswith \"\\\\Microsoft\\.Workflow\\.Compiler\\.exe\" or TargetProcessName endswith \"\\\\msbuild\\.exe\" or TargetProcessName endswith \"\\\\msdt\\.exe\" or TargetProcessName endswith \"\\\\mshta\\.exe\" or TargetProcessName endswith \"\\\\msidb\\.exe\" or TargetProcessName endswith \"\\\\msiexec\\.exe\" or TargetProcessName endswith \"\\\\msxsl\\.exe\" or TargetProcessName endswith \"\\\\odbcconf\\.exe\" or TargetProcessName endswith \"\\\\pcalua\\.exe\" or TargetProcessName endswith \"\\\\powershell\\.exe\" or TargetProcessName endswith \"\\\\pwsh\\.exe\" or TargetProcessName endswith \"\\\\regasm\\.exe\" or TargetProcessName endswith \"\\\\regsvcs\\.exe\" or TargetProcessName endswith \"\\\\regsvr32\\.exe\" or TargetProcessName endswith \"\\\\rundll32\\.exe\" or TargetProcessName endswith \"\\\\schtasks\\.exe\" or TargetProcessName endswith \"\\\\scrcons\\.exe\" or TargetProcessName endswith \"\\\\scriptrunner\\.exe\" or TargetProcessName endswith \"\\\\sh\\.exe\" or TargetProcessName endswith \"\\\\svchost\\.exe\" or TargetProcessName endswith \"\\\\verclsid\\.exe\" or TargetProcessName endswith \"\\\\wmic\\.exe\" or TargetProcessName endswith \"\\\\workfolders\\.exe\" or TargetProcessName endswith \"\\\\wscript\\.exe\")) or (TargetProcessName endswith \"\\\\explorer\\.exe\" and (TargetProcessCommandLine contains \"\\.hta\" or TargetProcessCommandLine contains \"\\.vb\" or TargetProcessCommandLine contains \"\\.wsh\" or TargetProcessCommandLine contains \"\\.js\" or TargetProcessCommandLine contains \"\\.ps\" or TargetProcessCommandLine contains \"\\.scr\" or TargetProcessCommandLine contains \"\\.pif\" or TargetProcessCommandLine contains \"\\.bat\" or TargetProcessCommandLine contains \"\\.cmd\")) or (TargetProcessName contains \"\\\\AppData\\\\\" or TargetProcessName contains \"\\\\Users\\\\Public\\\\\" or TargetProcessName contains \"\\\\ProgramData\\\\\" or TargetProcessName contains \"\\\\Windows\\\\Tasks\\\\\" or TargetProcessName contains \"\\\\Windows\\\\Temp\\\\\" or TargetProcessName contains \"\\\\Windows\\\\System32\\\\Tasks\\\\\")) and (not(((TargetProcessName endswith \"\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\current\\\\Teams\\.exe\" and TargetProcessCommandLine endswith \"-Embedding\") or (TargetProcessName contains \"\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\\" and TargetProcessName endswith \"\\\\FileCoAuth\\.exe\" and TargetProcessCommandLine endswith \"-Embedding\")))))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000211\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_office_onenote_susp_child_processes.yml\";\nlet q1=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"\\\\Outlook\\\\Security\\\\EnableUnsafeClientMailRules\"|extend RuleId=\"55f0a3a1-846e-40eb-8273-677371b8d912\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_office_outlook_enable_unsafe_client_mail_rules.yml\";\nlet q2=_Im_ProcessCreate\n| where TargetProcessName contains \"\\\\Temporary Internet Files\\\\Content\\.Outlook\\\\\"|extend RuleId=\"a018fdc3-46a3-44e5-9afb-2cd4af1d4b39\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_office_outlook_execution_from_temp.yml\";\nlet q3=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\OUTLOOK\\.EXE\" and (TargetProcessName endswith \"\\\\AppVLP\\.exe\" or TargetProcessName endswith \"\\\\bash\\.exe\" or TargetProcessName endswith \"\\\\cmd\\.exe\" or TargetProcessName endswith \"\\\\cscript\\.exe\" or TargetProcessName endswith \"\\\\forfiles\\.exe\" or TargetProcessName endswith \"\\\\hh\\.exe\" or TargetProcessName endswith \"\\\\mftrace\\.exe\" or TargetProcessName endswith \"\\\\msbuild\\.exe\" or TargetProcessName endswith \"\\\\msdt\\.exe\" or TargetProcessName endswith \"\\\\mshta\\.exe\" or TargetProcessName endswith \"\\\\msiexec\\.exe\" or TargetProcessName endswith \"\\\\powershell\\.exe\" or TargetProcessName endswith \"\\\\pwsh\\.exe\" or TargetProcessName endswith \"\\\\regsvr32\\.exe\" or TargetProcessName endswith \"\\\\schtasks\\.exe\" or TargetProcessName endswith \"\\\\scrcons\\.exe\" or TargetProcessName endswith \"\\\\scriptrunner\\.exe\" or TargetProcessName endswith \"\\\\sh\\.exe\" or TargetProcessName endswith \"\\\\svchost\\.exe\" or TargetProcessName endswith \"\\\\wmic\\.exe\" or TargetProcessName endswith \"\\\\wscript\\.exe\"))|extend RuleId=\"208748f7-881d-47ac-a29c-07ea84bf691d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_office_outlook_susp_child_processes.yml\";\nlet q4=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\outlook\\.exe\" and TargetProcessName startswith \"\\\\\\\\\")|extend RuleId=\"e212d415-0e93-435f-9e1a-f29005bb4723\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_office_outlook_susp_child_processes_remote.yml\";\nlet q5=_Im_ProcessCreate\n| where (((ActingProcessName endswith \"\\\\WINWORD\\.EXE\" or ActingProcessName endswith \"\\\\EXCEL\\.EXE\" or ActingProcessName endswith \"\\\\POWERPNT\\.exe\" or ActingProcessName endswith \"\\\\MSPUB\\.exe\" or ActingProcessName endswith \"\\\\VISIO\\.exe\" or ActingProcessName endswith \"\\\\MSACCESS\\.exe\" or ActingProcessName endswith \"\\\\EQNEDT32\\.exe\") and TargetProcessName startswith \"C:\\\\users\\\\\" and TargetProcessName endswith \"\\.exe\") and (not(TargetProcessName endswith \"\\\\Teams\\.exe\")))|extend RuleId=\"aa3a6f94-890e-4e22-b634-ffdfd54792cc\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_office_spawn_exe_from_users_directory.yml\";\nlet q6=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\EQNEDT32\\.EXE\" or ActingProcessName endswith \"\\\\EXCEL\\.EXE\" or ActingProcessName endswith \"\\\\MSACCESS\\.EXE\" or ActingProcessName endswith \"\\\\MSPUB\\.exe\" or ActingProcessName endswith \"\\\\ONENOTE\\.EXE\" or ActingProcessName endswith \"\\\\POWERPNT\\.exe\" or ActingProcessName endswith \"\\\\VISIO\\.exe\" or ActingProcessName endswith \"\\\\WINWORD\\.EXE\" or ActingProcessName endswith \"\\\\wordpad\\.exe\" or ActingProcessName endswith \"\\\\wordview\\.exe\") and (((TargetProcessFilename =~ \"bitsadmin\\.exe\" or TargetProcessFilename =~ \"CertOC\\.exe\" or TargetProcessFilename =~ \"CertUtil\\.exe\" or TargetProcessFilename =~ \"Cmd\\.Exe\" or TargetProcessFilename =~ \"CMSTP\\.EXE\" or TargetProcessFilename =~ \"cscript\\.exe\" or TargetProcessFilename =~ \"curl\\.exe\" or TargetProcessFilename =~ \"HH\\.exe\" or TargetProcessFilename =~ \"IEExec\\.exe\" or TargetProcessFilename =~ \"InstallUtil\\.exe\" or TargetProcessFilename =~ \"javaw\\.exe\" or TargetProcessFilename =~ \"Microsoft\\.Workflow\\.Compiler\\.exe\" or TargetProcessFilename =~ \"msdt\\.exe\" or TargetProcessFilename =~ \"MSHTA\\.EXE\" or TargetProcessFilename =~ \"msiexec\\.exe\" or TargetProcessFilename =~ \"Msxsl\\.exe\" or TargetProcessFilename =~ \"odbcconf\\.exe\" or TargetProcessFilename =~ \"pcalua\\.exe\" or TargetProcessFilename =~ \"PowerShell\\.EXE\" or TargetProcessFilename =~ \"RegAsm\\.exe\" or TargetProcessFilename =~ \"RegSvcs\\.exe\" or TargetProcessFilename =~ \"REGSVR32\\.exe\" or TargetProcessFilename =~ \"RUNDLL32\\.exe\" or TargetProcessFilename =~ \"schtasks\\.exe\" or TargetProcessFilename =~ \"ScriptRunner\\.exe\" or TargetProcessFilename =~ \"wmic\\.exe\" or TargetProcessFilename =~ \"WorkFolders\\.exe\" or TargetProcessFilename =~ \"wscript\\.exe\") or (TargetProcessName endswith \"\\\\AppVLP\\.exe\" or TargetProcessName endswith \"\\\\bash\\.exe\" or TargetProcessName endswith \"\\\\bitsadmin\\.exe\" or TargetProcessName endswith \"\\\\certoc\\.exe\" or TargetProcessName endswith \"\\\\certutil\\.exe\" or TargetProcessName endswith \"\\\\cmd\\.exe\" or TargetProcessName endswith \"\\\\cmstp\\.exe\" or TargetProcessName endswith \"\\\\control\\.exe\" or TargetProcessName endswith \"\\\\cscript\\.exe\" or TargetProcessName endswith \"\\\\curl\\.exe\" or TargetProcessName endswith \"\\\\forfiles\\.exe\" or TargetProcessName endswith \"\\\\hh\\.exe\" or TargetProcessName endswith \"\\\\ieexec\\.exe\" or TargetProcessName endswith \"\\\\installutil\\.exe\" or TargetProcessName endswith \"\\\\javaw\\.exe\" or TargetProcessName endswith \"\\\\mftrace\\.exe\" or TargetProcessName endswith \"\\\\Microsoft\\.Workflow\\.Compiler\\.exe\" or TargetProcessName endswith \"\\\\msbuild\\.exe\" or TargetProcessName endswith \"\\\\msdt\\.exe\" or TargetProcessName endswith \"\\\\mshta\\.exe\" or TargetProcessName endswith \"\\\\msidb\\.exe\" or TargetProcessName endswith \"\\\\msiexec\\.exe\" or TargetProcessName endswith \"\\\\msxsl\\.exe\" or TargetProcessName endswith \"\\\\odbcconf\\.exe\" or TargetProcessName endswith \"\\\\pcalua\\.exe\" or TargetProcessName endswith \"\\\\powershell\\.exe\" or TargetProcessName endswith \"\\\\pwsh\\.exe\" or TargetProcessName endswith \"\\\\regasm\\.exe\" or TargetProcessName endswith \"\\\\regsvcs\\.exe\" or TargetProcessName endswith \"\\\\regsvr32\\.exe\" or TargetProcessName endswith \"\\\\rundll32\\.exe\" or TargetProcessName endswith \"\\\\schtasks\\.exe\" or TargetProcessName endswith \"\\\\scrcons\\.exe\" or TargetProcessName endswith \"\\\\scriptrunner\\.exe\" or TargetProcessName endswith \"\\\\sh\\.exe\" or TargetProcessName endswith \"\\\\svchost\\.exe\" or TargetProcessName endswith \"\\\\verclsid\\.exe\" or TargetProcessName endswith \"\\\\wmic\\.exe\" or TargetProcessName endswith \"\\\\workfolders\\.exe\" or TargetProcessName endswith \"\\\\wscript\\.exe\")) or (TargetProcessName contains \"\\\\AppData\\\\\" or TargetProcessName contains \"\\\\Users\\\\Public\\\\\" or TargetProcessName contains \"\\\\ProgramData\\\\\" or TargetProcessName contains \"\\\\Windows\\\\Tasks\\\\\" or TargetProcessName contains \"\\\\Windows\\\\Temp\\\\\" or TargetProcessName contains \"\\\\Windows\\\\System32\\\\Tasks\\\\\")))|extend RuleId=\"438025f9-5856-4663-83f7-52f878a70a50\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_office_susp_child_processes.yml\";\nlet q7=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\ping\\.exe\" and TargetProcessCommandLine contains \"0x\")|extend RuleId=\"1a0d4aba-7668-4365-9ce4-6d79ab088dfd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_ping_hex_ip.yml\";\nlet q8=_Im_ProcessCreate\n| where (TargetProcessFileDescription =~ \"Command-line SSH, Telnet, and Rlogin client\" and TargetProcessCommandLine contains \" -R \")|extend RuleId=\"48a61b29-389f-4032-b317-b30de6b95314\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_plink_port_forwarding.yml\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\plink\\.exe\" and TargetProcessCommandLine contains \":127\\.0\\.0\\.1:3389\") or ((TargetProcessName endswith \"\\\\plink\\.exe\" and TargetProcessCommandLine contains \":3389\") and (TargetProcessCommandLine contains \" -P 443\" or TargetProcessCommandLine contains \" -P 22\")))|extend RuleId=\"f38ce0b9-5e97-4b47-a211-7dc8d8b871da\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_plink_susp_tunneling.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["CommandAndControl", "Execution", "DefenseEvasion", "LateralMovement", "InitialAccess"],
                "techniques": ["T1572", "T1218", "T1204", "T1140", "T1059", "T1027", "T1566", "T1202", "T1021", "T1047"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000212",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}