{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000225')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000225')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 25",
                "description": "Sigma Windows Process Creation medium 25",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName contains \"\\\\ProcessHacker_\" or TargetProcessName endswith \"\\\\ProcessHacker.exe\" or (TargetProcessFilename =~ \"ProcessHacker.exe\" or TargetProcessFilename =~ \"Process Hacker\") or TargetProcessFileDescription =~ \"Process Hacker\" or TargetProcessFileProduct =~ \"Process Hacker\") or (TargetProcessIMPHASH=~\"MD5=68F9B52895F4D34E74112F3129B3B00D\" or TargetProcessIMPHASH=~\"MD5=B365AF317AE730A67C936F21432B9C71\" or TargetProcessIMPHASH=~\"SHA1=A0BDFAC3CE1880B32FF9B696458327CE352E3B1D\" or TargetProcessIMPHASH=~\"SHA1=C5E2018BF7C0F314FED4FD7FE7E69FA2E648359E\" or TargetProcessIMPHASH=~\"SHA256=D4A0FE56316A2C45B9BA9AC1005363309A3EDC7ACF9E4DF64D326A0FF273E80F\" or TargetProcessIMPHASH=~\"SHA256=BD2C2CF0631D881ED382817AFCCE2B093F4E412FFB170A719E2762F250ABFEA4\" or TargetProcessIMPHASH=~\"3695333C60DEDECDCAFF1590409AA462\" or TargetProcessIMPHASH=~\"04DE0AD9C37EB7BD52043D2ECAC958DF\") or ((md5 =~ \"68f9b52895f4d34e74112f3129b3b00d\" or md5 =~ \"b365af317ae730a67c936f21432b9c71\") or (sha1 =~ \"c5e2018bf7c0f314fed4fd7fe7e69fa2e648359e\" or sha1 =~ \"a0bdfac3ce1880b32ff9b696458327ce352e3b1d\") or (sha256 =~ \"d4a0fe56316a2c45b9ba9ac1005363309a3edc7acf9e4df64d326a0ff273e80f\" or sha256 =~ \"bd2c2cf0631d881ed382817afcce2b093f4e412ffb170a719e2762f250abfea4\") or (TargetProcessIMPHASH =~ \"04de0ad9c37eb7bd52043d2ecac958df\" or TargetProcessIMPHASH =~ \"3695333c60dedecdcaff1590409aa462\")))|extend RuleId=\"811e0002-b13b-4a15-9d00-a613fce66e42\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_process_hacker.yml\"|extend RuleTitle=\"PUA - Process Hacker Execution\"|extend RuleDescription=\"Detects the execution of Process Hacker based on binary metadata information (Image, Hash, Imphash, etc). Process Hacker is a tool to view and manipulate processes, kernel options and other low level options. Threat actors regularly abuse it to manipulate system processes.\";\nlet q1=_Im_ProcessCreate\n| where (TargetProcessFileDescription =~ \"Radmin Viewer\" or TargetProcessFileProduct =~ \"Radmin Viewer\" or TargetProcessFilename =~ \"Radmin.exe\")|extend RuleId=\"5817e76f-4804-41e6-8f1d-5fa0b3ecae2d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_radmin.yml\"|extend RuleTitle=\"PUA - Radmin Viewer Utility Execution\"|extend RuleDescription=\"Detects the execution of Radmin which can be abused by an adversary to remotely control Windows machines\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"--config \" and TargetProcessCommandLine contains \"--no-check-certificate \" and TargetProcessCommandLine contains \" copy \") or ((TargetProcessName endswith \"\\\\rclone.exe\" or TargetProcessFileDescription =~ \"Rsync for cloud storage\") and (TargetProcessCommandLine contains \"pass\" or TargetProcessCommandLine contains \"user\" or TargetProcessCommandLine contains \"copy\" or TargetProcessCommandLine contains \"sync\" or TargetProcessCommandLine contains \"config\" or TargetProcessCommandLine contains \"lsd\" or TargetProcessCommandLine contains \"remote\" or TargetProcessCommandLine contains \"ls\" or TargetProcessCommandLine contains \"mega\" or TargetProcessCommandLine contains \"pcloud\" or TargetProcessCommandLine contains \"ftp\" or TargetProcessCommandLine contains \"ignore-existing\" or TargetProcessCommandLine contains \"auto-confirm\" or TargetProcessCommandLine contains \"transfers\" or TargetProcessCommandLine contains \"multi-thread-streams\" or TargetProcessCommandLine contains \"no-check-certificate \")))|extend RuleId=\"e37db05d-d1f9-49c8-b464-cee1a4b11638\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_rclone_execution.yml\"|extend RuleTitle=\"PUA - Rclone Execution\"|extend RuleDescription=\"Detects execution of RClone utility for exfiltration as used by various ransomwares strains like REvil, Conti, FiveHands, etc\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \" /account=system \" or TargetProcessCommandLine contains \" /account=ti \") and TargetProcessCommandLine contains \"/exec=\")|extend RuleId=\"93199800-b52a-4dec-b762-75212c196542\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_runxcmd.yml\"|extend RuleTitle=\"PUA - RunXCmd Execution\"|extend RuleDescription=\"Detects the use of the RunXCmd tool to execute commands with System or TrustedInstaller accounts\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\Seatbelt.exe\" or TargetProcessFilename =~ \"Seatbelt.exe\" or TargetProcessFileDescription =~ \"Seatbelt\" or (TargetProcessCommandLine contains \" DpapiMasterKeys\" or TargetProcessCommandLine contains \" InterestingProcesses\" or TargetProcessCommandLine contains \" InterestingFiles\" or TargetProcessCommandLine contains \" CertificateThumbprints\" or TargetProcessCommandLine contains \" ChromiumBookmarks\" or TargetProcessCommandLine contains \" ChromiumHistory\" or TargetProcessCommandLine contains \" ChromiumPresence\" or TargetProcessCommandLine contains \" CloudCredentials\" or TargetProcessCommandLine contains \" CredEnum\" or TargetProcessCommandLine contains \" CredGuard\" or TargetProcessCommandLine contains \" FirefoxHistory\" or TargetProcessCommandLine contains \" ProcessCreationEvents\")) or ((TargetProcessCommandLine contains \" -group=misc\" or TargetProcessCommandLine contains \" -group=remote\" or TargetProcessCommandLine contains \" -group=chromium\" or TargetProcessCommandLine contains \" -group=slack\" or TargetProcessCommandLine contains \" -group=system\" or TargetProcessCommandLine contains \" -group=user\" or TargetProcessCommandLine contains \" -group=all\") and TargetProcessCommandLine contains \" -outputfile=\"))|extend RuleId=\"38646daa-e78f-4ace-9de0-55547b2d30da\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_seatbelt.yml\"|extend RuleTitle=\"PUA - Seatbelt Execution\"|extend RuleDescription=\"Detects the execution of the PUA/Recon tool Seatbelt via PE information of command line parameters\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\wsudo.exe\" or TargetProcessFilename =~ \"wsudo.exe\" or TargetProcessFileDescription =~ \"Windows sudo utility\" or ActingProcessName endswith \"\\\\wsudo-bridge.exe\") or (TargetProcessCommandLine contains \"-u System\" or TargetProcessCommandLine contains \"-uSystem\" or TargetProcessCommandLine contains \"-u TrustedInstaller\" or TargetProcessCommandLine contains \"-uTrustedInstaller\" or TargetProcessCommandLine contains \" --ti \"))|extend RuleId=\"bdeeabc9-ff2a-4a51-be59-bb253aac7891\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_wsudo_susp_execution.yml\"|extend RuleTitle=\"PUA - Wsudo Suspicious Execution\"|extend RuleDescription=\"Detects usage of wsudo (Windows Sudo Utility). Which is a tool that let the user execute programs with different permissions (System, Trusted Installer, Administrator...etc)\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"python.exe\" or TargetProcessName endswith \"python3.exe\" or TargetProcessName endswith \"python2.exe\") and ((TargetProcessCommandLine contains \"import pty\" and TargetProcessCommandLine contains \".spawn(\") or TargetProcessCommandLine contains \"from pty import spawn\"))|extend RuleId=\"480e7e51-e797-47e3-8d72-ebfce65b6d8d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_python_pty_spawn.yml\"|extend RuleTitle=\"Python Spawning Pretty TTY on Windows\"|extend RuleDescription=\"Detects python spawning a pretty tty\";\nlet q7=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \" -hp\" and (TargetProcessCommandLine contains \" -m\" or TargetProcessCommandLine contains \" a \"))|extend RuleId=\"faa48cae-6b25-4f00-a094-08947fef582f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rar_compression_with_password.yml\"|extend RuleTitle=\"Rar Usage with Password and Compression Level\"|extend RuleDescription=\"Detects the use of rar.exe, on the command line, to create an archive with password protection or with a specific compression level. This is pretty indicative of malicious actions.\";\nlet q8=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\rar.exe\" or TargetProcessFileDescription =~ \"Command line RAR\") or (TargetProcessCommandLine contains \".exe a \" or TargetProcessCommandLine contains \" a -m\")) and ((TargetProcessCommandLine contains \" -hp\" and TargetProcessCommandLine contains \" -r \") and (TargetProcessCommandLine contains \" C:\\\\\\*.\" or TargetProcessCommandLine contains \" C:\\\\\\\\\\*.\" or TargetProcessCommandLine contains \" C:\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \" %public%\" or TargetProcessCommandLine contains \" C:\\\\Windows\\\\\" or TargetProcessCommandLine contains \" C:\\\\PerfLogs\\\\\" or TargetProcessCommandLine contains \" C:\\\\Temp\" or TargetProcessCommandLine contains \" C:\\\\$Recycle.bin\\\\\")))|extend RuleId=\"afe52666-401e-4a02-b4ff-5d128990b8cb\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rar_susp_greedy_compression.yml\"|extend RuleTitle=\"Suspicious Greedy Compression Using Rar.EXE\"|extend RuleDescription=\"Detects RAR usage that creates an archive from a suspicious folder, either a system folder or one of the folders often used by attackers for staging purposes\";\nlet q9=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \"fullmemdmp\" or TargetProcessCommandLine contains \"/memdmp\" or TargetProcessCommandLine contains \"-memdmp\") and (TargetProcessCommandLine contains \" -o \" or TargetProcessCommandLine contains \" /o \") and (TargetProcessCommandLine contains \" -p \" or TargetProcessCommandLine contains \" /p \")) or ((TargetProcessName endswith \"\\\\rdrleakdiag.exe\" or TargetProcessFilename =~ \"RdrLeakDiag.exe\") and (TargetProcessCommandLine contains \"fullmemdmp\" or TargetProcessCommandLine contains \"/memdmp\" or TargetProcessCommandLine contains \"-memdmp\")))|extend RuleId=\"edadb1e5-5919-4e4c-8462-a9e643b02c4b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rdrleakdiag_process_dumping.yml\"|extend RuleTitle=\"Process Memory Dump via RdrLeakDiag.EXE\"|extend RuleDescription=\"Detects the use of the Microsoft Windows Resource Leak Diagnostic tool \"rdrleakdiag.exe\" to dump process memory\";\nlet q10=_Im_ProcessCreate\n| where ((((TargetProcessName endswith \"\\\\Regsvcs.exe\" or TargetProcessName endswith \"\\\\Regasm.exe\") or (TargetProcessFilename =~ \"RegSvcs.exe\" or TargetProcessFilename =~ \"RegAsm.exe\")) and (TargetProcessCommandLine contains \"\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\Desktop\\\\\" or TargetProcessCommandLine contains \"\\\\Downloads\\\\\" or TargetProcessCommandLine contains \"\\\\PerfLogs\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\Microsoft\\\\Windows\\\\Start Menu\\\\Programs\\\\Startup\\\\\")) or (((TargetProcessName endswith \"\\\\Regsvcs.exe\" or TargetProcessName endswith \"\\\\Regasm.exe\") or (TargetProcessFilename =~ \"RegSvcs.exe\" or TargetProcessFilename =~ \"RegAsm.exe\")) and (not((TargetProcessCommandLine contains \".dll\" or (TargetProcessCommandLine endswith \"\\\\Regasm.exe\\\"\" or TargetProcessCommandLine endswith \"\\\\Regasm.exe\" or TargetProcessCommandLine endswith \"\\\\Regsvcs.exe\\\"\" or TargetProcessCommandLine endswith \"\\\\Regsvcs.exe\"))))))|extend RuleId=\"cc368ed0-2411-45dc-a222-510ace303cb2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_regasm_suspicious_execution.yml\"|extend RuleTitle=\"Regasm/Regsvcs Suspicious Execution\"|extend RuleDescription=\"Detects suspicious execution of Regasm/Regsvcs utilities\";\nlet q11=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\regedit.exe\" or TargetProcessFilename =~ \"REGEDIT.EXE\") and (TargetProcessCommandLine contains \" /E \" or TargetProcessCommandLine contains \" -E \") and (TargetProcessCommandLine contains \"hklm\" or TargetProcessCommandLine contains \"hkey_local_machine\") and (TargetProcessCommandLine endswith \"\\\\system\" or TargetProcessCommandLine endswith \"\\\\sam\" or TargetProcessCommandLine endswith \"\\\\security\"))|extend RuleId=\"82880171-b475-4201-b811-e9c826cd5eaa\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_regedit_export_critical_keys.yml\"|extend RuleTitle=\"Exports Critical Registry Keys To a File\"|extend RuleDescription=\"Detects the export of a crital Registry key to a file.\";\nlet q12=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\regedit.exe\" or TargetProcessFilename =~ \"REGEDIT.EXE\") and ((TargetProcessCommandLine contains \" /i \" or TargetProcessCommandLine contains \".reg\") and TargetProcessCommandLine matches regex \":[^ \\\\\\\\]\")) and (not((TargetProcessCommandLine contains \" /e \" or TargetProcessCommandLine contains \" /a \" or TargetProcessCommandLine contains \" /c \" or TargetProcessCommandLine contains \" -e \" or TargetProcessCommandLine contains \" -a \" or TargetProcessCommandLine contains \" -c \"))))|extend RuleId=\"0b80ade5-6997-4b1d-99a1-71701778ea61\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_regedit_import_keys_ads.yml\"|extend RuleTitle=\"Imports Registry Key From an ADS\"|extend RuleDescription=\"Detects the import of a alternate datastream to the registry with regedit.exe.\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["LateralMovement", "Collection", "Execution", "PrivilegeEscalation", "DefenseEvasion", "CredentialAccess", "Persistence", "Discovery", "Exfiltration"],
                "techniques": ["T1112", "T1087", "T1564", "T1560", "T1567", "T1003", "T1526", "T1083", "T1543", "T1622", "T1218", "T1012", "T1072", "T1569", "T1059"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000225",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}