{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000214')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000214')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation high 14",
                "description": "Sigma Windows Process Creation medium 14",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"RGlzYWJsZVJlYWx0aW1lTW9uaXRvcmluZy\"\n| where TargetProcessCommandLine contains \"Rpc2FibGVSZWFsdGltZU1vbml0b3Jpbmcg\"\n| where TargetProcessCommandLine contains \"EaXNhYmxlUmVhbHRpbWVNb25pdG9yaW5nI\"\n| where TargetProcessCommandLine contains \"RGlzYWJsZUlPQVZQcm90ZWN0aW9uI\"\n| where TargetProcessCommandLine contains \"Rpc2FibGVJT0FWUHJvdGVjdGlvbi\"\n| where TargetProcessCommandLine contains \"EaXNhYmxlSU9BVlByb3RlY3Rpb24g\"\n| where TargetProcessCommandLine contains \"RGlzYWJsZUJlaGF2aW9yTW9uaXRvcmluZy\"\n| where TargetProcessCommandLine contains \"Rpc2FibGVCZWhhdmlvck1vbml0b3Jpbmcg\"\n| where TargetProcessCommandLine contains \"EaXNhYmxlQmVoYXZpb3JNb25pdG9yaW5nI\"\n| where TargetProcessCommandLine contains \"RGlzYWJsZUJsb2NrQXRGaXJzdFNlZW4g\"\n| where TargetProcessCommandLine contains \"Rpc2FibGVCbG9ja0F0Rmlyc3RTZWVuI\"\n| where TargetProcessCommandLine contains \"EaXNhYmxlQmxvY2tBdEZpcnN0U2Vlbi\"\n| where TargetProcessCommandLine contains \"ZGlzYWJsZXJlYWx0aW1lbW9uaXRvcmluZy\"\n| where TargetProcessCommandLine contains \"Rpc2FibGVyZWFsdGltZW1vbml0b3Jpbmcg\"\n| where TargetProcessCommandLine contains \"kaXNhYmxlcmVhbHRpbWVtb25pdG9yaW5nI\"\n| where TargetProcessCommandLine contains \"ZGlzYWJsZWlvYXZwcm90ZWN0aW9uI\"\n| where TargetProcessCommandLine contains \"Rpc2FibGVpb2F2cHJvdGVjdGlvbi\"\n| where TargetProcessCommandLine contains \"kaXNhYmxlaW9hdnByb3RlY3Rpb24g\"\n| where TargetProcessCommandLine contains \"ZGlzYWJsZWJlaGF2aW9ybW9uaXRvcmluZy\"\n| where TargetProcessCommandLine contains \"Rpc2FibGViZWhhdmlvcm1vbml0b3Jpbmcg\"\n| where TargetProcessCommandLine contains \"kaXNhYmxlYmVoYXZpb3Jtb25pdG9yaW5nI\"\n| where TargetProcessCommandLine contains \"ZGlzYWJsZWJsb2NrYXRmaXJzdHNlZW4g\"\n| where TargetProcessCommandLine contains \"Rpc2FibGVibG9ja2F0Zmlyc3RzZWVuI\"\n| where TargetProcessCommandLine contains \"kaXNhYmxlYmxvY2thdGZpcnN0c2Vlbi\"\n| where (((TargetProcessCommandLine contains \"Add-MpPreference \" or TargetProcessCommandLine contains \"Set-MpPreference \") and (TargetProcessCommandLine contains \"DisableRealtimeMonitoring \" or TargetProcessCommandLine contains \"DisableIOAVProtection \" or TargetProcessCommandLine contains \"DisableBehaviorMonitoring \" or TargetProcessCommandLine contains \"DisableBlockAtFirstSeen \") and (TargetProcessCommandLine contains \"$true\" or TargetProcessCommandLine contains \" 1 \")) or (( or  or  or  or  or  or  or ) and (TargetProcessCommandLine contains \"RABpAHMAYQBiAGwAZQBSAGUAYQBsAHQAaQBtAGUATQBvAG4AaQB0AG8AcgBpAG4AZwAgA\" or TargetProcessCommandLine contains \"QAaQBzAGEAYgBsAGUAUgBlAGEAbAB0AGkAbQBlAE0AbwBuAGkAdABvAHIAaQBuAGcAIA\" or TargetProcessCommandLine contains \"EAGkAcwBhAGIAbABlAFIAZQBhAGwAdABpAG0AZQBNAG8AbgBpAHQAbwByAGkAbgBnACAA\" or TargetProcessCommandLine contains \"RABpAHMAYQBiAGwAZQBJAE8AQQBWAFAAcgBvAHQAZQBjAHQAaQBvAG4AIA\" or TargetProcessCommandLine contains \"QAaQBzAGEAYgBsAGUASQBPAEEAVgBQAHIAbwB0AGUAYwB0AGkAbwBuACAA\" or TargetProcessCommandLine contains \"EAGkAcwBhAGIAbABlAEkATwBBAFYAUAByAG8AdABlAGMAdABpAG8AbgAgA\" or TargetProcessCommandLine contains \"RABpAHMAYQBiAGwAZQBCAGUAaABhAHYAaQBvAHIATQBvAG4AaQB0AG8AcgBpAG4AZwAgA\" or TargetProcessCommandLine contains \"QAaQBzAGEAYgBsAGUAQgBlAGgAYQB2AGkAbwByAE0AbwBuAGkAdABvAHIAaQBuAGcAIA\" or TargetProcessCommandLine contains \"EAGkAcwBhAGIAbABlAEIAZQBoAGEAdgBpAG8AcgBNAG8AbgBpAHQAbwByAGkAbgBnACAA\" or TargetProcessCommandLine contains \"RABpAHMAYQBiAGwAZQBCAGwAbwBjAGsAQQB0AEYAaQByAHMAdABTAGUAZQBuACAA\" or TargetProcessCommandLine contains \"QAaQBzAGEAYgBsAGUAQgBsAG8AYwBrAEEAdABGAGkAcgBzAHQAUwBlAGUAbgAgA\" or TargetProcessCommandLine contains \"EAGkAcwBhAGIAbABlAEIAbABvAGMAawBBAHQARgBpAHIAcwB0AFMAZQBlAG4AIA\" or TargetProcessCommandLine contains \"ZABpAHMAYQBiAGwAZQByAGUAYQBsAHQAaQBtAGUAbQBvAG4AaQB0AG8AcgBpAG4AZwAgA\" or TargetProcessCommandLine contains \"QAaQBzAGEAYgBsAGUAcgBlAGEAbAB0AGkAbQBlAG0AbwBuAGkAdABvAHIAaQBuAGcAIA\" or TargetProcessCommandLine contains \"kAGkAcwBhAGIAbABlAHIAZQBhAGwAdABpAG0AZQBtAG8AbgBpAHQAbwByAGkAbgBnACAA\" or TargetProcessCommandLine contains \"ZABpAHMAYQBiAGwAZQBpAG8AYQB2AHAAcgBvAHQAZQBjAHQAaQBvAG4AIA\" or TargetProcessCommandLine contains \"QAaQBzAGEAYgBsAGUAaQBvAGEAdgBwAHIAbwB0AGUAYwB0AGkAbwBuACAA\" or TargetProcessCommandLine contains \"kAGkAcwBhAGIAbABlAGkAbwBhAHYAcAByAG8AdABlAGMAdABpAG8AbgAgA\" or TargetProcessCommandLine contains \"ZABpAHMAYQBiAGwAZQBiAGUAaABhAHYAaQBvAHIAbQBvAG4AaQB0AG8AcgBpAG4AZwAgA\" or TargetProcessCommandLine contains \"QAaQBzAGEAYgBsAGUAYgBlAGgAYQB2AGkAbwByAG0AbwBuAGkAdABvAHIAaQBuAGcAIA\" or TargetProcessCommandLine contains \"kAGkAcwBhAGIAbABlAGIAZQBoAGEAdgBpAG8AcgBtAG8AbgBpAHQAbwByAGkAbgBnACAA\" or TargetProcessCommandLine contains \"ZABpAHMAYQBiAGwAZQBiAGwAbwBjAGsAYQB0AGYAaQByAHMAdABzAGUAZQBuACAA\" or TargetProcessCommandLine contains \"QAaQBzAGEAYgBsAGUAYgBsAG8AYwBrAGEAdABmAGkAcgBzAHQAcwBlAGUAbgAgA\" or TargetProcessCommandLine contains \"kAGkAcwBhAGIAbABlAGIAbABvAGMAawBhAHQAZgBpAHIAcwB0AHMAZQBlAG4AIA\")))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000213\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_defender_disable_feature.yml\";\nlet q1=_Im_ProcessCreate\n| where ((((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and (TargetProcessCommandLine contains \"-DisableBehaviorMonitoring $true\" or TargetProcessCommandLine contains \"-DisableRuntimeMonitoring $true\")) or ((TargetProcessName endswith \"\\\\sc.exe\" or TargetProcessFilename =~ \"sc.exe\") and ((TargetProcessCommandLine contains \"stop\" and TargetProcessCommandLine contains \"WinDefend\") or (TargetProcessCommandLine contains \"delete\" and TargetProcessCommandLine contains \"WinDefend\") or (TargetProcessCommandLine contains \"config\" and TargetProcessCommandLine contains \"WinDefend\" and TargetProcessCommandLine contains \"start=disabled\"))))|extend RuleId=\"a7ee1722-c3c5-aeff-3212-c777e4733217\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_disable_defender_av_security_monitoring.yml\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \" -name IEHarden \" and TargetProcessCommandLine contains \" -value 0 \") or (TargetProcessCommandLine contains \" -name DEPOff \" and TargetProcessCommandLine contains \" -value 1 \") or (TargetProcessCommandLine contains \" -name DisableFirstRunCustomize \" and TargetProcessCommandLine contains \" -value 2 \"))|extend RuleId=\"fb50eb7a-5ab1-43ae-bcc9-091818cb8424\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_disable_ie_features.yml\";\nlet q3=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\regsvcs.exe\" or TargetProcessName endswith \"\\\\InstallUtil.exe\" or TargetProcessName endswith \"\\\\regasm.exe\") or (TargetProcessFilename =~ \"RUNDLL32.EXE\" or TargetProcessFilename =~ \"RegSvcs.exe\" or TargetProcessFilename =~ \"InstallUtil.exe\" or TargetProcessFilename =~ \"RegAsm.exe\")) and (TargetProcessCommandLine contains \"Default.GetString\" or TargetProcessCommandLine contains \"FromBase64String\" or TargetProcessCommandLine contains \"Invoke-Expression\" or TargetProcessCommandLine contains \"IEX \" or TargetProcessCommandLine contains \"Invoke-Command\" or TargetProcessCommandLine contains \"ICM \" or TargetProcessCommandLine contains \"DownloadString\"))|extend RuleId=\"6812a10b-60ea-420c-832f-dfcc33b646ba\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_dll_execution.yml\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \".DownloadString(\" or TargetProcessCommandLine contains \".DownloadFile(\" or TargetProcessCommandLine contains \"Invoke-WebRequest \" or TargetProcessCommandLine contains \"iwr \") and (TargetProcessCommandLine contains \";iex $\" or TargetProcessCommandLine contains \"| IEX\" or TargetProcessCommandLine contains \"|IEX \" or TargetProcessCommandLine contains \"I`E`X\" or TargetProcessCommandLine contains \"I`EX\" or TargetProcessCommandLine contains \"IE`X\" or TargetProcessCommandLine contains \"iex \" or TargetProcessCommandLine contains \"IEX (\" or TargetProcessCommandLine contains \"IEX(\" or TargetProcessCommandLine contains \"Invoke-Expression\"))|extend RuleId=\"85b0b087-eddf-4a2b-b033-d771fa2b9775\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_download_iex.yml\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") and (TargetProcessCommandLine contains \"Add-PSSnapin\" and TargetProcessCommandLine contains \"Get-Recipient\" and TargetProcessCommandLine contains \"-ExpandProperty\" and TargetProcessCommandLine contains \"EmailAddresses\" and TargetProcessCommandLine contains \"SmtpAddress\" and TargetProcessCommandLine contains \"-hidetableheaders\"))|extend RuleId=\"312d0384-401c-4b8b-abdf-685ffba9a332\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_email_exfil.yml\";\nlet q6=_Im_ProcessCreate\n| where ((((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.Exe\" or TargetProcessFilename =~ \"pwsh.dll\")) and (TargetProcessCommandLine contains \" -e \" or TargetProcessCommandLine contains \" -en \" or TargetProcessCommandLine contains \" -enc \" or TargetProcessCommandLine contains \" -enco\") and (TargetProcessCommandLine contains \" JAB\" or TargetProcessCommandLine contains \" SUVYI\" or TargetProcessCommandLine contains \" SQBFAFgA\" or TargetProcessCommandLine contains \" aWV4I\" or TargetProcessCommandLine contains \" IAB\" or TargetProcessCommandLine contains \" PAA\" or TargetProcessCommandLine contains \" aQBlAHgA\")) and (not((ActingProcessName contains \"C:\\\\Packages\\\\Plugins\\\\Microsoft.GuestConfiguration.ConfigurationforWindows\\\\\" or ActingProcessName contains \"\\\\gc_worker.exe\"))))|extend RuleId=\"b9d9cc83-380b-4ba3-8d8f-60c0e7e2930c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_encoded_cmd_patterns.yml\";\nlet q7=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"IAAtAGIAeABvAHIAIAAwAHgA\" or TargetProcessCommandLine contains \"AALQBiAHgAbwByACAAMAB4A\" or TargetProcessCommandLine contains \"gAC0AYgB4AG8AcgAgADAAeA\" or TargetProcessCommandLine contains \"AC4ASQBuAHYAbwBrAGUAKAApACAAfAAg\" or TargetProcessCommandLine contains \"AuAEkAbgB2AG8AawBlACgAKQAgAHwAI\" or TargetProcessCommandLine contains \"ALgBJAG4AdgBvAGsAZQAoACkAIAB8AC\" or TargetProcessCommandLine contains \"AHsAMQB9AHsAMAB9ACIAIAAtAGYAI\" or TargetProcessCommandLine contains \"B7ADEAfQB7ADAAfQAiACAALQBmAC\" or TargetProcessCommandLine contains \"AewAxAH0AewAwAH0AIgAgAC0AZgAg\" or TargetProcessCommandLine contains \"AHsAMAB9AHsAMwB9ACIAIAAtAGYAI\" or TargetProcessCommandLine contains \"B7ADAAfQB7ADMAfQAiACAALQBmAC\" or TargetProcessCommandLine contains \"AewAwAH0AewAzAH0AIgAgAC0AZgAg\" or TargetProcessCommandLine contains \"AHsAMgB9AHsAMAB9ACIAIAAtAGYAI\" or TargetProcessCommandLine contains \"B7ADIAfQB7ADAAfQAiACAALQBmAC\" or TargetProcessCommandLine contains \"AewAyAH0AewAwAH0AIgAgAC0AZgAg\" or TargetProcessCommandLine contains \"AHsAMQB9AHsAMAB9ACcAIAAtAGYAI\" or TargetProcessCommandLine contains \"B7ADEAfQB7ADAAfQAnACAALQBmAC\" or TargetProcessCommandLine contains \"AewAxAH0AewAwAH0AJwAgAC0AZgAg\" or TargetProcessCommandLine contains \"AHsAMAB9AHsAMwB9ACcAIAAtAGYAI\" or TargetProcessCommandLine contains \"B7ADAAfQB7ADMAfQAnACAALQBmAC\" or TargetProcessCommandLine contains \"AewAwAH0AewAzAH0AJwAgAC0AZgAg\" or TargetProcessCommandLine contains \"AHsAMgB9AHsAMAB9ACcAIAAtAGYAI\" or TargetProcessCommandLine contains \"B7ADIAfQB7ADAAfQAnACAALQBmAC\" or TargetProcessCommandLine contains \"AewAyAH0AewAwAH0AJwAgAC0AZgAg\")|extend RuleId=\"8d01b53f-456f-48ee-90f6-bc28e67d4e35\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_encoded_obfusc.yml\";\nlet q8=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"::FromBase64String(\"|extend RuleId=\"e32d4572-9826-4738-b651-95fa63747e8a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_frombase64string.yml\";\nlet q9=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"Get-Process lsas\" or TargetProcessCommandLine contains \"ps lsas\" or TargetProcessCommandLine contains \"gps lsas\")|extend RuleId=\"b2815d0d-7481-4bf0-9b6c-a4c48a94b349\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_getprocess_lsass.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["CredentialAccess", "Exfiltration", "DefenseEvasion", "Execution"],
                "techniques": ["T1140", "T1562", "T1059", "T1552", "T1027", "T1218"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000214",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}