{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000123')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000123')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation low 23",
                "description": "Sigma Windows Process Creation low 23",
                "severity": "low",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\userinit.exe\" and (not((TargetProcessCommandLine contains \"\\\\netlogon\\\\\" or (TargetProcessName endswith \"\\\\explorer.exe\" or TargetProcessFilename =~ \"explorer.exe\")))))|extend RuleId=\"b655a06a-31c0-477a-95c2-3726b83d649d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_userinit_child.yml\"|extend RuleTitle=\"Suspicious Userinit Child Process\"|extend RuleDescription=\"\"Detects a suspicious child process of userinit\"\";\nlet q1=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\vsjitdebugger.exe\" and (not((TargetProcessName contains \"*\\\\vsimmersiveactivatehelper*.exe\" or TargetProcessName endswith \"\\\\devenv.exe\"))))|extend RuleId=\"15c7904e-6ad1-4a45-9b46-5fb25df37fd2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_use_of_vsjitdebugger_bin.yml\"|extend RuleTitle=\"Malicious PE Execution by Microsoft Visual Studio Debugger\"|extend RuleDescription=\"\"There is an option for a MS VS Just-In-Time Debugger \\\"vsjitdebugger.exe\\\" to launch specified executable and attach a debugger.\\nThis option may be used adversaries to execute malicious code by signed verified binary.\\nThe debugger is installed alongside with Microsoft Visual Studio package.\\n\"\";\nlet q2=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"Asd123.aaaa\" or TargetProcessCommandLine contains \"password123\" or TargetProcessCommandLine contains \"123456789\" or TargetProcessCommandLine contains \"P@ssw0rd!\")|extend RuleId=\"91edcfb1-2529-4ac2-9ecc-7617f895c7e4\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_weak_or_abused_passwords.yml\"|extend RuleTitle=\"Weak or Abused Passwords In CLI\"|extend RuleDescription=\"\"Detects weak passwords or often abused passwords (seen used by threat actors) via the CLI. An example would be a threat actor creating a new user via the net command and providing the password inline\"\";\nlet q3=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"[System.Net.WebRequest]::create\" or TargetProcessCommandLine contains \"curl \" or TargetProcessCommandLine contains \"Invoke-RestMethod\" or TargetProcessCommandLine contains \"Invoke-WebRequest\" or TargetProcessCommandLine contains \"iwr \" or TargetProcessCommandLine contains \"Net.WebClient\" or TargetProcessCommandLine contains \"Resume-BitsTransfer\" or TargetProcessCommandLine contains \"Start-BitsTransfer\" or TargetProcessCommandLine contains \"wget \" or TargetProcessCommandLine contains \"WinHttp.WinHttpRequest\")|extend RuleId=\"9fc51a3c-81b3-4fa7-b35f-7c02cf10fd2d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_web_request_cmd_and_cmdlets.yml\"|extend RuleTitle=\"Usage Of Web Request Commands And Cmdlets\"|extend RuleDescription=\"\"Detects the use of various web request commands with commandline tools and Windows PowerShell cmdlets (including aliases) via CommandLine\"\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessFileProduct endswith \"AccessChk\" or TargetProcessFileDescription contains \"Reports effective permissions\" or (TargetProcessName endswith \"\\\\accesschk.exe\" or TargetProcessName endswith \"\\\\accesschk64.exe\") or TargetProcessFilename =~ \"accesschk.exe\") and (TargetProcessCommandLine contains \"uwcqv \" or TargetProcessCommandLine contains \"kwsu \" or TargetProcessCommandLine contains \"qwsu \" or TargetProcessCommandLine contains \"uwdqs \"))|extend RuleId=\"c625d754-6a3d-4f65-9c9a-536aea960d37\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_accesschk_check_permissions.yml\"|extend RuleTitle=\"Permission Check Via Accesschk.EXE\"|extend RuleDescription=\"\"Detects the usage of the \\\"Accesschk\\\" utility, an access and privilege audit tool developed by SysInternal and often being abused by attacker to verify process privileges\"\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\ADExplorer.exe\" or TargetProcessFilename =~ \"AdExp\") and TargetProcessCommandLine contains \"snapshot\")|extend RuleId=\"9212f354-7775-4e28-9c9f-8f0a4544e664\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_adexplorer_execution.yml\"|extend RuleTitle=\"Active Directory Database Snapshot Via ADExplorer\"|extend RuleDescription=\"\"Detects the execution of Sysinternals ADExplorer with the \\\"-snapshot\\\" flag in order to save a local copy of the active directory database.\"\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\livekd.exe\" or TargetProcessName endswith \"\\\\livekd64.exe\") or TargetProcessFilename =~ \"livekd.exe\")|extend RuleId=\"a85f7765-698a-4088-afa0-ecfbf8d01fa4\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_livekd_execution.yml\"|extend RuleTitle=\"Potential Memory Dumping Activity Via LiveKD\"|extend RuleDescription=\"\"Detects execution of LiveKD based on PE metadata or image name\"\";\nlet q7=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\procdump.exe\" or TargetProcessName endswith \"\\\\procdump64.exe\")|extend RuleId=\"2e65275c-8288-4ab4-aeb7-6274f58b6b20\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_procdump.yml\"|extend RuleTitle=\"Procdump Execution\"|extend RuleDescription=\"\"Detects usage of the SysInternals Procdump utility\"\";\nlet q8=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\psexec.exe\" or TargetProcessFilename =~ \"psexec.c\")|extend RuleId=\"730fc21b-eaff-474b-ad23-90fd265d4988\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_psexec_execution.yml\"|extend RuleTitle=\"Psexec Execution\"|extend RuleDescription=\"\"Detects user accept agreement execution in psexec commandline\"\";\nlet q9=_Im_ProcessCreate\n| where (TargetProcessName =~ \"C:\\\\Windows\\\\PSEXESVC.exe\" or TargetProcessFilename =~ \"psexesvc.exe\")|extend RuleId=\"fdfcbd78-48f1-4a4b-90ac-d82241e368c5\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_psexesvc.yml\"|extend RuleTitle=\"PsExec Service Execution\"|extend RuleDescription=\"\"Detects launch of the PSEXESVC service, which means that this system was the target of a psexec remote execution\"\";\nlet q10=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"psloglist.exe\" or (TargetProcessName endswith \"\\\\psloglist.exe\" or TargetProcessName endswith \"\\\\psloglist64.exe\")) and (TargetProcessCommandLine contains \" security\" or TargetProcessCommandLine contains \" application\" or TargetProcessCommandLine contains \" system\") and (TargetProcessCommandLine contains \" -d\" or TargetProcessCommandLine contains \" /d\" or TargetProcessCommandLine contains \" -x\" or TargetProcessCommandLine contains \" /x\" or TargetProcessCommandLine contains \" -s\" or TargetProcessCommandLine contains \" /s\" or TargetProcessCommandLine contains \" -c\" or TargetProcessCommandLine contains \" /c\" or TargetProcessCommandLine contains \" -g\" or TargetProcessCommandLine contains \" /g\"))|extend RuleId=\"aae1243f-d8af-40d8-ab20-33fc6d0c55bc\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_psloglist.yml\"|extend RuleTitle=\"Suspicious Use of PsLogList\"|extend RuleDescription=\"\"Detects usage of the PsLogList utility to dump event log in order to extract admin accounts and perform account discovery or delete events logs\"\";\nlet q11=_Im_ProcessCreate\n| where (TargetProcessFilename =~ \"psservice.exe\" or (TargetProcessName endswith \"\\\\PsService.exe\" or TargetProcessName endswith \"\\\\PsService64.exe\"))|extend RuleId=\"3371f518-5fe3-4cf6-a14b-2a0ae3fd8a4f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_psservice.yml\"|extend RuleTitle=\"Sysinternals PsService Execution\"|extend RuleDescription=\"\"Detects usage of Sysinternals PsService which can be abused for service reconnaissance and tampering\"\";\nlet q12=_Im_ProcessCreate\n| where (TargetProcessFilename =~ \"pssuspend.exe\" or (TargetProcessName endswith \"\\\\pssuspend.exe\" or TargetProcessName endswith \"\\\\pssuspend64.exe\"))|extend RuleId=\"48bbc537-b652-4b4e-bd1d-281172df448f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_pssuspend_execution.yml\"|extend RuleTitle=\"Sysinternals PsSuspend Execution\"|extend RuleDescription=\"\"Detects usage of Sysinternals PsSuspend which can be abused to suspend critical processes\"\";\nlet q13=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\Sysmon64.exe\" or TargetProcessName endswith \"\\\\Sysmon.exe\") or TargetProcessFileDescription =~ \"System activity monitor\") and (TargetProcessCommandLine contains \"-c\" or TargetProcessCommandLine contains \"/c\"))|extend RuleId=\"87911521-7098-470b-a459-9a57fc80bdfd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_sysmon_config_update.yml\"|extend RuleTitle=\"Sysmon Configuration Update\"|extend RuleDescription=\"\"Detects updates to Sysmon's configuration. Attackers might update or replace the Sysmon configuration with a bare bone one to avoid monitoring without shutting down the service completely\"\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Persistence", "DefenseEvasion", "Discovery", "CredentialAccess", "PrivilegeEscalation", "Execution", "LateralMovement"],
                "techniques": ["T1069", "T1059", "T1055", "T1003", "T1087", "T1021", "T1569", "T1036", "T1562", "T1552", "T1218", "T1543"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000123",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}