{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000210')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000210')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 10",
                "description": "Sigma Windows Process Creation medium 10",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\mshta.exe\" and ((TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\wscript.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\sh.exe\" or TargetProcessName endswith \"\\\\bash.exe\" or TargetProcessName endswith \"\\\\reg.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\bitsadmin.exe\") or (TargetProcessFilename =~ \"Cmd.Exe\" or TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\" or TargetProcessFilename =~ \"wscript.exe\" or TargetProcessFilename =~ \"cscript.exe\" or TargetProcessFilename =~ \"Bash.exe\" or TargetProcessFilename =~ \"reg.exe\" or TargetProcessFilename =~ \"REGSVR32.EXE\" or TargetProcessFilename =~ \"bitsadmin.exe\")))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000209\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_mshta_susp_child_processes.yml\";\nlet q1=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\mshta.exe\" and (TargetProcessCommandLine contains \"vbscript\" or TargetProcessCommandLine contains \".jpg\" or TargetProcessCommandLine contains \".png\" or TargetProcessCommandLine contains \".lnk\" or TargetProcessCommandLine contains \".xls\" or TargetProcessCommandLine contains \".doc\" or TargetProcessCommandLine contains \".zip\" or TargetProcessCommandLine contains \".dll\"))|extend RuleId=\"cc7abbd0-762b-41e3-8a26-57ad50d2eea3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_mshta_susp_execution.yml\";\nlet q2=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessFilename =~ \"MSHTA.EXE\") and ((ActingProcessName endswith \"\\\\cmd.exe\" or ActingProcessName endswith \"\\\\cscript.exe\" or ActingProcessName endswith \"\\\\powershell.exe\" or ActingProcessName endswith \"\\\\pwsh.exe\" or ActingProcessName endswith \"\\\\regsvr32.exe\" or ActingProcessName endswith \"\\\\rundll32.exe\" or ActingProcessName endswith \"\\\\wscript.exe\") and (TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\\" or TargetProcessCommandLine contains \"C:\\\\ProgramData\\\\\" or TargetProcessCommandLine contains \"C:\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \"C:\\\\Windows\\\\Temp\\\\\"))) or ((TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessFilename =~ \"MSHTA.EXE\") and (not(((TargetProcessName startswith \"C:\\\\Windows\\\\System32\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\SysWOW64\\\\\") or (TargetProcessCommandLine contains \".htm\" or TargetProcessCommandLine contains \".hta\") or (TargetProcessCommandLine endswith \"mshta.exe\" or TargetProcessCommandLine endswith \"mshta\"))))))|extend RuleId=\"e32f92d1-523e-49c3-9374-bdb13b46a3ba\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_mshta_susp_pattern.yml\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\msiexec.exe\" or TargetProcessFilename =~ \"\\\\msiexec.exe\") and (not((TargetProcessName startswith \"C:\\\\Windows\\\\System32\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\SysWOW64\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\WinSxS\\\\\"))))|extend RuleId=\"e22a6eb2-f8a5-44b5-8b44-a2dbd47b1144\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_msiexec_masquerading.yml\";\nlet q4=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\msra.exe\" and ActingProcessCommandLine endswith \"msra.exe\" and (TargetProcessName endswith \"\\\\arp.exe\" or TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\netstat.exe\" or TargetProcessName endswith \"\\\\nslookup.exe\" or TargetProcessName endswith \"\\\\route.exe\" or TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessName endswith \"\\\\whoami.exe\"))|extend RuleId=\"744a188b-0415-4792-896f-11ddb0588dbc\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_msra_process_injection.yml\";\nlet q5=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\sqlservr.exe\" and (TargetProcessName endswith \"\\\\bash.exe\" or TargetProcessName endswith \"\\\\bitsadmin.exe\" or TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\netstat.exe\" or TargetProcessName endswith \"\\\\nltest.exe\" or TargetProcessName endswith \"\\\\ping.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\sh.exe\" or TargetProcessName endswith \"\\\\systeminfo.exe\" or TargetProcessName endswith \"\\\\tasklist.exe\" or TargetProcessName endswith \"\\\\wsl.exe\")) and (not((ActingProcessName startswith \"C:\\\\Program Files\\\\Microsoft SQL Server\\\\\" and ActingProcessName endswith \"DATEV_DBENGINE\\\\MSSQL\\\\Binn\\\\sqlservr.exe\" and TargetProcessName =~ \"C:\\\\Windows\\\\System32\\\\cmd.exe\" and TargetProcessCommandLine startswith \"\\\"C:\\\\Windows\\\\system32\\\\cmd.exe\\\" \"))))|extend RuleId=\"869b9ca7-9ea2-4a5a-8325-e80e62f75445\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_mssql_susp_child_process.yml\";\nlet q6=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"noconsentprompt\" and TargetProcessCommandLine contains \"shadow:\")|extend RuleId=\"6ba5a05f-b095-4f0a-8654-b825f4f16334\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_mstsc_rdp_hijack_shadowing.yml\";\nlet q7=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\mstsc.exe\" or TargetProcessFilename =~ \"mstsc.exe\") and (TargetProcessCommandLine endswith \".rdp\" or TargetProcessCommandLine endswith \".rdp\\\"\") and (TargetProcessCommandLine contains \":\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\color\" or TargetProcessCommandLine contains \":\\\\Windows\\\\System32\\\\Tasks_Migrated \" or TargetProcessCommandLine contains \":\\\\Windows\\\\Tasks\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\Temp\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\Tracing\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\Downloads\\\\\"))|extend RuleId=\"6e22722b-dfb1-4508-a911-49ac840b40f8\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_mstsc_run_local_rdp_file_susp_location.yml\";\nlet q8=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\brave.exe\" or ActingProcessName endswith \"\\\\CCleanerBrowser.exe\" or ActingProcessName endswith \"\\\\chrome.exe\" or ActingProcessName endswith \"\\\\chromium.exe\" or ActingProcessName endswith \"\\\\firefox.exe\" or ActingProcessName endswith \"\\\\iexplore.exe\" or ActingProcessName endswith \"\\\\microsoftedge.exe\" or ActingProcessName endswith \"\\\\msedge.exe\" or ActingProcessName endswith \"\\\\opera.exe\" or ActingProcessName endswith \"\\\\vivaldi.exe\" or ActingProcessName endswith \"\\\\whale.exe\" or ActingProcessName endswith \"\\\\outlook.exe\") and (TargetProcessName endswith \"\\\\mstsc.exe\" or TargetProcessFilename =~ \"mstsc.exe\"))|extend RuleId=\"ff3b6b39-e765-42f9-bb2c-ea6761e0e0f6\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_mstsc_run_local_rpd_file_susp_parent.yml\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\netsh.exe\" or TargetProcessFilename =~ \"netsh.exe\") and ((TargetProcessCommandLine contains \"firewall\" and TargetProcessCommandLine contains \"add\" and TargetProcessCommandLine contains \"allowedprogram\") or (TargetProcessCommandLine contains \"advfirewall\" and TargetProcessCommandLine contains \"firewall\" and TargetProcessCommandLine contains \"add\" and TargetProcessCommandLine contains \"rule\" and TargetProcessCommandLine contains \"action=allow\" and TargetProcessCommandLine contains \"program=\")) and (TargetProcessCommandLine contains \"%Public%\\\\\" or TargetProcessCommandLine contains \"%TEMP%\" or TargetProcessCommandLine contains \"%TMP%\" or TargetProcessCommandLine contains \":\\\\$Recycle.bin\\\\\" or TargetProcessCommandLine contains \":\\\\RECYCLER\\\\\" or TargetProcessCommandLine contains \":\\\\SystemVolumeInformation\\\\\" or TargetProcessCommandLine contains \":\\\\Temp\\\\\" or TargetProcessCommandLine contains \":\\\\Users\\\\Default\\\\\" or TargetProcessCommandLine contains \":\\\\Users\\\\Desktop\\\\\" or TargetProcessCommandLine contains \":\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\addins\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\cursors\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\debug\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\drivers\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\fonts\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\help\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\system32\\\\tasks\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\Tasks\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\Downloads\\\\\" or TargetProcessCommandLine contains \"\\\\Local Settings\\\\Temporary Internet Files\\\\\" or TargetProcessCommandLine contains \"\\\\Temporary Internet Files\\\\Content.Outlook\\\\\"))|extend RuleId=\"a35f5a72-f347-4e36-8895-9869b0d5fc6d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_netsh_fw_allow_program_in_susp_location.yml\";\nlet q10=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\netsh.exe\" or TargetProcessFilename =~ \"netsh.exe\") and (TargetProcessCommandLine contains \"firewall \" and TargetProcessCommandLine contains \"add \" and TargetProcessCommandLine contains \"tcp \" and TargetProcessCommandLine contains \"3389\") and (TargetProcessCommandLine contains \"portopening\" or (TargetProcessCommandLine contains \"advfirewall\" and TargetProcessCommandLine contains \"rule\" and TargetProcessCommandLine contains \"allow\")))|extend RuleId=\"01aeb693-138d-49d2-9403-c4f52d7d3d62\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_netsh_fw_allow_rdp.yml\";\nlet q11=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\netsh.exe\" and (TargetProcessCommandLine contains \"add\" and TargetProcessCommandLine contains \"helper\"))|extend RuleId=\"56321594-9087-49d9-bf10-524fe8479452\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_netsh_helper_dll_persistence.yml\";\nlet q12=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\netsh.exe\" or TargetProcessFilename =~ \"netsh.exe\") and (TargetProcessCommandLine contains \" i\" and TargetProcessCommandLine contains \" p\" and TargetProcessCommandLine contains \"=3389\" and TargetProcessCommandLine contains \" c\"))|extend RuleId=\"782d6f3e-4c5d-4b8c-92a3-1d05fed72e63\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_netsh_port_forwarding_3389.yml\";\nlet q13=_Im_ProcessCreate\n| where ((((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") or (TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\")) and TargetProcessCommandLine contains \" user \" and (TargetProcessCommandLine contains \" J\u00e4rjestelm\u00e4nvalvoja \" or TargetProcessCommandLine contains \" Rendszergazda \" or TargetProcessCommandLine contains \" \u0410\u0434\u043c\u0438\u043d\u0438\u0441\u0442\u0440\u0430\u0442\u043e\u0440 \" or TargetProcessCommandLine contains \" Administrateur \" or TargetProcessCommandLine contains \" Administrador \" or TargetProcessCommandLine contains \" Administrat\u00f6r \" or TargetProcessCommandLine contains \" Administrator \" or TargetProcessCommandLine contains \" guest \" or TargetProcessCommandLine contains \" DefaultAccount \" or TargetProcessCommandLine contains \" \\\"J\u00e4rjestelm\u00e4nvalvoja\\\" \" or TargetProcessCommandLine contains \" \\\"Rendszergazda\\\" \" or TargetProcessCommandLine contains \" \\\"\u0410\u0434\u043c\u0438\u043d\u0438\u0441\u0442\u0440\u0430\u0442\u043e\u0440\\\" \" or TargetProcessCommandLine contains \" \\\"Administrateur\\\" \" or TargetProcessCommandLine contains \" \\\"Administrador\\\" \" or TargetProcessCommandLine contains \" \\\"Administrat\u00f6r\\\" \" or TargetProcessCommandLine contains \" \\\"Administrator\\\" \" or TargetProcessCommandLine contains \" \\\"guest\\\" \" or TargetProcessCommandLine contains \" \\\"DefaultAccount\\\" \" or TargetProcessCommandLine contains \" 'J\u00e4rjestelm\u00e4nvalvoja' \" or TargetProcessCommandLine contains \" 'Rendszergazda' \" or TargetProcessCommandLine contains \" '\u0410\u0434\u043c\u0438\u043d\u0438\u0441\u0442\u0440\u0430\u0442\u043e\u0440' \" or TargetProcessCommandLine contains \" 'Administrateur' \" or TargetProcessCommandLine contains \" 'Administrador' \" or TargetProcessCommandLine contains \" 'Administrat\u00f6r' \" or TargetProcessCommandLine contains \" 'Administrator' \" or TargetProcessCommandLine contains \" 'guest' \" or TargetProcessCommandLine contains \" 'DefaultAccount' \")) and (not((TargetProcessCommandLine contains \"guest\" and TargetProcessCommandLine contains \"/active no\"))))|extend RuleId=\"5b768e71-86f2-4879-b448-81061cbae951\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_default_accounts_manipulation.yml\";\nlet q14=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") or (TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\")) and (TargetProcessCommandLine contains \"user\" and TargetProcessCommandLine contains \"add\" and TargetProcessCommandLine contains \"expires:never\"))|extend RuleId=\"b9f0e6f5-09b4-4358-bae4-08408705bd5c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_user_add_never_expire.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Persistence", "LateralMovement", "Execution", "DefenseEvasion", "Collection", "InitialAccess", "PrivilegeEscalation", "CommandAndControl"],
                "techniques": ["T1218", "T1505", "T1546", "T1036", "T1090", "T1059", "T1106", "T1219", "T1055", "T1563", "T1562", "T1140", "T1136", "T1560", "T1190"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000210",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}