{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000228')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000228')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation high 28",
                "description": "Sigma Windows Process Creation medium 28",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"AddSecurityPackage\" or TargetProcessCommandLine contains \"AdjustTokenPrivileges\" or TargetProcessCommandLine contains \"Advapi32\" or TargetProcessCommandLine contains \"CloseHandle\" or TargetProcessCommandLine contains \"CreateProcessWithToken\" or TargetProcessCommandLine contains \"CreatePseudoConsole\" or TargetProcessCommandLine contains \"CreateRemoteThread\" or TargetProcessCommandLine contains \"CreateThread\" or TargetProcessCommandLine contains \"CreateUserThread\" or TargetProcessCommandLine contains \"DangerousGetHandle\" or TargetProcessCommandLine contains \"DuplicateTokenEx\" or TargetProcessCommandLine contains \"EnumerateSecurityPackages\" or TargetProcessCommandLine contains \"FreeHGlobal\" or TargetProcessCommandLine contains \"FreeLibrary\" or TargetProcessCommandLine contains \"GetDelegateForFunctionPointer\" or TargetProcessCommandLine contains \"GetLogonSessionData\" or TargetProcessCommandLine contains \"GetModuleHandle\" or TargetProcessCommandLine contains \"GetProcAddress\" or TargetProcessCommandLine contains \"GetProcessHandle\" or TargetProcessCommandLine contains \"GetTokenInformation\" or TargetProcessCommandLine contains \"ImpersonateLoggedOnUser\" or TargetProcessCommandLine contains \"kernel32\" or TargetProcessCommandLine contains \"LoadLibrary\" or TargetProcessCommandLine contains \"memcpy\" or TargetProcessCommandLine contains \"MiniDumpWriteDump\" or TargetProcessCommandLine contains \"ntdll\" or TargetProcessCommandLine contains \"OpenDesktop\" or TargetProcessCommandLine contains \"OpenProcess\" or TargetProcessCommandLine contains \"OpenProcessToken\" or TargetProcessCommandLine contains \"OpenThreadToken\" or TargetProcessCommandLine contains \"OpenWindowStation\" or TargetProcessCommandLine contains \"PtrToString\" or TargetProcessCommandLine contains \"QueueUserApc\" or TargetProcessCommandLine contains \"ReadProcessMemory\" or TargetProcessCommandLine contains \"RevertToSelf\" or TargetProcessCommandLine contains \"RtlCreateUserThread\" or TargetProcessCommandLine contains \"secur32\" or TargetProcessCommandLine contains \"SetThreadToken\" or TargetProcessCommandLine contains \"VirtualAlloc\" or TargetProcessCommandLine contains \"VirtualFree\" or TargetProcessCommandLine contains \"VirtualProtect\" or TargetProcessCommandLine contains \"WaitForSingleObject\" or TargetProcessCommandLine contains \"WriteInt32\" or TargetProcessCommandLine contains \"WriteProcessMemory\" or TargetProcessCommandLine contains \"ZeroFreeGlobalAllocUnicode\") and (not((TargetProcessName endswith \"\\\\MpCmdRun.exe\" and TargetProcessCommandLine contains \"GetLoadLibraryWAddress32\"))))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000227\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_inline_win_api_access.yml\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"lsass.dmp\" or TargetProcessCommandLine contains \"lsass.zip\" or TargetProcessCommandLine contains \"lsass.rar\" or TargetProcessCommandLine contains \"Andrew.dmp\" or TargetProcessCommandLine contains \"Coredump.dmp\" or TargetProcessCommandLine contains \"NotLSASS.zip\" or TargetProcessCommandLine contains \"lsass_2\" or TargetProcessCommandLine contains \"lsassdump\" or TargetProcessCommandLine contains \"lsassdmp\") or (TargetProcessCommandLine contains \"lsass\" and TargetProcessCommandLine contains \".dmp\") or (TargetProcessCommandLine contains \"SQLDmpr\" and TargetProcessCommandLine contains \".mdmp\") or (TargetProcessCommandLine contains \"nanodump\" and TargetProcessCommandLine contains \".dmp\"))|extend RuleId=\"ffa6861c-4461-4f59-8a41-578c39f3f23e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_lsass_dmp_cli_keywords.yml\";\nlet q2=_Im_ProcessCreate\n| where ((not((TargetProcessName endswith \".exe\" or TargetProcessName endswith \".tmp\" or TargetProcessName endswith \".scr\"))) and (not(((TargetProcessName =~ \"System\" or TargetProcessName =~ \"Registry\" or TargetProcessName =~ \"MemCompression\" or TargetProcessName =~ \"vmmem\") or TargetProcessName startswith \"C:\\\\Windows\\\\Installer\\\\MSI\" or TargetProcessName startswith \"C:\\\\Windows\\\\System32\\\\DriverStore\\\\FileRepository\\\\\" or (TargetProcessName startswith \"C:\\\\Config.Msi\\\\\" and (TargetProcessName endswith \".rbf\" or TargetProcessName endswith \".rbs\")) or (ActingProcessName startswith \"C:\\\\Windows\\\\Temp\\\\\" and TargetProcessName startswith \"C:\\\\Windows\\\\Temp\\\\Helper\\\\\") or ((TargetProcessName startswith \"C:\\\\Windows\\\\System32\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\SysWOW64\\\\\") and TargetProcessName endswith \".com\") or TargetProcessName startswith \"C:\\\\$Extend\\\\$Deleted\\\\\"))) and (not(((TargetProcessName =~ \"-\" or TargetProcessName =~ \"\") or isnull(TargetProcessName) or ActingProcessName startswith \"C:\\\\ProgramData\\\\Avira\\\\\" or (TargetProcessName contains \"NVIDIA\\\\NvBackend\\\\\" and TargetProcessName endswith \".dat\") or TargetProcessName endswith \"\\\\WinSCP.com\" or (TargetProcessName contains \"C:\\\\Users\\\\\" and TargetProcessName contains \"\\\\AppData\\\\\" and TargetProcessName contains \".tmp\" and TargetProcessName contains \"CodeSetup\") or TargetProcessName endswith \"\\\\program\\\\soffice.bin\" or TargetProcessName endswith \"\\\\program\\\\unopkg.bin\" or (TargetProcessName =~ \"C:\\\\Program Files\\\\EMC NetWorker\\\\Management\\\\GST\\\\apache\\\\cgi-bin\\\\update_jnlp.cgi\" or TargetProcessName =~ \"C:\\\\Program Files (x86)\\\\EMC NetWorker\\\\Management\\\\GST\\\\apache\\\\cgi-bin\\\\update_jnlp.cgi\") or ((TargetProcessName startswith \"C:\\\\Program Files (x86)\\\\WINPAKPRO\\\\\" or TargetProcessName startswith \"C:\\\\Program Files\\\\WINPAKPRO\\\\\") and TargetProcessName endswith \".ngn\") or (TargetProcessName =~ \"C:\\\\Program Files (x86)\\\\MyQ\\\\Server\\\\pcltool.dll\" or TargetProcessName =~ \"C:\\\\Program Files\\\\MyQ\\\\Server\\\\pcltool.dll\") or ((TargetProcessName startswith \"C:\\\\Program Files\\\\Microsoft Visual Studio\\\\\" or TargetProcessName startswith \"C:\\\\Program Files (x86)\\\\Microsoft Visual Studio\") and TargetProcessName endswith \".com\") or (TargetProcessName contains \"\\\\AppData\\\\Local\\\\Packages\\\\\" and TargetProcessName contains \"\\\\LocalState\\\\rootfs\\\\\") or TargetProcessName endswith \"\\\\LZMA_EXE\" or (ActingProcessName startswith \"C:\\\\Windows\\\\Temp\\\\\" and ActingProcessName endswith \"\\\\TBT_Dock_Firmware\\\\GetDockVer32W.exe\") or TargetProcessName startswith \"C:\\\\Program Files\\\\Mozilla Firefox\\\\tobedeleted\\\\\" or (ActingProcessName =~ \"C:\\\\Windows\\\\UUS\\\\amd64\\\\MoUsoCoreWorker.exe\" and TargetProcessName startswith \"C:\\\\$Extend\\\\$Deleted\\\\\" and (TargetProcessCommandLine contains \"C:\\\\Program Files\\\\Common Files\\\\Microsoft Shared\\\\ClickToRun\\\\OfficeC2RClient.exe\" and TargetProcessCommandLine contains \"/update UPDATEORCHESTRATOR displaylevel=False\")) or (ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\services.exe\" and TargetProcessName endswith \"com.docker.service\")))))|extend RuleId=\"c09dad97-1c78-4f71-b127-7edb2b8e491a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_non_exe_image.yml\";\nlet q3=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \"reg \" and TargetProcessCommandLine contains \"add\") or (TargetProcessCommandLine contains \"powershell\" or TargetProcessCommandLine contains \"set-itemproperty\" or TargetProcessCommandLine contains \" sp \" or TargetProcessCommandLine contains \"new-itemproperty\")) and (TargetProcessIntegrityLevel =~ \"Medium\" and (TargetProcessCommandLine contains \"ControlSet\" and TargetProcessCommandLine contains \"Services\") and (TargetProcessCommandLine contains \"ImagePath\" or TargetProcessCommandLine contains \"FailureCommand\" or TargetProcessCommandLine contains \"ServiceDLL\")))|extend RuleId=\"8f02c935-effe-45b3-8fc9-ef8696a9e41d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_non_priv_reg_or_ps.yml\";\nlet q4=_Im_ProcessCreate\n| where ((((TargetProcessName endswith \"\\\\NTDSDump.exe\" or TargetProcessName endswith \"\\\\NTDSDumpEx.exe\") or (TargetProcessCommandLine contains \"ntds.dit\" and TargetProcessCommandLine contains \"system.hiv\") or TargetProcessCommandLine contains \"NTDSgrab.ps1\") or (TargetProcessCommandLine contains \"ac i ntds\" and TargetProcessCommandLine contains \"create full\") or (TargetProcessCommandLine contains \"/c copy \" and TargetProcessCommandLine contains \"\\\\windows\\\\ntds\\\\ntds.dit\") or (TargetProcessCommandLine contains \"activate instance ntds\" and TargetProcessCommandLine contains \"create full\") or (TargetProcessCommandLine contains \"powershell\" and TargetProcessCommandLine contains \"ntds.dit\")) or (TargetProcessCommandLine contains \"ntds.dit\" and ((ActingProcessName contains \"\\\\apache\" or ActingProcessName contains \"\\\\tomcat\" or ActingProcessName contains \"\\\\AppData\\\\\" or ActingProcessName contains \"\\\\Temp\\\\\" or ActingProcessName contains \"\\\\Public\\\\\" or ActingProcessName contains \"\\\\PerfLogs\\\\\") or (TargetProcessName contains \"\\\\apache\" or TargetProcessName contains \"\\\\tomcat\" or TargetProcessName contains \"\\\\AppData\\\\\" or TargetProcessName contains \"\\\\Temp\\\\\" or TargetProcessName contains \"\\\\Public\\\\\" or TargetProcessName contains \"\\\\PerfLogs\\\\\"))))|extend RuleId=\"8bc64091-6875-4881-aaf9-7bd25b5dda08\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_ntds.yml\";\nlet q5=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"Win32_NTEventlogFile\" and (TargetProcessCommandLine contains \".BackupEventlog(\" or TargetProcessCommandLine contains \".ChangeSecurityPermissions(\" or TargetProcessCommandLine contains \".ChangeSecurityPermissionsEx(\" or TargetProcessCommandLine contains \".ClearEventLog(\" or TargetProcessCommandLine contains \".Delete(\" or TargetProcessCommandLine contains \".DeleteEx(\" or TargetProcessCommandLine contains \".Rename(\" or TargetProcessCommandLine contains \".TakeOwnerShip(\" or TargetProcessCommandLine contains \".TakeOwnerShipEx(\"))|extend RuleId=\"caf201a9-c2ce-4a26-9c3a-2b9525413711\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_nteventlogfile_usage.yml\";\nlet q6=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\minesweeper.exe\" or ActingProcessName endswith \"\\\\winver.exe\" or ActingProcessName endswith \"\\\\bitsadmin.exe\") or ((ActingProcessName endswith \"\\\\csrss.exe\" or ActingProcessName endswith \"\\\\certutil.exe\" or ActingProcessName endswith \"\\\\eventvwr.exe\" or ActingProcessName endswith \"\\\\calc.exe\" or ActingProcessName endswith \"\\\\notepad.exe\") and (not(((TargetProcessName endswith \"\\\\WerFault.exe\" or TargetProcessName endswith \"\\\\wermgr.exe\" or TargetProcessName endswith \"\\\\conhost.exe\" or TargetProcessName endswith \"\\\\mmc.exe\" or TargetProcessName endswith \"\\\\win32calc.exe\" or TargetProcessName endswith \"\\\\notepad.exe\") or isnull(TargetProcessName))))))|extend RuleId=\"cbec226f-63d9-4eca-9f52-dfb6652f24df\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_parents.yml\";\nlet q7=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\powershell.exe\") or (TargetProcessFilename =~ \"Cmd.Exe\" or TargetProcessFilename =~ \"PowerShell.EXE\")) and (TargetProcessCommandLine contains \"echo\" and TargetProcessCommandLine contains \">\" and TargetProcessCommandLine contains \"\\\\\\\\.\\\\pipe\\\\\"))|extend RuleId=\"9bd04a79-dabe-4f1f-a5ff-92430265c96b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_priv_escalation_via_named_pipe.yml\";\nlet q8=_Im_ProcessCreate\n| where (((TargetProcessName contains \"\\\\CVE-202\" or TargetProcessName contains \"\\\\CVE202\") or (TargetProcessName endswith \"\\\\poc.exe\" or TargetProcessName endswith \"\\\\artifact.exe\" or TargetProcessName endswith \"\\\\artifact64.exe\" or TargetProcessName endswith \"\\\\artifact_protected.exe\" or TargetProcessName endswith \"\\\\artifact32.exe\" or TargetProcessName endswith \"\\\\artifact32big.exe\" or TargetProcessName endswith \"obfuscated.exe\" or TargetProcessName endswith \"obfusc.exe\" or TargetProcessName endswith \"\\\\meterpreter\")) or (TargetProcessCommandLine contains \"inject.ps1\" or TargetProcessCommandLine contains \"Invoke-CVE\" or TargetProcessCommandLine contains \"pupy.ps1\" or TargetProcessCommandLine contains \"payload.ps1\" or TargetProcessCommandLine contains \"beacon.ps1\" or TargetProcessCommandLine contains \"PowerView.ps1\" or TargetProcessCommandLine contains \"bypass.ps1\" or TargetProcessCommandLine contains \"obfuscated.ps1\" or TargetProcessCommandLine contains \"obfusc.ps1\" or TargetProcessCommandLine contains \"obfus.ps1\" or TargetProcessCommandLine contains \"obfs.ps1\" or TargetProcessCommandLine contains \"evil.ps1\" or TargetProcessCommandLine contains \"MiniDogz.ps1\" or TargetProcessCommandLine contains \"_enc.ps1\" or TargetProcessCommandLine contains \"\\\\shell.ps1\" or TargetProcessCommandLine contains \"\\\\rshell.ps1\" or TargetProcessCommandLine contains \"revshell.ps1\" or TargetProcessCommandLine contains \"\\\\av.ps1\" or TargetProcessCommandLine contains \"\\\\av_test.ps1\" or TargetProcessCommandLine contains \"adrecon.ps1\" or TargetProcessCommandLine contains \"mimikatz.ps1\" or TargetProcessCommandLine contains \"\\\\PowerUp_\" or TargetProcessCommandLine contains \"powerup.ps1\" or TargetProcessCommandLine contains \"\\\\Temp\\\\a.ps1\" or TargetProcessCommandLine contains \"\\\\Temp\\\\p.ps1\" or TargetProcessCommandLine contains \"\\\\Temp\\\\1.ps1\" or TargetProcessCommandLine contains \"Hound.ps1\" or TargetProcessCommandLine contains \"encode.ps1\" or TargetProcessCommandLine contains \"powercat.ps1\"))|extend RuleId=\"efdd8dd5-cee8-4e59-9390-7d4d5e4dd6f6\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_progname.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "CredentialAccess", "LateralMovement", "Execution"],
                "techniques": ["T1021", "T1059", "T1003", "T1112", "T1036", "T1106"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000228",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}