{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000208')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000208')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation high 08",
                "description": "Sigma Windows Process Creation medium 08",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\appcmd.exe\" or TargetProcessFilename =~ \"appcmd.exe\") and (TargetProcessCommandLine contains \"set\" and TargetProcessCommandLine contains \"config\" and TargetProcessCommandLine contains \"section:httplogging\" and TargetProcessCommandLine contains \"dontLog:true\"))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000207\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_iis_appcmd_http_logging.yml\";\nlet q1=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\appcmd.exe\" or TargetProcessFilename =~ \"appcmd.exe\") and TargetProcessCommandLine contains \"list \") and ((TargetProcessCommandLine contains \" /config\" or TargetProcessCommandLine contains \" /xml\" or TargetProcessCommandLine contains \" -config\" or TargetProcessCommandLine contains \" -xml\") or ((TargetProcessCommandLine contains \" /@t\" or TargetProcessCommandLine contains \" /text\" or TargetProcessCommandLine contains \" /show\" or TargetProcessCommandLine contains \" -@t\" or TargetProcessCommandLine contains \" -text\" or TargetProcessCommandLine contains \" -show\") and (TargetProcessCommandLine contains \":\\*\" or TargetProcessCommandLine contains \"password\"))))|extend RuleId=\"2d3cdeec-c0db-45b4-aa86-082f7eb75701\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_iis_appcmd_service_account_password_dumped.yml\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\aspnet_regiis.exe\" or TargetProcessFilename =~ \"aspnet_regiis.exe\") and (TargetProcessCommandLine contains \"connectionStrings\" and TargetProcessCommandLine contains \" -pdf\"))|extend RuleId=\"97dbf6e2-e436-44d8-abee-4261b24d3e41\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_iis_connection_strings_decryption.yml\";\nlet q3=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\w3wp.exe\" and (TargetProcessCommandLine contains \"appcmd.exe add module\" or (TargetProcessCommandLine contains \" system.enterpriseservices.internal.publish\" and TargetProcessName endswith \"\\\\powershell.exe\") or (TargetProcessCommandLine contains \"gacutil\" and TargetProcessCommandLine contains \" /I\")))|extend RuleId=\"043c4b8b-3a54-4780-9682-081cb6b8185c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_iis_susp_module_registration.yml\";\nlet q4=_Im_ProcessCreate\n| where (((ActingProcessName endswith \"\\\\WmiPrvSE.exe\" or ActingProcessName endswith \"\\\\svchost.exe\" or ActingProcessName endswith \"\\\\dllhost.exe\") and TargetProcessName endswith \"\\\\ImagingDevices.exe\") or ActingProcessName endswith \"\\\\ImagingDevices.exe\")|extend RuleId=\"f11f2808-adb4-46c0-802a-8660db50fa99\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_imagingdevices_unusual_parents.yml\";\nlet q5=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\keytool.exe\" and (TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\sh.exe\" or TargetProcessName endswith \"\\\\bash.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessName endswith \"\\\\whoami.exe\" or TargetProcessName endswith \"\\\\bitsadmin.exe\" or TargetProcessName endswith \"\\\\wscript.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\scrcons.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\hh.exe\" or TargetProcessName endswith \"\\\\wmic.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\forfiles.exe\" or TargetProcessName endswith \"\\\\scriptrunner.exe\" or TargetProcessName endswith \"\\\\mftrace.exe\" or TargetProcessName endswith \"\\\\AppVLP.exe\" or TargetProcessName endswith \"\\\\systeminfo.exe\" or TargetProcessName endswith \"\\\\reg.exe\" or TargetProcessName endswith \"\\\\query.exe\"))|extend RuleId=\"90fb5e62-ca1f-4e22-b42e-cc521874c938\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_java_keytool_susp_child_process.yml\";\nlet q6=_Im_ProcessCreate\n| where (((ActingProcessName contains \"\\\\ManageEngine\\\\ServiceDesk\\\\\" and ActingProcessName contains \"\\\\java.exe\") and (TargetProcessName endswith \"\\\\AppVLP.exe\" or TargetProcessName endswith \"\\\\bash.exe\" or TargetProcessName endswith \"\\\\bitsadmin.exe\" or TargetProcessName endswith \"\\\\calc.exe\" or TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\curl.exe\" or TargetProcessName endswith \"\\\\forfiles.exe\" or TargetProcessName endswith \"\\\\mftrace.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\" or TargetProcessName endswith \"\\\\notepad.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\query.exe\" or TargetProcessName endswith \"\\\\reg.exe\" or TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessName endswith \"\\\\scrcons.exe\" or TargetProcessName endswith \"\\\\sh.exe\" or TargetProcessName endswith \"\\\\systeminfo.exe\" or TargetProcessName endswith \"\\\\whoami.exe\" or TargetProcessName endswith \"\\\\wmic.exe\" or TargetProcessName endswith \"\\\\wscript.exe\")) and (not(((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") and TargetProcessCommandLine contains \" stop\"))))|extend RuleId=\"cea2b7ea-792b-405f-95a1-b903ea06458f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_java_manageengine_susp_child_process.yml\";\nlet q7=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\java.exe\" and (TargetProcessName endswith \"\\\\sh.exe\" or TargetProcessName endswith \"\\\\bash.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessName endswith \"\\\\whoami.exe\" or TargetProcessName endswith \"\\\\bitsadmin.exe\" or TargetProcessName endswith \"\\\\wscript.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\scrcons.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\hh.exe\" or TargetProcessName endswith \"\\\\wmic.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\forfiles.exe\" or TargetProcessName endswith \"\\\\scriptrunner.exe\" or TargetProcessName endswith \"\\\\mftrace.exe\" or TargetProcessName endswith \"\\\\AppVLP.exe\" or TargetProcessName endswith \"\\\\curl.exe\" or TargetProcessName endswith \"\\\\systeminfo.exe\" or TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\" or TargetProcessName endswith \"\\\\reg.exe\" or TargetProcessName endswith \"\\\\query.exe\"))|extend RuleId=\"0d34ed8b-1c12-4ff2-828c-16fc860b766d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_java_susp_child_process.yml\";\nlet q8=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\kd.exe\" or TargetProcessFilename =~ \"kd.exe\")|extend RuleId=\"27ee9438-90dc-4bef-904b-d3ef927f5e7e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_kd_execution.yml\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\logman.exe\" or TargetProcessFilename =~ \"Logman.exe\") and (TargetProcessCommandLine contains \"stop \" or TargetProcessCommandLine contains \"delete \") and (TargetProcessCommandLine contains \"Circular Kernel Context Logger\" or TargetProcessCommandLine contains \"EventLog-\" or TargetProcessCommandLine contains \"SYSMON TRACE\" or TargetProcessCommandLine contains \"SysmonDnsEtwSession\"))|extend RuleId=\"cd1f961e-0b96-436b-b7c6-38da4583ec00\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_logman_disable_eventlog.yml\";\nlet q10=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\certoc.exe\" or TargetProcessFilename =~ \"CertOC.exe\") and TargetProcessCommandLine contains \"-GetCACAPS\")|extend RuleId=\"70ad0861-d1fe-491c-a45f-fa48148a300d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_certoc_download.yml\";\nlet q11=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\dctask64.exe\" and (not(TargetProcessCommandLine contains \"DesktopCentral_Agent\\\\agent\")))|extend RuleId=\"6345b048-8441-43a7-9bed-541133633d7a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_dctask64_proc_inject.yml\";\nlet q12=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\devtoolslauncher.exe\" and TargetProcessCommandLine contains \"LaunchForDeploy\")|extend RuleId=\"cc268ac1-42d9-40fd-9ed3-8c4e1a5b87e6\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_devtoolslauncher.yml\";\nlet q13=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\diskshadow.exe\" and (TargetProcessCommandLine contains \"/s\" or TargetProcessCommandLine contains \"-s\"))|extend RuleId=\"0c2f8629-7129-4a8a-9897-7e0768f13ff2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_diskshadow.yml\";\nlet q14=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\xwizard.exe\" and (not(TargetProcessName startswith \"C:\\\\Windows\\\\System32\\\\\")))|extend RuleId=\"193d5ccd-6f59-40c6-b5b0-8e32d5ddd3d1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_dll_sideload_xwizard.yml\";\nlet q15=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\dump64.exe\" and (not(TargetProcessName contains \"\\\\Installer\\\\Feedback\\\\dump64.exe\"))) or (TargetProcessName endswith \"\\\\dump64.exe\" and (TargetProcessCommandLine contains \" -ma \" or TargetProcessCommandLine contains \"accepteula\")))|extend RuleId=\"129966c9-de17-4334-a123-8b58172e664d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_dump64.yml\";\nlet q16=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\format.com\" and TargetProcessCommandLine contains \"/fs:\") and (not((TargetProcessCommandLine contains \"/fs:FAT\" or TargetProcessCommandLine contains \"/fs:exFAT\" or TargetProcessCommandLine contains \"/fs:NTFS\" or TargetProcessCommandLine contains \"/fs:UDF\" or TargetProcessCommandLine contains \"/fs:ReFS\"))))|extend RuleId=\"9fb6b26e-7f9e-4517-a48b-8cac4a1b6c60\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_format.yml\";\nlet q17=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\IEExec.exe\" or TargetProcessFilename =~ \"IEExec.exe\") and (TargetProcessCommandLine contains \"https://\" or TargetProcessCommandLine contains \"http://\"))|extend RuleId=\"9801abb8-e297-4dbf-9fbd-57dde0e830ad\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_ieexec_download.yml\";\nlet q18=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \" run run-cmd \" and (not((ActingProcessName endswith \"\\\\kavremover.exe\" or ActingProcessName endswith \"\\\\cleanapi.exe\"))))|extend RuleId=\"d047726b-c71c-4048-a99b-2e2f50dc107d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_kavremover.yml\";\nlet q19=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\wscript.exe\" or TargetProcessFilename =~ \"wscript.exe\") and TargetProcessCommandLine contains \"manage-bde.wsf\") or (((ActingProcessName endswith \"\\\\cscript.exe\" or ActingProcessName endswith \"\\\\wscript.exe\") and ActingProcessCommandLine contains \"manage-bde.wsf\") and (not(TargetProcessName endswith \"\\\\cmd.exe\"))))|extend RuleId=\"c363385c-f75d-4753-a108-c1a8e28bdbda\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_manage_bde.yml\";\nlet q20=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \" /INJECTRUNNING \" and (not(ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\AppVClient.exe\")))|extend RuleId=\"4f73421b-5a0b-4bbf-a892-5a7fb99bea66\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_mavinject_process_injection.yml\";\nlet q21=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\mpiexec.exe\" or TargetProcessIMPHASH =~ \"d8b52ef6aaa3a81501bdfff9dbb96217\" or Hashes contains \"IMPHASH=d8b52ef6aaa3a81501bdfff9dbb96217\") and (TargetProcessCommandLine contains \" /n 1 \" or TargetProcessCommandLine contains \" -n 1 \"))|extend RuleId=\"729ce0ea-5d8f-4769-9762-e35de441586d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_mpiexec.yml\";\nlet q22=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\msdt.exe\" and TargetProcessCommandLine contains \"\\\\WINDOWS\\\\diagnostics\\\\index\\\\PCWDiagnostic.xml\") and (TargetProcessCommandLine contains \" -af \" or TargetProcessCommandLine contains \" /af \")) and (not(ActingProcessName endswith \"\\\\pcwrun.exe\")))|extend RuleId=\"9c8c7000-3065-44a8-a555-79bcba5d9955\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_msdt_answer_file.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19, q20, q21, q22;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["PrivilegeEscalation", "CredentialAccess", "CommandAndControl", "InitialAccess", "DefenseEvasion", "Persistence", "Execution"],
                "techniques": ["T1216", "T1574", "T1003", "T1105", "T1070", "T1505", "T1102", "T1562", "T1055", "T1127", "T1218"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000208",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}