{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000211')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000211')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 11",
                "description": "Sigma Windows Process Creation medium 11",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\keytool.exe\" and (TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\sh.exe\" or TargetProcessName endswith \"\\\\bash.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessName endswith \"\\\\whoami.exe\" or TargetProcessName endswith \"\\\\bitsadmin.exe\" or TargetProcessName endswith \"\\\\wscript.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\scrcons.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\hh.exe\" or TargetProcessName endswith \"\\\\wmic.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\forfiles.exe\" or TargetProcessName endswith \"\\\\scriptrunner.exe\" or TargetProcessName endswith \"\\\\mftrace.exe\" or TargetProcessName endswith \"\\\\AppVLP.exe\" or TargetProcessName endswith \"\\\\systeminfo.exe\" or TargetProcessName endswith \"\\\\reg.exe\" or TargetProcessName endswith \"\\\\query.exe\"))|extend RuleId=\"90fb5e62-ca1f-4e22-b42e-cc521874c938\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_java_keytool_susp_child_process.yml\"|extend RuleTitle=\"Suspicious Shells Spawn by Java Utility Keytool\"|extend RuleDescription=\"Detects suspicious shell spawn from Java utility keytool process (e.g. adselfservice plus exploitation)\";\nlet q1=_Im_ProcessCreate\n| where (((ActingProcessName contains \"\\\\ManageEngine\\\\ServiceDesk\\\\\" and ActingProcessName contains \"\\\\java.exe\") and (TargetProcessName endswith \"\\\\AppVLP.exe\" or TargetProcessName endswith \"\\\\bash.exe\" or TargetProcessName endswith \"\\\\bitsadmin.exe\" or TargetProcessName endswith \"\\\\calc.exe\" or TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\curl.exe\" or TargetProcessName endswith \"\\\\forfiles.exe\" or TargetProcessName endswith \"\\\\mftrace.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\" or TargetProcessName endswith \"\\\\notepad.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\query.exe\" or TargetProcessName endswith \"\\\\reg.exe\" or TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessName endswith \"\\\\scrcons.exe\" or TargetProcessName endswith \"\\\\sh.exe\" or TargetProcessName endswith \"\\\\systeminfo.exe\" or TargetProcessName endswith \"\\\\whoami.exe\" or TargetProcessName endswith \"\\\\wmic.exe\" or TargetProcessName endswith \"\\\\wscript.exe\")) and (not(((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") and TargetProcessCommandLine contains \" stop\"))))|extend RuleId=\"cea2b7ea-792b-405f-95a1-b903ea06458f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_java_manageengine_susp_child_process.yml\"|extend RuleTitle=\"Suspicious Child Process Of Manage Engine ServiceDesk\"|extend RuleDescription=\"Detects suspicious child processes of the \\\"Manage Engine ServiceDesk Plus\\\" Java web service\";\nlet q2=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\java.exe\" and (TargetProcessName endswith \"\\\\AppVLP.exe\" or TargetProcessName endswith \"\\\\bitsadmin.exe\" or TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\curl.exe\" or TargetProcessName endswith \"\\\\forfiles.exe\" or TargetProcessName endswith \"\\\\hh.exe\" or TargetProcessName endswith \"\\\\mftrace.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\" or TargetProcessName endswith \"\\\\query.exe\" or TargetProcessName endswith \"\\\\reg.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessName endswith \"\\\\scrcons.exe\" or TargetProcessName endswith \"\\\\scriptrunner.exe\" or TargetProcessName endswith \"\\\\sh.exe\" or TargetProcessName endswith \"\\\\systeminfo.exe\" or TargetProcessName endswith \"\\\\whoami.exe\" or TargetProcessName endswith \"\\\\wmic.exe\" or TargetProcessName endswith \"\\\\wscript.exe\"))|extend RuleId=\"0d34ed8b-1c12-4ff2-828c-16fc860b766d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_java_susp_child_process.yml\"|extend RuleTitle=\"Suspicious Processes Spawned by Java.EXE\"|extend RuleDescription=\"Detects suspicious processes spawned from a Java host process which could indicate a sign of exploitation (e.g. log4j)\";\nlet q3=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\kd.exe\" or TargetProcessFilename =~ \"kd.exe\")|extend RuleId=\"27ee9438-90dc-4bef-904b-d3ef927f5e7e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_kd_execution.yml\"|extend RuleTitle=\"Windows Kernel Debugger Execution\"|extend RuleDescription=\"Detects execution of the Windows Kernel Debugger \\\"kd.exe\\\".\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\logman.exe\" or TargetProcessFilename =~ \"Logman.exe\") and (TargetProcessCommandLine contains \"stop \" or TargetProcessCommandLine contains \"delete \") and (TargetProcessCommandLine contains \"Circular Kernel Context Logger\" or TargetProcessCommandLine contains \"EventLog-\" or TargetProcessCommandLine contains \"SYSMON TRACE\" or TargetProcessCommandLine contains \"SysmonDnsEtwSession\"))|extend RuleId=\"cd1f961e-0b96-436b-b7c6-38da4583ec00\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_logman_disable_eventlog.yml\"|extend RuleTitle=\"Suspicious Windows Trace ETW Session Tamper Via Logman.EXE\"|extend RuleDescription=\"Detects the execution of \\\"logman\\\" utility in order to disable or delete Windows trace sessions\";\nlet q5=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\dctask64.exe\" and (not(TargetProcessCommandLine contains \"DesktopCentral_Agent\\\\agent\")))|extend RuleId=\"6345b048-8441-43a7-9bed-541133633d7a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_dctask64_proc_inject.yml\"|extend RuleTitle=\"ZOHO Dctask64 Process Injection\"|extend RuleDescription=\"Detects suspicious process injection using ZOHO's dctask64.exe\";\nlet q6=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\devtoolslauncher.exe\" and TargetProcessCommandLine contains \"LaunchForDeploy\")|extend RuleId=\"cc268ac1-42d9-40fd-9ed3-8c4e1a5b87e6\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_devtoolslauncher.yml\"|extend RuleTitle=\"Devtoolslauncher.exe Executes Specified Binary\"|extend RuleDescription=\"The Devtoolslauncher.exe executes other binary\";\nlet q7=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\xwizard.exe\" and (not(TargetProcessName startswith \"C:\\\\Windows\\\\System32\\\\\")))|extend RuleId=\"193d5ccd-6f59-40c6-b5b0-8e32d5ddd3d1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_dll_sideload_xwizard.yml\"|extend RuleTitle=\"Xwizard DLL Sideloading\"|extend RuleDescription=\"Detects the execution of Xwizard tool from the non-default directory which can be used to sideload a custom xwizards.dll\";\nlet q8=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\dump64.exe\" and (not(TargetProcessName contains \"\\\\Installer\\\\Feedback\\\\dump64.exe\"))) or (TargetProcessName endswith \"\\\\dump64.exe\" and (TargetProcessCommandLine contains \" -ma \" or TargetProcessCommandLine contains \"accepteula\")))|extend RuleId=\"129966c9-de17-4334-a123-8b58172e664d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_dump64.yml\"|extend RuleTitle=\"Suspicious Dump64.exe Execution\"|extend RuleDescription=\"Detects when a user bypasses Defender by renaming a tool to dump64.exe and placing it in a Visual Studio folder\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\format.com\" and TargetProcessCommandLine contains \"/fs:\") and (not((TargetProcessCommandLine contains \"/fs:FAT\" or TargetProcessCommandLine contains \"/fs:exFAT\" or TargetProcessCommandLine contains \"/fs:NTFS\" or TargetProcessCommandLine contains \"/fs:UDF\" or TargetProcessCommandLine contains \"/fs:ReFS\"))))|extend RuleId=\"9fb6b26e-7f9e-4517-a48b-8cac4a1b6c60\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_format.yml\"|extend RuleTitle=\"Format.com FileSystem LOLBIN\"|extend RuleDescription=\"Detects the execution of format.com with a suspicious filesystem selection that could indicate a defense evasion activity in which format.com is used to load malicious DLL files or other programs\";\nlet q10=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \" run run-cmd \" and (not((ActingProcessName endswith \"\\\\kavremover.exe\" or ActingProcessName endswith \"\\\\cleanapi.exe\"))))|extend RuleId=\"d047726b-c71c-4048-a99b-2e2f50dc107d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_kavremover.yml\"|extend RuleTitle=\"Kavremover Dropped Binary LOLBIN Usage\"|extend RuleDescription=\"Detects the execution of a signed binary dropped by Kaspersky Lab Products Remover (kavremover) which can be abused as a LOLBIN to execute arbitrary commands and binaries.\";\nlet q11=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\wscript.exe\" or TargetProcessFilename =~ \"wscript.exe\") and TargetProcessCommandLine contains \"manage-bde.wsf\") or (((ActingProcessName endswith \"\\\\cscript.exe\" or ActingProcessName endswith \"\\\\wscript.exe\") and ActingProcessCommandLine contains \"manage-bde.wsf\") and (not(TargetProcessName endswith \"\\\\cmd.exe\"))))|extend RuleId=\"c363385c-f75d-4753-a108-c1a8e28bdbda\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_manage_bde.yml\"|extend RuleTitle=\"Potential Manage-bde.wsf Abuse To Proxy Execution\"|extend RuleDescription=\"Detects potential abuse of the \\\"manage-bde.wsf\\\" script as a LOLBIN to proxy execution\";\nlet q12=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \" /INJECTRUNNING \" and (not(ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\AppVClient.exe\")))|extend RuleId=\"4f73421b-5a0b-4bbf-a892-5a7fb99bea66\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_mavinject_process_injection.yml\"|extend RuleTitle=\"Mavinject Inject DLL Into Running Process\"|extend RuleDescription=\"Detects process injection using the signed Windows tool \\\"Mavinject\\\" via the \\\"INJECTRUNNING\\\" flag\";\nlet q13=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\mpiexec.exe\" or TargetProcessIMPHASH =~ \"d8b52ef6aaa3a81501bdfff9dbb96217\" or TargetProcessIMPHASH=~\"d8b52ef6aaa3a81501bdfff9dbb96217\") and (TargetProcessCommandLine contains \" /n 1 \" or TargetProcessCommandLine contains \" -n 1 \"))|extend RuleId=\"729ce0ea-5d8f-4769-9762-e35de441586d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_mpiexec.yml\"|extend RuleTitle=\"MpiExec Lolbin\"|extend RuleDescription=\"Detects a certain command line flag combination used by mpiexec.exe LOLBIN from HPC pack that can be used to execute any other binary\";\nlet q14=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\msdt.exe\" and TargetProcessCommandLine contains \"\\\\WINDOWS\\\\diagnostics\\\\index\\\\PCWDiagnostic.xml\") and (TargetProcessCommandLine contains \" -af \" or TargetProcessCommandLine contains \" /af \")) and (not(ActingProcessName endswith \"\\\\pcwrun.exe\")))|extend RuleId=\"9c8c7000-3065-44a8-a555-79bcba5d9955\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_msdt_answer_file.yml\"|extend RuleTitle=\"Execute MSDT Via Answer File\"|extend RuleDescription=\"Detects execution of \\\"msdt.exe\\\" using an answer file which is simulating the legitimate way of calling msdt via \\\"pcwrun.exe\\\" (For example from the compatibility tab)\";\nlet q15=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\OpenWith.exe\" and TargetProcessCommandLine contains \"/c\")|extend RuleId=\"cec8e918-30f7-4e2d-9bfa-a59cc97ae60f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_openwith.yml\"|extend RuleTitle=\"OpenWith.exe Executes Specified Binary\"|extend RuleDescription=\"The OpenWith.exe executes other binary\";\nlet q16=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\pcwrun.exe\" and TargetProcessCommandLine contains \"../\")|extend RuleId=\"6004abd0-afa4-4557-ba90-49d172e0a299\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_pcwrun_follina.yml\"|extend RuleTitle=\"Execute Pcwrun.EXE To Leverage Follina\"|extend RuleDescription=\"Detects indirect command execution via Program Compatibility Assistant \\\"pcwrun.exe\\\" leveraging the follina (CVE-2022-30190) vulnerability\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["CommandAndControl", "PrivilegeEscalation", "InitialAccess", "DefenseEvasion", "CredentialAccess", "Persistence", "Execution"],
                "techniques": ["T1003", "T1070", "T1055", "T1216", "T1127", "T1102", "T1574", "T1562", "T1218"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000211",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}