{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000221')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000221')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 21",
                "description": "Sigma Windows Process Creation medium 21",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (((TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\") or (TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\")) and (TargetProcessCommandLine contains \" Net.Sockets.TCPClient\" and TargetProcessCommandLine contains \".GetStream(\" and TargetProcessCommandLine contains \".Write(\"))|extend RuleId=\"edc2f8ae-2412-4dfd-b9d5-0c57727e70be\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_reverse_shell_connection.yml\"|extend RuleTitle=\"Potential Powershell ReverseShell Connection\"|extend RuleDescription=\"Detects usage of the \\\"TcpClient\\\" class. Which can be abused to establish remote connections and reverse-shells. As seen used by the Nishang \\\"Invoke-PowerShellTcpOneLine\\\" reverse shell and other.\";\nlet q1=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\powershell.exe\" or ActingProcessName endswith \"\\\\pwsh.exe\") and (TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") and (TargetProcessCommandLine contains \"Get-Content\" and TargetProcessCommandLine contains \"-Stream\"))|extend RuleId=\"45a594aa-1fbd-4972-a809-ff5a99dd81b8\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_run_script_from_ads.yml\"|extend RuleTitle=\"Run PowerShell Script from ADS\"|extend RuleDescription=\"Detects PowerShell script execution from Alternate Data Stream (ADS)\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") and TargetProcessCommandLine matches regex \"\\\\s-\\\\s*<\")|extend RuleId=\"c83bf4b5-cdf0-437c-90fa-43d734f7c476\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_run_script_from_input_stream.yml\"|extend RuleTitle=\"Run PowerShell Script from Redirected Input Stream\"|extend RuleDescription=\"Detects PowerShell script execution via input stream redirect\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"\\\\HarddiskVolumeShadowCopy\" and TargetProcessCommandLine contains \"System32\\\\config\\\\sam\") and (TargetProcessCommandLine contains \"Copy-Item\" or TargetProcessCommandLine contains \"cp $_.\" or TargetProcessCommandLine contains \"cpi $_.\" or TargetProcessCommandLine contains \"copy $_.\" or TargetProcessCommandLine contains \".File]::Copy(\"))|extend RuleId=\"1af57a4b-460a-4738-9034-db68b880c665\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_sam_access.yml\"|extend RuleTitle=\"PowerShell SAM Copy\"|extend RuleDescription=\"Detects suspicious PowerShell scripts accessing SAM hives\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessFilename =~ \"pwsh.dll\") and (TargetProcessCommandLine contains \"-SecurityDescriptorSddl \" or TargetProcessCommandLine contains \"-sd \") and ((TargetProcessCommandLine contains \"Set-Service \" and TargetProcessCommandLine contains \"D;;\") and (TargetProcessCommandLine contains \";;;IU\" or TargetProcessCommandLine contains \";;;SU\" or TargetProcessCommandLine contains \";;;BA\" or TargetProcessCommandLine contains \";;;SY\" or TargetProcessCommandLine contains \";;;WD\")))|extend RuleId=\"a95b9b42-1308-4735-a1af-abb1c5e6f5ac\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_service_dacl_modification_set_service.yml\"|extend RuleTitle=\"Suspicious Service DACL Modification Via Set-Service Cmdlet\"|extend RuleDescription=\"Detects suspicious DACL modifications via the \\\"Set-Service\\\" cmdlet using the \\\"SecurityDescriptorSddl\\\" flag (Only available with PowerShell 7) that can be used to hide services or make them unstopable\";\nlet q5=_Im_ProcessCreate\n| where (((TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\") or (TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\")) and (TargetProcessCommandLine contains \"Set-Acl \" and TargetProcessCommandLine contains \"-AclObject \" and TargetProcessCommandLine contains \"-Path \"))|extend RuleId=\"bdeb2cff-af74-4094-8426-724dc937f20a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_set_acl.yml\"|extend RuleTitle=\"PowerShell Script Change Permission Via Set-Acl\"|extend RuleDescription=\"Detects PowerShell execution to set the ACL of a file or a folder\";\nlet q6=_Im_ProcessCreate\n| where (((TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\") or (TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\")) and (TargetProcessCommandLine contains \"Set-Acl \" and TargetProcessCommandLine contains \"-AclObject \") and (TargetProcessCommandLine contains \"-Path \\\"C:\\\\Windows\" or TargetProcessCommandLine contains \"-Path 'C:\\\\Windows\" or TargetProcessCommandLine contains \"-Path %windir%\" or TargetProcessCommandLine contains \"-Path $env:windir\") and (TargetProcessCommandLine contains \"FullControl\" or TargetProcessCommandLine contains \"Allow\"))|extend RuleId=\"0944e002-e3f6-4eb5-bf69-3a3067b53d73\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_set_acl_susp_location.yml\"|extend RuleTitle=\"PowerShell Set-Acl On Windows Folder\"|extend RuleDescription=\"Detects PowerShell scripts to set the ACL to a file in the Windows folder\";\nlet q7=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"Get-WmiObject\" or TargetProcessCommandLine contains \"gwmi\" or TargetProcessCommandLine contains \"Get-CimInstance\" or TargetProcessCommandLine contains \"gcim\") and TargetProcessCommandLine contains \"Win32_Shadowcopy\" and (TargetProcessCommandLine contains \".Delete()\" or TargetProcessCommandLine contains \"Remove-WmiObject\" or TargetProcessCommandLine contains \"rwmi\" or TargetProcessCommandLine contains \"Remove-CimInstance\" or TargetProcessCommandLine contains \"rcim\"))|extend RuleId=\"21ff4ca9-f13a-41ad-b828-0077b2af2e40\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_shadowcopy_deletion.yml\"|extend RuleTitle=\"Deletion of Volume Shadow Copies via WMI with PowerShell\"|extend RuleDescription=\"Detects deletion of Windows Volume Shadow Copies with PowerShell code and Get-WMIObject. This technique is used by numerous ransomware families such as Sodinokibi/REvil\";\nlet q8=_Im_ProcessCreate\n| where ((((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and TargetProcessCommandLine contains \"Add-PSSnapin\" and (TargetProcessCommandLine contains \"Microsoft.Exchange.Powershell.Snapin\" or TargetProcessCommandLine contains \"Microsoft.Exchange.Management.PowerShell.SnapIn\")) and (not((ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\msiexec.exe\" and TargetProcessCommandLine contains \"$exserver=Get-ExchangeServer ([Environment]::MachineName) -ErrorVariable exerr 2> $null\"))))|extend RuleId=\"25676e10-2121-446e-80a4-71ff8506af47\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_snapins_hafnium.yml\"|extend RuleTitle=\"Exchange PowerShell Snap-Ins Usage\"|extend RuleDescription=\"Detects adding and using Exchange PowerShell snap-ins to export mailbox data. As seen used by HAFNIUM and APT27\";\nlet q9=_Im_ProcessCreate\n| where (((ActingProcessName endswith \"\\\\powershell_ise.exe\" or ActingProcessName endswith \"\\\\powershell.exe\" or ActingProcessName endswith \"\\\\pwsh.exe\") and (TargetProcessName endswith \"\\\\bash.exe\" or TargetProcessName endswith \"\\\\bitsadmin.exe\" or TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\forfiles.exe\" or TargetProcessName endswith \"\\\\hh.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessName endswith \"\\\\scrcons.exe\" or TargetProcessName endswith \"\\\\scriptrunner.exe\" or TargetProcessName endswith \"\\\\sh.exe\" or TargetProcessName endswith \"\\\\wmic.exe\" or TargetProcessName endswith \"\\\\wscript.exe\")) and (not((ActingProcessCommandLine contains \"\\\\Program Files\\\\Amazon\\\\WorkspacesConfig\\\\Scripts\\\\\" and TargetProcessCommandLine contains \"\\\\Program Files\\\\Amazon\\\\WorkspacesConfig\\\\Scripts\\\\\"))))|extend RuleId=\"e4b6d2a7-d8a4-4f19-acbd-943c16d90647\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_susp_child_processes.yml\"|extend RuleTitle=\"Potentially Suspicious PowerShell Child Processes\"|extend RuleDescription=\"Detects potentially suspicious child processes spawned by PowerShell\";\nlet q10=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"IEX ((New-Object Net.WebClient).DownloadString\" or TargetProcessCommandLine contains \"IEX (New-Object Net.WebClient).DownloadString\" or TargetProcessCommandLine contains \"IEX((New-Object Net.WebClient).DownloadString\" or TargetProcessCommandLine contains \"IEX(New-Object Net.WebClient).DownloadString\" or TargetProcessCommandLine contains \" -command (New-Object System.Net.WebClient).DownloadFile(\" or TargetProcessCommandLine contains \" -c (New-Object System.Net.WebClient).DownloadFile(\")|extend RuleId=\"e6c54d94-498c-4562-a37c-b469d8e9a275\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_susp_download_patterns.yml\"|extend RuleTitle=\"Suspicious PowerShell Download and Execute Pattern\"|extend RuleDescription=\"Detects suspicious PowerShell download patterns that are often used in malicious scripts, stagers or downloaders (make sure that your backend applies the strings case-insensitive)\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Persistence", "Collection", "PrivilegeEscalation", "DefenseEvasion", "CredentialAccess", "Impact", "Execution"],
                "techniques": ["T1564", "T1114", "T1003", "T1059", "T1490", "T1543"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000221",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}