{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A5163A100')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A5163A100')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 00",
                "description": "Sigma Windows Process Creation low 00",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessFileDescription contains \"7-Zip\" or (TargetProcessName endswith \"\\\\7z\\.exe\" or TargetProcessName endswith \"\\\\7zr\\.exe\" or TargetProcessName endswith \"\\\\7za\\.exe\") or (TargetProcessFilename =~ \"7z\\.exe\" or TargetProcessFilename =~ \"7za\\.exe\")) and (TargetProcessCommandLine contains \"\\.dmp\" or TargetProcessCommandLine contains \"\\.dump\" or TargetProcessCommandLine contains \"\\.hdmp\"))|extend RuleId=\"ec570e53-4c76-45a9-804d-dc3f355ff7a7\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_7zip_exfil_dmp_files.yml\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessFileDescription contains \"7-Zip\" or (TargetProcessName endswith \"\\\\7z\\.exe\" or TargetProcessName endswith \"\\\\7zr\\.exe\" or TargetProcessName endswith \"\\\\7za\\.exe\") or (TargetProcessFilename =~ \"7z\\.exe\" or TargetProcessFilename =~ \"7za\\.exe\")) and TargetProcessCommandLine contains \" -p\" and (TargetProcessCommandLine contains \" a \" or TargetProcessCommandLine contains \" u \"))|extend RuleId=\"9fbf5927-5261-4284-a71d-f681029ea574\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_7zip_password_compression.yml\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessFileDescription contains \"7-Zip\" or (TargetProcessName endswith \"\\\\7z\\.exe\" or TargetProcessName endswith \"\\\\7zr\\.exe\" or TargetProcessName endswith \"\\\\7za\\.exe\") or (TargetProcessFilename =~ \"7z\\.exe\" or TargetProcessFilename =~ \"7za\\.exe\")) and (TargetProcessCommandLine contains \" -p\" and TargetProcessCommandLine contains \" x \" and TargetProcessCommandLine contains \" -o\"))|extend RuleId=\"b717b8fd-6467-4d7d-b3d3-27f9a463af77\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_7zip_password_extraction.yml\";\nlet q3=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\addinutil\\.exe\" and (not((TargetProcessName endswith \":\\\\Windows\\\\System32\\\\conhost\\.exe\" or TargetProcessName endswith \":\\\\Windows\\\\System32\\\\werfault\\.exe\" or TargetProcessName endswith \":\\\\Windows\\\\SysWOW64\\\\werfault\\.exe\"))))|extend RuleId=\"b5746143-59d6-4603-8d06-acbd60e166ee\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_addinutil_uncommon_child_process.yml\";\nlet q4=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\addinutil\\.exe\" or TargetProcessFilename =~ \"AddInUtil\\.exe\") and (TargetProcessCommandLine contains \"-AddInRoot:\" or TargetProcessCommandLine contains \"-PipelineRoot:\")) and (not((TargetProcessCommandLine contains \"-AddInRoot:\\\"C:\\\\Program Files (x86)\\\\Common Files\\\\Microsoft Shared\\\\VSTA\" or TargetProcessCommandLine contains \"-AddInRoot:C:\\\\Program Files (x86)\\\\Common Files\\\\Microsoft Shared\\\\VSTA\" or TargetProcessCommandLine contains \"-PipelineRoot:\\\"C:\\\\Program Files (x86)\\\\Common Files\\\\Microsoft Shared\\\\VSTA\" or TargetProcessCommandLine contains \"-PipelineRoot:C:\\\\Program Files (x86)\\\\Common Files\\\\Microsoft Shared\\\\VSTA\"))))|extend RuleId=\"4f2cd9b6-4a17-440f-bb2a-687abb65993a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_addinutil_uncommon_cmdline.yml\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\addinutil\\.exe\" or TargetProcessFilename =~ \"AddInUtil\\.exe\") and (not((TargetProcessName contains \":\\\\Windows\\\\Microsoft\\.NET\\\\Framework\\\\\" or TargetProcessName contains \":\\\\Windows\\\\Microsoft\\.NET\\\\Framework64\\\\\" or TargetProcessName contains \":\\\\Windows\\\\WinSxS\\\\\"))))|extend RuleId=\"6120ac2a-a34b-42c0-a9bd-1fb9f459f348\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_addinutil_uncommon_dir_exec.yml\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessName =~ \"\\\\AgentExecutor\\.exe\" or TargetProcessFilename =~ \"AgentExecutor\\.exe\") and (TargetProcessCommandLine contains \" -powershell\" or TargetProcessCommandLine contains \" -remediationScript\"))|extend RuleId=\"7efd2c8d-8b18-45b7-947d-adfe9ed04f61\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_agentexecutor_potential_abuse.yml\";\nlet q7=_Im_ProcessCreate\n| where ((TargetProcessName contains \"C:\\\\Windows\\\\Microsoft\\.NET\\\\Framework\\\\\" or TargetProcessName contains \"C:\\\\Windows\\\\Microsoft\\.NET\\\\Framework64\\\\\") and TargetProcessName endswith \"\\\\aspnet_compiler\\.exe\")|extend RuleId=\"a01b8329-5953-4f73-ae2d-aa01e1f35f00\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_aspnet_compiler_exectuion.yml\";\nlet q8=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\attrib\\.exe\" or TargetProcessFilename =~ \"ATTRIB\\.EXE\") and TargetProcessCommandLine contains \" +h \") and (not((TargetProcessCommandLine contains \"\\\\desktop\\.ini \" or (ActingProcessName endswith \"\\\\cmd\\.exe\" and TargetProcessCommandLine =~ \"+R +H +S +A \\\\\\*\\.cui\" and ActingProcessCommandLine =~ \"C:\\\\WINDOWS\\\\system32\\\\\\*\\.bat\")))))|extend RuleId=\"4281cb20-2994-4580-aa63-c8b86d019934\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_attrib_hiding_files.yml\";\nlet q9=_Im_ProcessCreate\n| where (((TargetProcessName endswith \":\\\\Windows\\\\System32\\\\bash\\.exe\" or TargetProcessName endswith \":\\\\Windows\\\\SysWOW64\\\\bash\\.exe\") or TargetProcessFilename =~ \"Bash\\.exe\") and TargetProcessCommandLine contains \" -c \")|extend RuleId=\"5edc2273-c26f-406c-83f3-f4d948e740dd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_bash_command_execution.yml\";\nlet q10=_Im_ProcessCreate\n| where (((TargetProcessName endswith \":\\\\Windows\\\\System32\\\\bash\\.exe\" or TargetProcessName endswith \":\\\\Windows\\\\SysWOW64\\\\bash\\.exe\") or TargetProcessFilename =~ \"Bash\\.exe\") and (not(((TargetProcessCommandLine contains \"bash\\.exe -\" or TargetProcessCommandLine contains \"bash -\") or isnull(TargetProcessCommandLine) or TargetProcessCommandLine =~ \"\" or (TargetProcessCommandLine =~ \"bash\\.exe\" or TargetProcessCommandLine =~ \"bash\")))))|extend RuleId=\"2d22a514-e024-4428-9dba-41505bd63a5b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_bash_file_execution.yml\";\nlet q11=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\bcdedit\\.exe\" or TargetProcessFilename =~ \"bcdedit\\.exe\") and (TargetProcessCommandLine contains \"delete\" or TargetProcessCommandLine contains \"deletevalue\" or TargetProcessCommandLine contains \"import\" or TargetProcessCommandLine contains \"safeboot\" or TargetProcessCommandLine contains \"network\"))|extend RuleId=\"c9fbe8e9-119d-40a6-9b59-dd58a5d84429\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_bcdedit_susp_execution.yml\";\nlet q12=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\bginfo\\.exe\" or ActingProcessName endswith \"\\\\bginfo64\\.exe\")|extend RuleId=\"aaf46cdc-934e-4284-b329-34aa701e3771\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_bginfo_uncommon_child_process.yml\";\nlet q13=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\bitsadmin\\.exe\" or TargetProcessFilename =~ \"bitsadmin\\.exe\") and (TargetProcessCommandLine contains \" /transfer \" or ((TargetProcessCommandLine contains \" /create \" or TargetProcessCommandLine contains \" /addfile \") and TargetProcessCommandLine contains \"http\")))|extend RuleId=\"d059842b-6b9d-4ed1-b5c3-5b89143c6ede\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_bitsadmin_download.yml\";\nlet q14=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\bitsadmin\\.exe\" or TargetProcessFilename =~ \"bitsadmin\\.exe\") and (TargetProcessCommandLine contains \" /transfer \" or TargetProcessCommandLine contains \" /create \" or TargetProcessCommandLine contains \" /addfile \") and (TargetProcessCommandLine contains \"%AppData%\" or TargetProcessCommandLine contains \"%temp%\" or TargetProcessCommandLine contains \"%tmp%\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\\" or TargetProcessCommandLine contains \"C:\\\\Windows\\\\Temp\\\\\"))|extend RuleId=\"6e30c82f-a9f8-4aab-b79c-7c12bce6f248\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_bitsadmin_download_uncommon_targetfolder.yml\";\nlet q15=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \"bitsadmin\" and TargetProcessCommandLine contains \"/SetNotifyCmdLine\") and (TargetProcessCommandLine contains \"%COMSPEC%\" or TargetProcessCommandLine contains \"cmd\\.exe\" or TargetProcessCommandLine contains \"regsvr32\\.exe\")) or ((TargetProcessCommandLine contains \"bitsadmin\" and TargetProcessCommandLine contains \"/Addfile\") and (TargetProcessCommandLine contains \"http:\" or TargetProcessCommandLine contains \"https:\" or TargetProcessCommandLine contains \"ftp:\" or TargetProcessCommandLine contains \"ftps:\")))|extend RuleId=\"b9cbbc17-d00d-4e3d-a827-b06d03d2380d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_bitsadmin_potential_persistence.yml\";\nlet q16=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\brave\\.exe\" or TargetProcessName endswith \"\\\\chrome\\.exe\" or TargetProcessName endswith \"\\\\msedge\\.exe\" or TargetProcessName endswith \"\\\\opera\\.exe\" or TargetProcessName endswith \"\\\\vivaldi\\.exe\") and TargetProcessCommandLine contains \"--headless\")|extend RuleId=\"ef9dcfed-690c-4c5d-a9d1-482cd422225c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_browsers_chromium_headless_exec.yml\";\nlet q17=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\brave\\.exe\" or TargetProcessName endswith \"\\\\chrome\\.exe\" or TargetProcessName endswith \"\\\\msedge\\.exe\" or TargetProcessName endswith \"\\\\opera\\.exe\" or TargetProcessName endswith \"\\\\vivaldi\\.exe\") and TargetProcessCommandLine contains \" http\" and (TargetProcessCommandLine contains \"\\.dat\" or TargetProcessCommandLine contains \"\\.dll\" or TargetProcessCommandLine contains \"\\.exe\" or TargetProcessCommandLine contains \"\\.hta\" or TargetProcessCommandLine contains \"\\.ps1\" or TargetProcessCommandLine contains \"\\.txt\" or TargetProcessCommandLine contains \"\\.vbe\" or TargetProcessCommandLine contains \"\\.vbs\" or TargetProcessCommandLine contains \"\\.zip\"))|extend RuleId=\"94771a71-ba41-4b6e-a757-b531372eaab6\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_browsers_inline_file_download.yml\";\nlet q18=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\msedge\\.exe\" or TargetProcessFilename =~ \"msedge\\.exe\") and (TargetProcessCommandLine contains \"\\.exe http\" or TargetProcessCommandLine contains \"msedge http\"))|extend RuleId=\"94771a71-ba41-4b6e-a757-b531372eaab6\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_browsers_msedge_arbitrary_download.yml\";\nlet q19=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \" --remote-debugging-\" or (TargetProcessName endswith \"\\\\firefox\\.exe\" and TargetProcessCommandLine contains \" -start-debugger-server\"))|extend RuleId=\"b3d34dc5-2efd-4ae3-845f-8ec14921f449\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_browsers_remote_debugging.yml\";\nlet q20=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\CertMgr\\.exe\" or TargetProcessFilename =~ \"CERTMGT\\.EXE\") and (TargetProcessCommandLine contains \"/add\" and TargetProcessCommandLine contains \"root\"))|extend RuleId=\"ff992eac-6449-4c60-8c1d-91c9722a1d48\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_certmgr_certificate_installation.yml\";\nlet q21=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\certoc\\.exe\" or TargetProcessFilename =~ \"CertOC\\.exe\") and (TargetProcessCommandLine contains \"-GetCACAPS\" and TargetProcessCommandLine contains \"http\"))|extend RuleId=\"70ad0861-d1fe-491c-a45f-fa48148a300d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_certoc_download.yml\";\nlet q22=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\certoc\\.exe\" or TargetProcessFilename =~ \"CertOC\\.exe\") and (TargetProcessCommandLine contains \" -LoadDLL \" or TargetProcessCommandLine contains \" /LoadDLL \"))|extend RuleId=\"242301bc-f92f-4476-8718-78004a6efd9f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_certoc_load_dll.yml\";\nlet q23=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\certutil\\.exe\" or TargetProcessFilename =~ \"CertUtil\\.exe\") and (TargetProcessCommandLine contains \"/addstore\" or TargetProcessCommandLine contains \"-addstore\") and TargetProcessCommandLine contains \"root\")|extend RuleId=\"d2125259-ddea-4c1c-9c22-977eb5b29cf0\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_certutil_certificate_installation.yml\";\nlet q24=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\certutil\\.exe\" or TargetProcessFilename =~ \"CertUtil\\.exe\") and (TargetProcessCommandLine contains \"-decode \" or TargetProcessCommandLine contains \"/decode \" or TargetProcessCommandLine contains \"-decodehex \" or TargetProcessCommandLine contains \"/decodehex \"))|extend RuleId=\"cc9cbe82-7bc0-4ef5-bc23-bbfb83947be7\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_certutil_decode.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19, q20, q21, q22, q23, q24;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "CredentialAccess", "CommandAndControl", "Collection", "Persistence", "Execution"],
                "techniques": ["T1560", "T1127", "T1553", "T1070", "T1027", "T1202", "T1564", "T1185", "T1105", "T1218", "T1036", "T1542", "T1059", "T1197"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A5163A100",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}