{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000241')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000241')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 41",
                "description": "Sigma Windows Process Creation medium 41",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetUsername contains \"AUTHORI\" or TargetUsername contains \"AUTORI\") and TargetProcessName endswith \"\\\\taskmgr.exe\")|extend RuleId=\"9fff585c-c33e-4a86-b3cd-39312079a65f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_taskmgr_localsystem.yml\"|extend RuleTitle=\"Taskmgr as LOCAL_SYSTEM\"|extend RuleDescription=\"Detects the creation of taskmgr.exe process in context of LOCAL_SYSTEM\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"\\\\Microsoft\\\\Teams\\\\Cookies\" or TargetProcessCommandLine contains \"\\\\Microsoft\\\\Teams\\\\Local Storage\\\\leveldb\") and (not(TargetProcessName endswith \"\\\\Microsoft\\\\Teams\\\\current\\\\Teams.exe\")))|extend RuleId=\"d2eb17db-1d39-41dc-b57f-301f6512fa75\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_teams_suspicious_command_line_cred_access.yml\"|extend RuleTitle=\"Suspicious Command With Teams Objects Paths\"|extend RuleDescription=\"Detects an access to authentication tokens and accounts of Microsoft Teams desktop application.\";\nlet q2=_Im_ProcessCreate\n| where ((TargetUsername contains \"AUTHORI\" or TargetUsername contains \"AUTORI\") and TargetProcessName endswith \"\\\\tscon.exe\")|extend RuleId=\"9847f263-4a81-424f-970c-875dab15b79b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_tscon_localsystem.yml\"|extend RuleTitle=\"Suspicious TSCON Start as SYSTEM\"|extend RuleDescription=\"Detects a tscon.exe start as LOCAL SYSTEM\";\nlet q3=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \" /dest:rdp-tcp#\"|extend RuleId=\"f72aa3e8-49f9-4c7d-bd74-f8ab84ff9bbb\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_tscon_rdp_redirect.yml\"|extend RuleTitle=\"Suspicious RDP Redirect Using TSCON\"|extend RuleDescription=\"Detects a suspicious RDP session redirect using tscon.exe\";\nlet q4=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\changepk.exe\" and ActingProcessName endswith \"\\\\slui.exe\" and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\"))|extend RuleId=\"503d581c-7df0-4bbe-b9be-5840c0ecc1fc\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_changepk_slui.yml\"|extend RuleTitle=\"UAC Bypass Using ChangePK and SLUI\"|extend RuleDescription=\"Detects an UAC bypass that uses changepk.exe and slui.exe (UACMe 61)\";\nlet q5=_Im_ProcessCreate\n| where (TargetProcessCommandLine endswith \"\\\"\\\\system32\\\\cleanmgr.exe /autoclean /d C:\" and ActingProcessCommandLine =~ \"C:\\\\Windows\\\\system32\\\\svchost.exe -k netsvcs -p -s Schedule\" and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\"))|extend RuleId=\"b697e69c-746f-4a86-9f59-7bfff8eab881\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_cleanmgr.yml\"|extend RuleTitle=\"UAC Bypass Using Disk Cleanup\"|extend RuleDescription=\"Detects the pattern of UAC Bypass using scheduled tasks and variable expansion of cleanmgr.exe (UACMe 34)\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\cmstp.exe\" or TargetProcessFilename =~ \"CMSTP.EXE\") and (TargetProcessCommandLine contains \"/s\" or TargetProcessCommandLine contains \"-s\" or TargetProcessCommandLine contains \"/au\" or TargetProcessCommandLine contains \"-au\" or TargetProcessCommandLine contains \"/ni\" or TargetProcessCommandLine contains \"-ni\"))|extend RuleId=\"e66779cc-383e-4224-a3a4-267eeb585c40\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_cmstp.yml\"|extend RuleTitle=\"Bypass UAC via CMSTP\"|extend RuleDescription=\"Detect commandline usage of Microsoft Connection Manager Profile Installer (cmstp.exe) to install specially formatted local .INF files\";\nlet q7=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\DllHost.exe\" and (ActingProcessCommandLine contains \" /Processid:{3E5FC7F9-9A51-4367-9063-A120244FBEC7}\" or ActingProcessCommandLine contains \" /Processid:{3E000D72-A845-4CD9-BD83-80C07C3B881F}\" or ActingProcessCommandLine contains \" /Processid:{BD54C901-076B-434E-B6C7-17C531F4AB41}\" or ActingProcessCommandLine contains \" /Processid:{D2E7041B-2927-42FB-8E9F-7CE93B6DC937}\" or ActingProcessCommandLine contains \" /Processid:{E9495B87-D950-4AB5-87A5-FF6D70BF3E90}\") and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\"))|extend RuleId=\"4b60e6f2-bf39-47b4-b4ea-398e33cfe253\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_cmstp_com_object_access.yml\"|extend RuleTitle=\"CMSTP UAC Bypass via COM Object Access\"|extend RuleDescription=\"Detects UAC Bypass Attempt Using Microsoft Connection Manager Profile Installer Autoelevate-capable COM Objects (e.g. UACMe ID of 41, 43, 58 or 65)\";\nlet q8=_Im_ProcessCreate\n| where (((TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\") and TargetProcessName =~ \"C:\\\\Windows\\\\System32\\\\ComputerDefaults.exe\") and (not((ActingProcessName contains \":\\\\Windows\\\\System32\" or ActingProcessName contains \":\\\\Program Files\"))))|extend RuleId=\"3c05e90d-7eba-4324-9972-5d7f711a60a8\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_computerdefaults.yml\"|extend RuleTitle=\"UAC Bypass Tools Using ComputerDefaults\"|extend RuleDescription=\"Detects tools such as UACMe used to bypass UAC with computerdefaults.exe (UACMe 59)\";\nlet q9=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\consent.exe\" and TargetProcessName endswith \"\\\\werfault.exe\" and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\"))|extend RuleId=\"1ca6bd18-0ba0-44ca-851c-92ed89a61085\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_consent_comctl32.yml\"|extend RuleTitle=\"UAC Bypass Using Consent and Comctl32 - Process\"|extend RuleDescription=\"Detects the pattern of UAC Bypass using consent.exe and comctl32.dll (UACMe 22)\";\nlet q10=_Im_ProcessCreate\n| where ((ActingProcessName contains \"C:\\\\Users\\\\\" and ActingProcessName contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" and ActingProcessName contains \"\\\\DismHost.exe\") and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\"))|extend RuleId=\"853e74f9-9392-4935-ad3b-2e8c040dae86\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_dismhost.yml\"|extend RuleTitle=\"UAC Bypass Using DismHost\"|extend RuleDescription=\"Detects the pattern of UAC Bypass using DismHost DLL hijacking (UACMe 63)\";\nlet q11=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\eventvwr.exe\" and (not((TargetProcessName endswith \"\\\\mmc.exe\" or TargetProcessName endswith \":\\\\Windows\\\\SysWOW64\\\\WerFault.exe\" or TargetProcessName endswith \":\\\\Windows\\\\System32\\\\WerFault.exe\"))))|extend RuleId=\"be344333-921d-4c4d-8bb8-e584cf584780\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_eventvwr.yml\"|extend RuleTitle=\"UAC Bypass via Event Viewer\"|extend RuleDescription=\"Detects UAC bypass method using Windows event viewer\";\nlet q12=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"\\\\Event Viewer\\\\RecentViews\" or TargetProcessCommandLine contains \"\\\\EventV~1\\\\RecentViews\") and TargetProcessCommandLine contains \">\")|extend RuleId=\"30fc8de7-d833-40c4-96b6-28319fbc4f6c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_eventvwr_recentviews.yml\"|extend RuleTitle=\"UAC Bypass Using Event Viewer RecentViews\"|extend RuleDescription=\"Detects the pattern of UAC Bypass using Event Viewer RecentViews\";\nlet q13=_Im_ProcessCreate\n| where ActingProcessName endswith \"\\\\fodhelper.exe\"|extend RuleId=\"7f741dcf-fc22-4759-87b4-9ae8376676a2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_fodhelper.yml\"|extend RuleTitle=\"Bypass UAC via Fodhelper.exe\"|extend RuleDescription=\"Identifies use of Fodhelper.exe to bypass User Account Control. Adversaries use this technique to execute privileged processes.\";\nlet q14=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\dllhost.exe\" and (ActingProcessCommandLine contains \"/Processid:{3E5FC7F9-9A51-4367-9063-A120244FBEC7}\" or ActingProcessCommandLine contains \"/Processid:{D2E7041B-2927-42FB-8E9F-7CE93B6DC937}\")) and (not((TargetProcessName endswith \"\\\\WerFault.exe\" or TargetProcessFilename =~ \"WerFault.exe\"))))|extend RuleId=\"49f2f17b-b4c8-4172-a68b-d5bf95d05130\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_icmluautil.yml\"|extend RuleTitle=\"UAC Bypass via ICMLuaUtil\"|extend RuleDescription=\"Detects the pattern of UAC Bypass using ICMLuaUtil Elevated COM interface\";\nlet q15=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\DllHost.exe\" and ActingProcessCommandLine contains \" /Processid:{12C21EA7-2EB8-4B55-9249-AC243DA8C666}\" and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\"))|extend RuleId=\"4cbef972-f347-4170-b62a-8253f6168e6d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_idiagnostic_profile.yml\"|extend RuleTitle=\"UAC Bypass Using IDiagnostic Profile\"|extend RuleDescription=\"Detects the \\\"IDiagnosticProfileUAC\\\" UAC bypass technique\";\nlet q16=_Im_ProcessCreate\n| where ((TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\") and ActingProcessName endswith \"\\\\ieinstal.exe\" and TargetProcessName contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" and TargetProcessName endswith \"consent.exe\")|extend RuleId=\"80fc36aa-945e-4181-89f2-2f907ab6775d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_ieinstal.yml\"|extend RuleTitle=\"UAC Bypass Using IEInstal - Process\"|extend RuleDescription=\"Detects the pattern of UAC Bypass using IEInstal.exe (UACMe 64)\";\nlet q17=_Im_ProcessCreate\n| where ((TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\") and ActingProcessName endswith \"\\\\AppData\\\\Local\\\\Temp\\\\pkgmgr.exe\" and TargetProcessCommandLine =~ \"\\\"C:\\\\Windows\\\\system32\\\\msconfig.exe\\\" -5\")|extend RuleId=\"ad92e3f9-7eb6-460e-96b1-582b0ccbb980\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_msconfig_gui.yml\"|extend RuleTitle=\"UAC Bypass Using MSConfig Token Modification - Process\"|extend RuleDescription=\"Detects the pattern of UAC Bypass using a msconfig GUI hack (UACMe 55)\";\nlet q18=_Im_ProcessCreate\n| where ((TargetProcessCommandLine startswith \"\\\"C:\\\\Windows\\\\system32\\\\wusa.exe\\\"  /quiet C:\\\\Users\\\\\" and TargetProcessCommandLine endswith \"\\\\AppData\\\\Local\\\\Temp\\\\update.msu\" and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\")) or (ActingProcessCommandLine =~ \"\\\"C:\\\\Windows\\\\system32\\\\dism.exe\\\" /online /quiet /norestart /add-package /packagepath:\\\"C:\\\\Windows\\\\system32\\\\pe386\\\" /ignorecheck\" and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\") and (TargetProcessCommandLine contains \"C:\\\\Users\\\\\" and TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" and TargetProcessCommandLine contains \"\\\\dismhost.exe {\") and TargetProcessName endswith \"\\\\DismHost.exe\"))|extend RuleId=\"39ed3c80-e6a1-431b-9df3-911ac53d08a7\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_ntfs_reparse_point.yml\"|extend RuleTitle=\"UAC Bypass Using NTFS Reparse Point - Process\"|extend RuleDescription=\"Detects the pattern of UAC Bypass using NTFS reparse point and wusa.exe DLL hijacking (UACMe 36)\";\nlet q19=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\pkgmgr.exe\" and TargetProcessName endswith \"\\\\dism.exe\" and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\"))|extend RuleId=\"a743ceba-c771-4d75-97eb-8a90f7f4844c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_pkgmgr_dism.yml\"|extend RuleTitle=\"UAC Bypass Using PkgMgr and DISM\"|extend RuleDescription=\"Detects the pattern of UAC Bypass using pkgmgr.exe and dism.exe (UACMe 23)\";\nlet q20=_Im_ProcessCreate\n| where ((TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\") and ActingProcessName endswith \"\\\\AppData\\\\Local\\\\Temp\\\\system32\\\\winsat.exe\" and ActingProcessCommandLine contains \"C:\\\\Windows \\\\system32\\\\winsat.exe\")|extend RuleId=\"7a01183d-71a2-46ad-ad5c-acd989ac1793\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_winsat.yml\"|extend RuleTitle=\"UAC Bypass Abusing Winsat Path Parsing - Process\"|extend RuleDescription=\"Detects the pattern of UAC Bypass using a path parsing issue in winsat.exe (UACMe 52)\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19, q20;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["PrivilegeEscalation", "DefenseEvasion", "CredentialAccess", "Execution", "CommandAndControl", "LateralMovement"],
                "techniques": ["T1548", "T1528", "T1218", "T1219", "T1036", "T1563", "T1021"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000241",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}