{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000111')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000111')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation low 11",
                "description": "Sigma Windows Process Creation low 11",
                "severity": "low",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") or (TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\")) and ((((TargetProcessCommandLine contains \" group \" or TargetProcessCommandLine contains \" localgroup \") and (TargetProcessCommandLine contains \"domain admins\" or TargetProcessCommandLine contains \" administrator\" or TargetProcessCommandLine contains \" administrateur\" or TargetProcessCommandLine contains \"enterprise admins\" or TargetProcessCommandLine contains \"Exchange Trusted Subsystem\" or TargetProcessCommandLine contains \"Remote Desktop Users\" or TargetProcessCommandLine contains \"Utilisateurs du Bureau \u00e0 distance\" or TargetProcessCommandLine contains \"Usuarios de escritorio remoto\" or TargetProcessCommandLine contains \" /do\")) and (not(TargetProcessCommandLine contains \" /add\"))) or (TargetProcessCommandLine contains \" accounts \" and TargetProcessCommandLine contains \" /do\")))|extend RuleId=\"d95de845-b83c-4a9a-8a6a-4fc802ebf6c0\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_groups_and_accounts_recon.yml\"|extend RuleTitle=\"Suspicious Group And Account Reconnaissance Activity Using Net.EXE\"|extend RuleDescription=\"Detects suspicious reconnaissance command line activity on Windows systems using Net.EXE\";\nlet q1=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") or (TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\")) and (TargetProcessCommandLine contains \"user\" and TargetProcessCommandLine contains \"add\"))|extend RuleId=\"cd219ff3-fa99-45d4-8380-a7d15116c6dc\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_user_add.yml\"|extend RuleTitle=\"New User Created Via Net.EXE\"|extend RuleDescription=\"Identifies the creation of local users via the net.exe command.\";\nlet q2=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") or (TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\")) and (TargetProcessCommandLine contains \" use \" and TargetProcessCommandLine contains \"* \\\\\\\\*\\\\*$*\"))|extend RuleId=\"3abd6094-7027-475f-9630-8ab9be7b9725\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_use_mount_admin_share.yml\"|extend RuleTitle=\"Windows Admin Share Mount Via Net.EXE\"|extend RuleDescription=\"Detects when an admin share is mounted using net.exe\";\nlet q3=_Im_ProcessCreate\n| where ((((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") or (TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\")) and (TargetProcessCommandLine contains \" use \" and TargetProcessCommandLine contains \"*:*\\\\*\" and TargetProcessCommandLine contains \"*/USER:* *\")) and (not(TargetProcessCommandLine endswith \" \")))|extend RuleId=\"d4498716-1d52-438f-8084-4a603157d131\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_use_password_plaintext.yml\"|extend RuleTitle=\"Password Provided In Command Line Of Net.EXE\"|extend RuleDescription=\"Detects a when net.exe is called with a password in the command line\";\nlet q4=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\Adobe Creative Cloud Experience\\\\libs\\\\node.exe\" and (not(TargetProcessCommandLine contains \"Adobe Creative Cloud Experience\\\\js\")))|extend RuleId=\"df1f26d3-bea7-4700-9ea2-ad3e990cf90e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_node_adobe_creative_cloud_abuse.yml\"|extend RuleTitle=\"Node Process Executions\"|extend RuleDescription=\"Detects the execution of other scripts using the Node executable packaged with Adobe Creative Cloud\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessName contains \"\\\\nslookup.exe\" or TargetProcessFilename =~ \"\\\\nslookup.exe\") and ((ActingProcessName endswith \"\\\\powershell.exe\" or ActingProcessName endswith \"\\\\pwsh.exe\") and (TargetProcessCommandLine contains \" -q=txt \" or TargetProcessCommandLine contains \" -querytype=txt \")))|extend RuleId=\"1b3b01c7-84e9-4072-86e5-fc285a41ff23\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_nslookup_poweshell_download.yml\"|extend RuleTitle=\"Nslookup PowerShell Download Cradle - ProcessCreation\"|extend RuleDescription=\"Detects suspicious powershell download cradle using nslookup. This cradle uses nslookup to extract payloads from DNS records\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\ntdsutil.exe\" or TargetProcessFilename =~ \"ntdsutil.exe\") and ((TargetProcessCommandLine contains \"snapshot\" and TargetProcessCommandLine contains \"mount \") or (TargetProcessCommandLine contains \"ac\" and TargetProcessCommandLine contains \" i\" and TargetProcessCommandLine contains \" ntds\")))|extend RuleId=\"a58353df-af43-4753-bad0-cd83ef35eef5\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_ntdsutil_susp_usage.yml\"|extend RuleTitle=\"Suspicious Usage Of Active Directory Diagnostic Tool (ntdsutil.exe)\"|extend RuleDescription=\"Detects execution of ntdsutil.exe to perform different actions such as restoring snapshots...etc.\";\nlet q7=_Im_ProcessCreate\n| where TargetProcessName endswith \"\\\\ntdsutil.exe\"|extend RuleId=\"2afafd61-6aae-4df4-baed-139fa1f4c345\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_ntdsutil_usage.yml\"|extend RuleTitle=\"Invocation of Active Directory Diagnostic Tool (ntdsutil.exe)\"|extend RuleDescription=\"Detects execution of ntdsutil.exe, which can be used for various attacks against the NTDS database (NTDS.DIT)\";\nlet q8=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\odbcconf.exe\" or TargetProcessFilename =~ \"odbcconf.exe\") and (TargetProcessCommandLine contains \"INSTALLDRIVER \" and TargetProcessCommandLine contains \".dll\"))|extend RuleId=\"3f5491e2-8db8-496b-9e95-1029fce852d4\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_odbcconf_driver_install.yml\"|extend RuleTitle=\"Driver/DLL Installation Via Odbcconf.EXE\"|extend RuleDescription=\"Detects execution of \\\"odbcconf\\\" with \\\"INSTALLDRIVER\\\" which installs a new ODBC driver. Attackers abuse this to install and run malicious DLLs.\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\odbcconf.exe\" or TargetProcessFilename =~ \"odbcconf.exe\") and (TargetProcessCommandLine contains \"REGSVR \" and TargetProcessCommandLine contains \".dll\"))|extend RuleId=\"9f0a8bf3-a65b-440a-8c1e-5cb1547c8e70\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_odbcconf_register_dll_regsvr.yml\"|extend RuleTitle=\"New DLL Registered Via Odbcconf.EXE\"|extend RuleDescription=\"Detects execution of \\\"odbcconf\\\" with \\\"REGSVR\\\" in order to register a new DLL (equivalent to running regsvr32). Attackers abuse this to install and run malicious DLLs.\";\nlet q10=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\odbcconf.exe\" or TargetProcessFilename =~ \"odbcconf.exe\") and (TargetProcessCommandLine contains \" -f \" or TargetProcessCommandLine contains \" /f \") and TargetProcessCommandLine contains \".rsp\")|extend RuleId=\"5f03babb-12db-4eec-8c82-7b4cb5580868\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_odbcconf_response_file.yml\"|extend RuleTitle=\"Response File Execution Via Odbcconf.EXE\"|extend RuleDescription=\"Detects execution of \\\"odbcconf\\\" with the \\\"-f\\\" flag in order to load a response file which might contain a malicious action.\";\nlet q11=_Im_ProcessCreate\n| where ActingProcessName endswith \"\\\\odbcconf.exe\"|extend RuleId=\"8e3c7994-131e-4ba5-b6ea-804d49113a26\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_odbcconf_uncommon_child_process.yml\"|extend RuleTitle=\"Uncommon Child Process Spawned By Odbcconf.EXE\"|extend RuleDescription=\"Detects an uncommon child process of \\\"odbcconf.exe\\\" binary which normally shouldn't have any child processes.\";\nlet q12=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\svchost.exe\" and (TargetProcessName endswith \"\\\\winword.exe\" or TargetProcessName endswith \"\\\\excel.exe\" or TargetProcessName endswith \"\\\\powerpnt.exe\" or TargetProcessName endswith \"\\\\msaccess.exe\" or TargetProcessName endswith \"\\\\mspub.exe\" or TargetProcessName endswith \"\\\\eqnedt32.exe\" or TargetProcessName endswith \"\\\\visio.exe\"))|extend RuleId=\"9bdaf1e9-fdef-443b-8081-4341b74a7e28\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_office_svchost_parent.yml\"|extend RuleTitle=\"Suspicious New Instance Of An Office COM Object\"|extend RuleDescription=\"Detects an svchost process spawning an instance of an office application. This happens when the initial word application creates an instance of one of the Office COM objects such as 'Word.Application', 'Excel.Application', etc.\\nThis can be used by malicious actors to create malicious Office documents with macros on the fly. (See vba2clr project in the references)\\n\";\nlet q13=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\WINWORD.exe\" or TargetProcessFilename =~ \"WinWord.exe\") and (TargetProcessCommandLine contains \"/l \" and TargetProcessCommandLine contains \".dll\"))|extend RuleId=\"f7375e28-5c14-432f-b8d1-1db26c832df3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_office_winword_dll_load.yml\"|extend RuleTitle=\"Potential Arbitrary DLL Load Using Winword\"|extend RuleDescription=\"Detects potential DLL sideloading using the Microsoft Office winword process via the '/l' flag.\";\nlet q14=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\OfflineScannerShell.exe\" or TargetProcessFilename =~ \"OfflineScannerShell.exe\") and (not((TargetProcessCurrentDirectory =~ \"C:\\\\Program Files\\\\Windows Defender\\\\Offline\\\\\" or TargetProcessCurrentDirectory =~ \"\" or isnull(TargetProcessCurrentDirectory)))))|extend RuleId=\"02b18447-ea83-4b1b-8805-714a8a34546a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_offlinescannershell_mpclient_sideloading.yml\"|extend RuleTitle=\"Potential Mpclient.DLL Sideloading Via OfflineScannerShell.EXE Execution\"|extend RuleDescription=\"Detects execution of Windows Defender \\\"OfflineScannerShell.exe\\\" from its non standard directory.\\nThe \\\"OfflineScannerShell.exe\\\" binary is vulnerable to DLL side loading and will load any DLL named \\\"mpclient.dll\\\" from the current working directory.\\n\";\nlet q15=_Im_ProcessCreate\n| where (TargetProcessFileDescription =~ \"PDQ Deploy Console\" or TargetProcessFileProduct =~ \"PDQ Deploy\" or TargetProcessFileCompany =~ \"PDQ.com\" or TargetProcessFilename =~ \"PDQDeployConsole.exe\")|extend RuleId=\"d679950c-abb7-43a6-80fb-2a480c4fc450\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pdqdeploy_execution.yml\"|extend RuleTitle=\"PDQ Deploy Remote Adminstartion Tool Execution\"|extend RuleDescription=\"Detect use of PDQ Deploy remote admin tool\";\nlet q16=_Im_ProcessCreate\n| where (ActingProcessName contains \"PDQDeployRunner-\" and ((TargetProcessName endswith \"\\\\wscript.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\wmic.exe\" or TargetProcessName endswith \"\\\\msiexec.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\csc.exe\" or TargetProcessName endswith \"\\\\dllhost.exe\" or TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessName endswith \"\\\\scriptrunner.exe\" or TargetProcessName endswith \"\\\\bash.exe\" or TargetProcessName endswith \"\\\\wsl.exe\") or (TargetProcessName contains \"C:\\\\Users\\\\Public\\\\\" or TargetProcessName contains \"C:\\\\ProgramData\\\\\" or TargetProcessName contains \"C:\\\\Windows\\\\TEMP\\\\\" or TargetProcessName contains \"\\\\AppData\\\\Local\\\\Temp\") or (TargetProcessCommandLine contains \"iex \" or TargetProcessCommandLine contains \"Invoke-\" or TargetProcessCommandLine contains \"DownloadString\" or TargetProcessCommandLine contains \"http\" or TargetProcessCommandLine contains \" -enc \" or TargetProcessCommandLine contains \" -encodedcommand \" or TargetProcessCommandLine contains \"FromBase64String\" or TargetProcessCommandLine contains \" -decode \" or TargetProcessCommandLine contains \" -w hidden\")))|extend RuleId=\"12b8e9f5-96b2-41e1-9a42-8c6779a5c184\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pdqdeploy_runner_susp_children.yml\"|extend RuleTitle=\"Suspicious Execution Of PDQDeployRunner\"|extend RuleDescription=\"Detects suspicious execution of \\\"PDQDeployRunner\\\" which is part of the PDQDeploy service stack that is responsible for executing commands and packages on a remote machines\";\nlet q17=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\perl.exe\" or TargetProcessFilename =~ \"perl.exe\") and TargetProcessCommandLine contains \" -e\")|extend RuleId=\"f426547a-e0f7-441a-b63e-854ac5bdf54d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_perl_inline_command_execution.yml\"|extend RuleTitle=\"Perl Inline Command Execution\"|extend RuleDescription=\"Detects execution of perl using the \\\"-e\\\"/\\\"-E\\\" flags. This is could be used as a way to launch a reverse shell or execute live perl code.\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "Execution", "LateralMovement", "InitialAccess", "Persistence", "CredentialAccess", "Discovery", "PrivilegeEscalation"],
                "techniques": ["T1127", "T1059", "T1087", "T1072", "T1136", "T1218", "T1078", "T1021", "T1003", "T1202"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000111",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}