{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000216')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000216')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 16",
                "description": "Sigma Windows Process Creation medium 16",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\plink.exe\" and TargetProcessCommandLine contains \":127.0.0.1:3389\") or ((TargetProcessName endswith \"\\\\plink.exe\" and TargetProcessCommandLine contains \":3389\") and (TargetProcessCommandLine contains \" -P 443\" or TargetProcessCommandLine contains \" -P 22\")))|extend RuleId=\"f38ce0b9-5e97-4b47-a211-7dc8d8b871da\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_plink_susp_tunneling.yml\"|extend RuleTitle=\"Potential RDP Tunneling Via SSH Plink\"|extend RuleDescription=\"Execution of plink to perform data exfiltration and tunneling\";\nlet q1=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.Exe\" or TargetProcessFilename =~ \"pwsh.dll\")) and (TargetProcessCommandLine contains \"Add-AADInt\" or TargetProcessCommandLine contains \"ConvertTo-AADInt\" or TargetProcessCommandLine contains \"Disable-AADInt\" or TargetProcessCommandLine contains \"Enable-AADInt\" or TargetProcessCommandLine contains \"Export-AADInt\" or TargetProcessCommandLine contains \"Get-AADInt\" or TargetProcessCommandLine contains \"Grant-AADInt\" or TargetProcessCommandLine contains \"Install-AADInt\" or TargetProcessCommandLine contains \"Invoke-AADInt\" or TargetProcessCommandLine contains \"Join-AADInt\" or TargetProcessCommandLine contains \"New-AADInt\" or TargetProcessCommandLine contains \"Open-AADInt\" or TargetProcessCommandLine contains \"Read-AADInt\" or TargetProcessCommandLine contains \"Register-AADInt\" or TargetProcessCommandLine contains \"Remove-AADInt\" or TargetProcessCommandLine contains \"Restore-AADInt\" or TargetProcessCommandLine contains \"Search-AADInt\" or TargetProcessCommandLine contains \"Send-AADInt\" or TargetProcessCommandLine contains \"Set-AADInt\" or TargetProcessCommandLine contains \"Start-AADInt\" or TargetProcessCommandLine contains \"Update-AADInt\"))|extend RuleId=\"c86500e9-a645-4680-98d7-f882c70c1ea3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_aadinternals_cmdlets_execution.yml\"|extend RuleTitle=\"AADInternals PowerShell Cmdlets Execution - ProccessCreation\"|extend RuleDescription=\"Detects ADDInternals Cmdlet execution. A tool for administering Azure AD and Office 365. Which can be abused by threat actors to attack Azure AD or Office 365.\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"System.Management.Automation.AmsiUtils\" or TargetProcessCommandLine contains \"amsiInitFailed\") or (TargetProcessCommandLine contains \"[Ref].Assembly.GetType\" and TargetProcessCommandLine contains \"SetValue($null,$true)\" and TargetProcessCommandLine contains \"NonPublic,Static\"))|extend RuleId=\"30edb182-aa75-42c0-b0a9-e998bb29067c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_amsi_init_failed_bypass.yml\"|extend RuleTitle=\"Potential AMSI Bypass Via .NET Reflection\"|extend RuleDescription=\"Detects Request to \\\"amsiInitFailed\\\" that can be used to disable AMSI Scanning\";\nlet q3=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and ((TargetProcessCommandLine contains \" -e\" and (TargetProcessCommandLine contains \" JAB\" or TargetProcessCommandLine contains \" SUVYI\" or TargetProcessCommandLine contains \" SQBFAFgA\" or TargetProcessCommandLine contains \" aQBlAHgA\" or TargetProcessCommandLine contains \" aWV4I\" or TargetProcessCommandLine contains \" IAA\" or TargetProcessCommandLine contains \" IAB\" or TargetProcessCommandLine contains \" UwB\" or TargetProcessCommandLine contains \" cwB\")) or (TargetProcessCommandLine contains \".exe -ENCOD \" or TargetProcessCommandLine contains \" BA^J e-\")) and (not(TargetProcessCommandLine contains \" -ExecutionPolicy remotesigned \")))|extend RuleId=\"ca2092a1-c273-4878-9b4b-0d60115bf5ea\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_base64_encoded_cmd.yml\"|extend RuleTitle=\"Suspicious Encoded PowerShell Command Line\"|extend RuleDescription=\"Detects suspicious powershell process starts with base64 encoded commands (e.g. Emotet)\";\nlet q4=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"OjpGcm9tQmFzZTY0U3RyaW5n\"\n| where TargetProcessCommandLine contains \"o6RnJvbUJhc2U2NFN0cmluZ\"\n| where TargetProcessCommandLine contains \"6OkZyb21CYXNlNjRTdHJpbm\"\n| where ( or (TargetProcessCommandLine contains \"OgA6AEYAcgBvAG0AQgBhAHMAZQA2ADQAUwB0AHIAaQBuAGcA\" or TargetProcessCommandLine contains \"oAOgBGAHIAbwBtAEIAYQBzAGUANgA0AFMAdAByAGkAbgBnA\" or TargetProcessCommandLine contains \"6ADoARgByAG8AbQBCAGEAcwBlADYANABTAHQAcgBpAG4AZw\"))|extend RuleId=\"fdb62a13-9a81-4e5c-a38f-ea93a16f6d7c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_base64_frombase64string.yml\"|extend RuleTitle=\"PowerShell Base64 Encoded FromBase64String Cmdlet\"|extend RuleDescription=\"Detects usage of a base64 encoded \\\"FromBase64String\\\" cmdlet in a process command line\";\nlet q5=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"SUVYIChb\"\n| where TargetProcessCommandLine contains \"lFWCAoW\"\n| where TargetProcessCommandLine contains \"JRVggKF\"\n| where TargetProcessCommandLine contains \"aWV4IChb\"\n| where TargetProcessCommandLine contains \"lleCAoW\"\n| where TargetProcessCommandLine contains \"pZXggKF\"\n| where TargetProcessCommandLine contains \"aWV4IChOZX\"\n| where TargetProcessCommandLine contains \"lleCAoTmV3\"\n| where TargetProcessCommandLine contains \"pZXggKE5ld\"\n| where TargetProcessCommandLine contains \"SUVYIChOZX\"\n| where TargetProcessCommandLine contains \"lFWCAoTmV3\"\n| where TargetProcessCommandLine contains \"JRVggKE5ld\"\n| where TargetProcessCommandLine contains \"SUVYKF\"\n| where TargetProcessCommandLine contains \"lFWChb\"\n| where TargetProcessCommandLine contains \"JRVgoW\"\n| where TargetProcessCommandLine contains \"aWV4KF\"\n| where TargetProcessCommandLine contains \"lleChb\"\n| where TargetProcessCommandLine contains \"pZXgoW\"\n| where TargetProcessCommandLine contains \"aWV4KE5ld\"\n| where TargetProcessCommandLine contains \"lleChOZX\"\n| where TargetProcessCommandLine contains \"pZXgoTmV3\"\n| where TargetProcessCommandLine contains \"SUVYKE5ld\"\n| where TargetProcessCommandLine contains \"lFWChOZX\"\n| where TargetProcessCommandLine contains \"JRVgoTmV3\"\n| where TargetProcessCommandLine contains \"SUVYKCgn\"\n| where TargetProcessCommandLine contains \"lFWCgoJ\"\n| where TargetProcessCommandLine contains \"JRVgoKC\"\n| where TargetProcessCommandLine contains \"aWV4KCgn\"\n| where TargetProcessCommandLine contains \"lleCgoJ\"\n| where TargetProcessCommandLine contains \"pZXgoKC\"\n| where (( or  or  or  or  or  or  or  or  or ) or (TargetProcessCommandLine contains \"SQBFAFgAIAAoAFsA\" or TargetProcessCommandLine contains \"kARQBYACAAKABbA\" or TargetProcessCommandLine contains \"JAEUAWAAgACgAWw\" or TargetProcessCommandLine contains \"aQBlAHgAIAAoAFsA\" or TargetProcessCommandLine contains \"kAZQB4ACAAKABbA\" or TargetProcessCommandLine contains \"pAGUAeAAgACgAWw\" or TargetProcessCommandLine contains \"aQBlAHgAIAAoAE4AZQB3A\" or TargetProcessCommandLine contains \"kAZQB4ACAAKABOAGUAdw\" or TargetProcessCommandLine contains \"pAGUAeAAgACgATgBlAHcA\" or TargetProcessCommandLine contains \"SQBFAFgAIAAoAE4AZQB3A\" or TargetProcessCommandLine contains \"kARQBYACAAKABOAGUAdw\" or TargetProcessCommandLine contains \"JAEUAWAAgACgATgBlAHcA\"))|extend RuleId=\"88f680b8-070e-402c-ae11-d2914f2257f1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_base64_iex.yml\"|extend RuleTitle=\"PowerShell Base64 Encoded IEX Cmdlet\"|extend RuleDescription=\"Detects usage of a base64 encoded \\\"IEX\\\" cmdlet in a process command line\";\nlet q6=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and TargetProcessCommandLine contains \" -e\" and (TargetProcessCommandLine contains \"SQBuAHYAbwBrAGUALQ\" or TargetProcessCommandLine contains \"kAbgB2AG8AawBlAC0A\" or TargetProcessCommandLine contains \"JAG4AdgBvAGsAZQAtA\" or TargetProcessCommandLine contains \"SW52b2tlL\" or TargetProcessCommandLine contains \"ludm9rZS\" or TargetProcessCommandLine contains \"JbnZva2Ut\"))|extend RuleId=\"6385697e-9f1b-40bd-8817-f4a91f40508e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_base64_invoke.yml\"|extend RuleTitle=\"PowerShell Base64 Encoded Invoke Keyword\"|extend RuleDescription=\"Detects UTF-8 and UTF-16 Base64 encoded powershell 'Invoke-' calls\";\nlet q7=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"QWRkLU1wUHJlZmVyZW5jZS\"\n| where TargetProcessCommandLine contains \"FkZC1NcFByZWZlcmVuY2Ug\"\n| where TargetProcessCommandLine contains \"BZGQtTXBQcmVmZXJlbmNlI\"\n| where TargetProcessCommandLine contains \"U2V0LU1wUHJlZmVyZW5jZS\"\n| where TargetProcessCommandLine contains \"NldC1NcFByZWZlcmVuY2Ug\"\n| where TargetProcessCommandLine contains \"TZXQtTXBQcmVmZXJlbmNlI\"\n| where TargetProcessCommandLine contains \"YWRkLW1wcHJlZmVyZW5jZS\"\n| where TargetProcessCommandLine contains \"FkZC1tcHByZWZlcmVuY2Ug\"\n| where TargetProcessCommandLine contains \"hZGQtbXBwcmVmZXJlbmNlI\"\n| where TargetProcessCommandLine contains \"c2V0LW1wcHJlZmVyZW5jZS\"\n| where TargetProcessCommandLine contains \"NldC1tcHByZWZlcmVuY2Ug\"\n| where TargetProcessCommandLine contains \"zZXQtbXBwcmVmZXJlbmNlI\"\n| where (( or  or  or ) or (TargetProcessCommandLine contains \"QQBkAGQALQBNAHAAUAByAGUAZgBlAHIAZQBuAGMAZQAgA\" or TargetProcessCommandLine contains \"EAZABkAC0ATQBwAFAAcgBlAGYAZQByAGUAbgBjAGUAIA\" or TargetProcessCommandLine contains \"BAGQAZAAtAE0AcABQAHIAZQBmAGUAcgBlAG4AYwBlACAA\" or TargetProcessCommandLine contains \"UwBlAHQALQBNAHAAUAByAGUAZgBlAHIAZQBuAGMAZQAgA\" or TargetProcessCommandLine contains \"MAZQB0AC0ATQBwAFAAcgBlAGYAZQByAGUAbgBjAGUAIA\" or TargetProcessCommandLine contains \"TAGUAdAAtAE0AcABQAHIAZQBmAGUAcgBlAG4AYwBlACAA\" or TargetProcessCommandLine contains \"YQBkAGQALQBtAHAAcAByAGUAZgBlAHIAZQBuAGMAZQAgA\" or TargetProcessCommandLine contains \"EAZABkAC0AbQBwAHAAcgBlAGYAZQByAGUAbgBjAGUAIA\" or TargetProcessCommandLine contains \"hAGQAZAAtAG0AcABwAHIAZQBmAGUAcgBlAG4AYwBlACAA\" or TargetProcessCommandLine contains \"cwBlAHQALQBtAHAAcAByAGUAZgBlAHIAZQBuAGMAZQAgA\" or TargetProcessCommandLine contains \"MAZQB0AC0AbQBwAHAAcgBlAGYAZQByAGUAbgBjAGUAIA\" or TargetProcessCommandLine contains \"zAGUAdAAtAG0AcABwAHIAZQBmAGUAcgBlAG4AYwBlACAA\"))|extend RuleId=\"c6fb44c6-71f5-49e6-9462-1425d328aee3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_base64_mppreference.yml\"|extend RuleTitle=\"Powershell Base64 Encoded MpPreference Cmdlet\"|extend RuleDescription=\"Detects base64 encoded \\\"MpPreference\\\" PowerShell cmdlet code that tries to modifies or tamper with Windows Defender AV\";\nlet q8=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"WwBSAGUAZgBsAGUAYwB0AGkAbwBuAC4AQQBzAHMAZQBtAGIAbAB5AF0AOgA6AEwAbwBhAGQAKA\" or TargetProcessCommandLine contains \"sAUgBlAGYAbABlAGMAdABpAG8AbgAuAEEAcwBzAGUAbQBiAGwAeQBdADoAOgBMAG8AYQBkACgA\" or TargetProcessCommandLine contains \"bAFIAZQBmAGwAZQBjAHQAaQBvAG4ALgBBAHMAcwBlAG0AYgBsAHkAXQA6ADoATABvAGEAZAAoA\" or TargetProcessCommandLine contains \"AFsAcgBlAGYAbABlAGMAdABpAG8AbgAuAGEAcwBzAGUAbQBiAGwAeQBdADoAOgAoACIATABvAGEAZAAiAC\" or TargetProcessCommandLine contains \"BbAHIAZQBmAGwAZQBjAHQAaQBvAG4ALgBhAHMAcwBlAG0AYgBsAHkAXQA6ADoAKAAiAEwAbwBhAGQAIgAp\" or TargetProcessCommandLine contains \"AWwByAGUAZgBsAGUAYwB0AGkAbwBuAC4AYQBzAHMAZQBtAGIAbAB5AF0AOgA6ACgAIgBMAG8AYQBkACIAK\" or TargetProcessCommandLine contains \"WwBSAGUAZgBsAGUAYwB0AGkAbwBuAC4AQQBzAHMAZQBtAGIAbAB5AF0AOgA6ACgAIgBMAG8AYQBkACIAKQ\" or TargetProcessCommandLine contains \"sAUgBlAGYAbABlAGMAdABpAG8AbgAuAEEAcwBzAGUAbQBiAGwAeQBdADoAOgAoACIATABvAGEAZAAiACkA\" or TargetProcessCommandLine contains \"bAFIAZQBmAGwAZQBjAHQAaQBvAG4ALgBBAHMAcwBlAG0AYgBsAHkAXQA6ADoAKAAiAEwAbwBhAGQAIgApA\" or TargetProcessCommandLine contains \"WwByAGUAZgBsAGUAYwB0AGkAbwBuAC4AYQBzAHMAZQBtAGIAbAB5AF0AOgA6AEwAbwBhAGQAKA\" or TargetProcessCommandLine contains \"sAcgBlAGYAbABlAGMAdABpAG8AbgAuAGEAcwBzAGUAbQBiAGwAeQBdADoAOgBMAG8AYQBkACgA\" or TargetProcessCommandLine contains \"bAHIAZQBmAGwAZQBjAHQAaQBvAG4ALgBhAHMAcwBlAG0AYgBsAHkAXQA6ADoATABvAGEAZAAoA\")|extend RuleId=\"62b7ccc9-23b4-471e-aa15-6da3663c4d59\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_base64_reflection_assembly_load.yml\"|extend RuleTitle=\"PowerShell Base64 Encoded Reflective Assembly Load\"|extend RuleDescription=\"Detects base64 encoded .NET reflective loading of Assembly\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Execution", "CommandAndControl", "DefenseEvasion", "Impact", "CredentialAccess", "Reconnaissance", "Discovery"],
                "techniques": ["T1059", "T1562", "T1620", "T1027", "T1140", "T1572"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000216",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}