{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000105')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000105')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 05",
                "description": "Sigma Windows Process Creation low 05",
                "severity": "low",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"Extexportexe\" or TargetProcessName endswith \"\\\\Extexportexe\" or TargetProcessFilename =~ \"extexportexe\")|extend RuleId=\"5163A000-5160-5160-5160-5163A0000104\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_extexport.yml\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"extrac32exe\" or TargetProcessName endswith \"\\\\extrac32exe\" or TargetProcessFilename =~ \"extrac32exe\") and TargetProcessCommandLine contains \"cab\" and (TargetProcessCommandLine contains \"/C\" or TargetProcessCommandLine contains \"/Y\" or TargetProcessCommandLine contains \" \\\\\\\\\"))|extend RuleId=\"aa8e035d-7be4-48d3-a944-102aec04400d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_extrac32.yml\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"extrac32exe\" and TargetProcessCommandLine contains \"cab\") and TargetProcessCommandLine matches regex \":[^\\\\\\\\]\")|extend RuleId=\"4b13db67-0c45-40f1-aba8-66a1a7198a1e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_extrac32_ads.yml\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"findstr\" or TargetProcessName endswith \"findstrexe\" or TargetProcessFilename =~ \"FINDSTREXE\") and (((TargetProcessCommandLine contains \" /v \" or TargetProcessCommandLine contains \" -v \") and (TargetProcessCommandLine contains \" /l \" or TargetProcessCommandLine contains \" -l \")) or ((TargetProcessCommandLine contains \" /s \" or TargetProcessCommandLine contains \" -s \") and (TargetProcessCommandLine contains \" /i \" or TargetProcessCommandLine contains \" -i \"))))|extend RuleId=\"bf6c39fc-e203-45b9-9538-05397c1b4f3f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_findstr.yml\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\forfilesexe\" or TargetProcessFilename =~ \"forfilesexe\") and (TargetProcessCommandLine contains \" /p \" or TargetProcessCommandLine contains \" -p \") and (TargetProcessCommandLine contains \" /m \" or TargetProcessCommandLine contains \" -m \") and (TargetProcessCommandLine contains \" /c \" or TargetProcessCommandLine contains \" -c \"))|extend RuleId=\"9aa5106d-bce3-4b13-86df-3a20f1d5cf0b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_forfiles.yml\";\nlet q5=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\fsianycpuexe\" or TargetProcessFilename =~ \"fsianycpuexe\" or TargetProcessName endswith \"\\\\fsiexe\" or TargetProcessFilename =~ \"fsiexe\")|extend RuleId=\"b96b2031-7c17-4473-afe7-a30ce714db29\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_fsharp_interpreters.yml\";\nlet q6=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\ftpexe\" or ((TargetProcessName endswith \"\\\\ftpexe\" or TargetProcessFilename =~ \"ftpexe\") and (TargetProcessCommandLine contains \"-s:\" or TargetProcessCommandLine contains \"/s:\")))|extend RuleId=\"06b401f4-107c-4ff9-947f-9ec1e7649f1e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_ftp.yml\";\nlet q7=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\cscriptexe\" or TargetProcessName endswith \"\\\\wscriptexe\") or (TargetProcessFilename =~ \"cscriptexe\" or TargetProcessFilename =~ \"wscriptexe\")) and TargetProcessCommandLine contains \"gatherNetworkInfovbs\")|extend RuleId=\"575dce0c-8139-4e30-9295-1ee75969f7fe\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_gather_network_info.yml\";\nlet q8=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\GfxDownloadWrapperexe\" and (not((TargetProcessCommandLine contains \"gameplayapiintelcom\" and (ActingProcessName endswith \"\\\\GfxDownloadWrapperexe\" or ActingProcessName endswith \"\\\\igfxEMexe\")))))|extend RuleId=\"eee00933-a761-4cd0-be70-c42fe91731e7\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_gfxdownloadwrapper_file_download.yml\";\nlet q9=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\gpscriptexe\" or TargetProcessFilename =~ \"GPSCRIPTEXE\") and (TargetProcessCommandLine contains \" /logon\" or TargetProcessCommandLine contains \" /startup\")) and (not(ActingProcessCommandLine =~ \"C:\\\\windows\\\\system32\\\\svchostexe -k netsvcs -p -s gpsvc\")))|extend RuleId=\"1e59c230-6670-45bf-83b0-98903780607e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_gpscript.yml\";\nlet q10=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\ie4uinitexe\" or TargetProcessFilename =~ \"IE4UINITEXE\") and (not(((TargetProcessCurrentDirectory =~ \"c:\\\\windows\\\\system32\\\\\" or TargetProcessCurrentDirectory =~ \"c:\\\\windows\\\\sysWOW64\\\\\") or isnull(TargetProcessCurrentDirectory)))))|extend RuleId=\"d3bf399f-b0cf-4250-8bb4-dfc192ab81dc\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_ie4uinit.yml\";\nlet q11=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\ilasmexe\" or TargetProcessFilename =~ \"ilasmexe\")|extend RuleId=\"850d55f9-6eeb-4492-ad69-a72338f65ba4\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_ilasm.yml\";\nlet q12=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\InstallUtilexe\" or TargetProcessFilename =~ \"InstallUtilexe\") and (TargetProcessCommandLine contains \"http://\" or TargetProcessCommandLine contains \"https://\" or TargetProcessCommandLine contains \"ftp://\"))|extend RuleId=\"75edd216-1939-4c73-8d61-7f3a0d85b5cc\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_installutil_download.yml\";\nlet q13=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\jscexe\" and TargetProcessCommandLine contains \"js\")|extend RuleId=\"52788a70-f1da-40dd-8fbd-73b5865d6568\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_jsc.yml\";\nlet q14=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"Launch-VsDevShellps1\" and (TargetProcessCommandLine contains \"VsWherePath \" or TargetProcessCommandLine contains \"VsInstallationPath \"))|extend RuleId=\"45d3a03d-f441-458c-8883-df101a3bb146\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_launch_vsdevshell.yml\";\nlet q15=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"verb:sync\" and TargetProcessCommandLine contains \"-source:RunCommand\" and TargetProcessCommandLine contains \"-dest:runCommand\") and TargetProcessName endswith \"\\\\msdeployexe\")|extend RuleId=\"646bc99f-6682-4b47-a73a-17b1b64c9d34\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_msdeploy.yml\";\nlet q16=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\MSOHTMEDexe\" or TargetProcessFilename =~ \"MsoHtmEdexe\") and (TargetProcessCommandLine contains \"http://\" or TargetProcessCommandLine contains \"https://\" or TargetProcessCommandLine contains \"ftp://\"))|extend RuleId=\"459f2f98-397b-4a4a-9f47-6a5ec2f1c69d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_msohtmed_download.yml\";\nlet q17=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\MSPUBexe\" or TargetProcessFilename =~ \"MSPUBexe\") and (TargetProcessCommandLine contains \"http://\" or TargetProcessCommandLine contains \"https://\" or TargetProcessCommandLine contains \"ftp://\"))|extend RuleId=\"3b3c7f55-f771-4dd6-8a6e-08d057a17caf\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_mspub_download.yml\";\nlet q18=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"OpenConsoleexe\" or TargetProcessName endswith \"\\\\OpenConsoleexe\") and (not(TargetProcessName startswith \"C:\\\\Program Files\\\\WindowsApps\\\\MicrosoftWindowsTerminal\")))|extend RuleId=\"814c95cc-8192-4378-a70a-f1aafd877af1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_openconsole.yml\";\nlet q19=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\pcaluaexe\" and TargetProcessCommandLine contains \" -a\")|extend RuleId=\"0955e4e1-c281-4fb9-9ee1-5ee7b4b754d2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_pcalua.yml\";\nlet q20=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\rundll32exe\" or TargetProcessFilename =~ \"RUNDLL32EXE\") and (TargetProcessCommandLine contains \"pcwutl\" and TargetProcessCommandLine contains \"LaunchApplication\"))|extend RuleId=\"9386d78a-7207-4048-9c9f-a93a7c2d1c05\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_pcwutl.yml\";\nlet q21=_Im_ProcessCreate\n| where (((ActingProcessName endswith \"\\\\powershellexe\" or ActingProcessName endswith \"\\\\pwshexe\") and ActingProcessCommandLine contains \"\\\\WindowsPowerShell\\\\Modules\\\\Pester\\\\\") and (ActingProcessCommandLine contains \"{ Invoke-Pester -EnableExit ;\" or ActingProcessCommandLine contains \"{ Get-Help \\\"\"))|extend RuleId=\"18988e1b-9087-4f8a-82fe-0414dce49878\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_pester.yml\";\nlet q22=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershellexe\" or TargetProcessName endswith \"\\\\pwshexe\") and (TargetProcessCommandLine contains \"Pester\" and TargetProcessCommandLine contains \"Get-Help\")) or ((TargetProcessName endswith \"\\\\cmdexe\" and (TargetProcessCommandLine contains \"pester\" and TargetProcessCommandLine contains \";\")) and (TargetProcessCommandLine contains \"help\" or TargetProcessCommandLine matches regex \"\".*..*\"\")))|extend RuleId=\"59e938ff-0d6d-4dc3-b13f-36cc28734d4e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_pester_1.yml\";\nlet q23=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\presentationhostexe\" or TargetProcessFilename =~ \"PresentationHostexe\") and TargetProcessCommandLine contains \"xbap\") and (not((TargetProcessCommandLine contains \"C:\\\\Windows\\\\\" or TargetProcessCommandLine contains \"C:\\\\Program Files\"))))|extend RuleId=\"d22e2925-cfd8-463f-96f6-89cec9d9bc5f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_presentationhost.yml\";\nlet q24=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\presentationhostexe\" or TargetProcessFilename =~ \"PresentationHostexe\") and (TargetProcessCommandLine contains \"http://\" or TargetProcessCommandLine contains \"https://\" or TargetProcessCommandLine contains \"ftp://\"))|extend RuleId=\"b124ddf4-778d-418e-907f-6dd3fc0d31cd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_presentationhost_download.yml\";\nlet q25=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\protocolhandlerexe\" or TargetProcessFilename =~ \"ProtocolHandlerexe\") and ((TargetProcessCommandLine contains \"\\\"ms-word\" and TargetProcessCommandLine contains \"docx\\\"\") or TargetProcessCommandLine contains \" http\"))|extend RuleId=\"104cdb48-a7a8-4ca7-a453-32942c6e5dcb\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_protocolhandler_download.yml\";\nlet q26=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"\\\\pubprnvbs\" and TargetProcessCommandLine contains \"script:\")|extend RuleId=\"1fb76ab8-fa60-4b01-bddd-71e89bf555da\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_pubprn.yml\";\nlet q27=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\rasautouexe\" or TargetProcessFilename =~ \"rasdluiexe\") and (TargetProcessCommandLine contains \" -d \" and TargetProcessCommandLine contains \" -p \"))|extend RuleId=\"cd3d1298-eb3b-476c-ac67-12847de55813\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_rasautou_dll_execution.yml\";\nlet q28=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"\\\\register_appvbs\" and TargetProcessCommandLine contains \"-register\")|extend RuleId=\"1c8774a0-44d4-4db0-91f8-e792359c70bd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_register_app.yml\";\nlet q29=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\remoteexe\" or TargetProcessFilename =~ \"remoteexe\")|extend RuleId=\"4eddc365-79b4-43ff-a9d7-99422dc34b93\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_remote.yml\";\nlet q30=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\replaceexe\" and (TargetProcessCommandLine contains \"/a\" or TargetProcessCommandLine contains \"-a\"))|extend RuleId=\"9292293b-8496-4715-9db6-37028dcda4b3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_replace.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19, q20, q21, q22, q23, q24, q25, q26, q27, q28, q29, q30;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Execution", "CommandAndControl", "DefenseEvasion", "Discovery", "CredentialAccess"],
                "techniques": ["T1127", "T1218", "T1552", "T1615", "T1059", "T1216", "T1564", "T1202", "T1105"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000105",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}