{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000127')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000127')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation low 27",
                "description": "Sigma Windows Process Creation low 27",
                "severity": "low",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\wmic.exe\" and (TargetProcessCommandLine contains \"/format\" or TargetProcessCommandLine contains \"-format\")) and (not((TargetProcessCommandLine contains \"Format:List\" or TargetProcessCommandLine contains \"Format:htable\" or TargetProcessCommandLine contains \"Format:hform\" or TargetProcessCommandLine contains \"Format:table\" or TargetProcessCommandLine contains \"Format:mof\" or TargetProcessCommandLine contains \"Format:value\" or TargetProcessCommandLine contains \"Format:rawxml\" or TargetProcessCommandLine contains \"Format:xml\" or TargetProcessCommandLine contains \"Format:csv\")))) or TargetProcessName endswith \"\\\\msxsl.exe\")|extend RuleId=\"05c36dd6-79d6-4a9a-97da-3db20298ab2d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wmic_xsl_script_processing.yml\"|extend RuleTitle=\"XSL Script Processing\"|extend RuleDescription=\"Extensible Stylesheet Language (XSL) files are commonly used to describe the processing and rendering of data within XML files. Rule detects when adversaries abuse this functionality to execute arbitrary files while potentially bypassing application whitelisting defenses.\";\nlet q1=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\WmiPrvSe.exe\" and (not(((LogonId =~ \"0x3e7\" or LogonId =~ \"null\") or (TargetUsername contains \"AUTHORI\" or TargetUsername contains \"AUTORI\") or TargetProcessName endswith \"\\\\WmiPrvSE.exe\" or TargetProcessName endswith \"\\\\WerFault.exe\" or isnull(LogonId)))))|extend RuleId=\"d21374ff-f574-44a7-9998-4a8c8bf33d7d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wmiprvse_spawning_process.yml\"|extend RuleTitle=\"WmiPrvSE Spawned A Process\"|extend RuleDescription=\"Detects WmiPrvSE spawning a process\";\nlet q2=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\WmiPrvSE.exe\" and ((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")))|extend RuleId=\"692f0bec-83ba-4d04-af7e-e884a96059b6\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wmiprvse_spawns_powershell.yml\"|extend RuleTitle=\"Potential WMI Lateral Movement WmiPrvSE Spawned PowerShell\"|extend RuleDescription=\"Detects Powershell as a child of the WmiPrvSE process. Which could be a sign of lateral movement via WMI.\";\nlet q3=_Im_ProcessCreate\n| where (TargetProcessName =~ \"C:\\\\WINDOWS\\\\system32\\\\wbem\\\\scrcons.exe\" and ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\svchost.exe\")|extend RuleId=\"ec1d5e28-8f3b-4188-a6f8-6e8df81dc28e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wmi_persistence_script_event_consumer.yml\"|extend RuleTitle=\"WMI Persistence - Script Event Consumer\"|extend RuleDescription=\"Detects WMI script event consumers\";\nlet q4=_Im_ProcessCreate\n| where (((TargetProcessFilename =~ \"wscript.exe\" or TargetProcessFilename =~ \"cscript.exe\") or (TargetProcessName endswith \"\\\\wscript.exe\" or TargetProcessName endswith \"\\\\cscript.exe\")) and (TargetProcessCommandLine contains \".js\" or TargetProcessCommandLine contains \".jse\" or TargetProcessCommandLine contains \".vba\" or TargetProcessCommandLine contains \".vbe\" or TargetProcessCommandLine contains \".vbs\" or TargetProcessCommandLine contains \".wsf\"))|extend RuleId=\"1e33157c-53b1-41ad-bbcc-780b80b58288\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wscript_cscript_script_exec.yml\"|extend RuleTitle=\"WSF/JSE/JS/VBA/VBE File Execution Via Cscript/Wscript\"|extend RuleDescription=\"Detects script file execution (.js, .jse, .vba, .vbe, .vbs, .wsf) by Wscript/Cscript\";\nlet q5=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\wscript.exe\" or ActingProcessName endswith \"\\\\cscript.exe\") and ((TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") and ((TargetProcessCommandLine contains \"mshta\" and TargetProcessCommandLine contains \"http\") or (TargetProcessCommandLine contains \"rundll32\" or TargetProcessCommandLine contains \"regsvr32\" or TargetProcessCommandLine contains \"msiexec\"))))|extend RuleId=\"b6676963-0353-4f88-90f5-36c20d443c6a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wscript_cscript_susp_child_processes.yml\"|extend RuleTitle=\"Cscript/Wscript Suspicious Child Process\"|extend RuleDescription=\"Detects suspicious child processes of Wscript/Cscript\";\nlet q6=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\wsl.exe\" or ActingProcessName endswith \"\\\\wslhost.exe\") and ((TargetProcessName endswith \"\\\\calc.exe\" or TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\wscript.exe\") or (TargetProcessName contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or TargetProcessName contains \"C:\\\\Users\\\\Public\\\\\" or TargetProcessName contains \"C:\\\\Windows\\\\Temp\\\\\" or TargetProcessName contains \"C:\\\\Temp\\\\\" or TargetProcessName contains \"\\\\Downloads\\\\\" or TargetProcessName contains \"\\\\Desktop\\\\\")))|extend RuleId=\"2267fe65-0681-42ad-9a6d-46553d3f3480\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wsl_child_processes_anomalies.yml\"|extend RuleTitle=\"WSL Child Process Anomaly\"|extend RuleDescription=\"Detects uncommon or suspicious child processes spawning from a WSL process. This could indicate an attempt to evade parent/child relationship detections or persistence attempts via cron using WSL\";\nlet q7=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\wsl.exe\" or TargetProcessFilename =~ \"wsl.exe\") and (TargetProcessCommandLine contains \" -e \" or TargetProcessCommandLine contains \" --exec\" or TargetProcessCommandLine contains \" --system\" or TargetProcessCommandLine contains \" --shell-type \" or TargetProcessCommandLine contains \" /mnt/c\" or TargetProcessCommandLine contains \" --user root\" or TargetProcessCommandLine contains \" -u root\" or TargetProcessCommandLine contains \"--debug-shell\")) and (not((ActingProcessName endswith \"\\\\cmd.exe\" and (TargetProcessCommandLine contains \" -d \" and TargetProcessCommandLine contains \" -e kill \")))))|extend RuleId=\"dec44ca7-61ad-493c-bfd7-8819c5faa09b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wsl_lolbin_execution.yml\"|extend RuleTitle=\"Arbitrary Command Execution Using WSL\"|extend RuleDescription=\"Detects potential abuse of Windows Subsystem for Linux (WSL) binary as a LOLBIN to execute arbitrary Linux or Windows commands\";\nlet q8=_Im_ProcessCreate\n| where (TargetProcessName matches regex \"[a-zA-Z]:\\\\\\\\\" and TargetProcessCurrentDirectory contains \"\\\\\\\\wsl.localhost\")|extend RuleId=\"ed825c86-c009-4014-b413-b76003e33d35\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wsl_windows_binaries_execution.yml\"|extend RuleTitle=\"Windows Binary Executed From WSL\"|extend RuleDescription=\"Detects the execution of Windows binaries from within a WSL instance. This could be used to masquerade parent-child relationships\";\nlet q9=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\wusa.exe\" and TargetProcessCommandLine contains \"/extract:\")|extend RuleId=\"59b39960-5f9d-4a49-9cef-1e4d2c1d0cb9\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wusa_cab_files_extraction.yml\"|extend RuleTitle=\"Wusa Extracting Cab Files\"|extend RuleDescription=\"Detects usage of the \\\"wusa.exe\\\" (Windows Update Standalone Installer) utility to extract cab using the \\\"/extract\\\" argument which is not longer supported. This could indicate an attacker using an old technique\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Persistence", "PrivilegeEscalation", "DefenseEvasion", "Execution"],
                "techniques": ["T1218", "T1546", "T1047", "T1059", "T1202", "T1220"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000127",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}