{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000109')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000109')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation low 09",
                "description": "Sigma Windows Process Creation low 09",
                "severity": "low",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\tracker.exe\" or TargetProcessFileDescription =~ \"Tracker\") and (TargetProcessCommandLine contains \" /d \" or TargetProcessCommandLine contains \" /c \")) and (not((TargetProcessCommandLine contains \" /ERRORREPORT:PROMPT \" or (ActingProcessName endswith \"\\\\Msbuild\\\\Current\\\\Bin\\\\MSBuild.exe\" or ActingProcessName endswith \"\\\\Msbuild\\\\Current\\\\Bin\\\\amd64\\\\MSBuild.exe\")))))|extend RuleId=\"148431ce-4b70-403d-8525-fcc2993f29ea\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_tracker.yml\"|extend RuleTitle=\"Potential DLL Injection Or Execution Using Tracker.exe\"|extend RuleDescription=\"Detects potential DLL injection and execution using \"Tracker.exe\"\";\nlet q1=_Im_ProcessCreate\n| where (TargetProcessName endswith \"ttdinject.exe\" or TargetProcessFilename =~ \"TTDInject.EXE\")|extend RuleId=\"b27077d6-23e6-45d2-81a0-e2b356eea5fd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_ttdinject.yml\"|extend RuleTitle=\"Use of TTDInject.exe\"|extend RuleDescription=\"Detects the executiob of TTDInject.exe, which is used by Windows 10 v1809 and newer to debug time travel (underlying call of tttracer.exe)\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"type \" and TargetProcessCommandLine contains \" > \\\\\\\\\") or (TargetProcessCommandLine contains \"type \\\\\\\\\" and TargetProcessCommandLine contains \" > \"))|extend RuleId=\"aa0b3a82-eacc-4ec3-9150-b5a9a3e3f82f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_type.yml\"|extend RuleTitle=\"Potential Download/Upload Activity Using Type Command\"|extend RuleDescription=\"Detects usage of the \"type\" command to download/upload data from WebDAV server\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\unregmp2.exe\" or TargetProcessFilename =~ \"unregmp2.exe\") and TargetProcessCommandLine contains \" /HideWMP\")|extend RuleId=\"727454c0-d851-48b0-8b89-385611ab0704\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_unregmp2.yml\"|extend RuleTitle=\"Lolbin Unregmp2.exe Use As Proxy\"|extend RuleDescription=\"Detect usage of the \"unregmp2.exe\" binary as a proxy to launch a custom version of \"wmpnscfg.exe\"\";\nlet q4=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"UtilityFunctions.ps1\" or TargetProcessCommandLine contains \"RegSnapin \")|extend RuleId=\"0403d67d-6227-4ea8-8145-4e72db7da120\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_utilityfunctions.yml\"|extend RuleTitle=\"UtilityFunctions.ps1 Proxy Dll\"|extend RuleDescription=\"Detects the use of a Microsoft signed script executing a managed DLL with PowerShell.\";\nlet q5=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\VisualUiaVerifyNative.exe\" or TargetProcessFilename =~ \"VisualUiaVerifyNative.exe\")|extend RuleId=\"b30a8bc5-e21b-4ca2-9420-0a94019ac56a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_visualuiaverifynative.yml\"|extend RuleTitle=\"Use of VisualUiaVerifyNative.exe\"|extend RuleDescription=\"VisualUiaVerifyNative.exe is a Windows SDK that can be used for AWL bypass and is listed in Microsoft's recommended block rules.\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\VSIISExeLauncher.exe\" or TargetProcessFilename =~ \"VSIISExeLauncher.exe\") and (TargetProcessCommandLine contains \" -p \" or TargetProcessCommandLine contains \" -a \"))|extend RuleId=\"18749301-f1c5-4efc-a4c3-276ff1f5b6f8\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_vsiisexelauncher.yml\"|extend RuleTitle=\"Use of VSIISExeLauncher.exe\"|extend RuleDescription=\"The \"VSIISExeLauncher.exe\" binary part of the Visual Studio/VS Code can be used to execute arbitrary binaries\";\nlet q7=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\wfc.exe\" or TargetProcessFilename =~ \"wfc.exe\")|extend RuleId=\"49be8799-7b4d-4fda-ad23-cafbefdebbc5\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_wfc.yml\"|extend RuleTitle=\"Use of Wfc.exe\"|extend RuleDescription=\"The Workflow Command-line Compiler can be used for AWL bypass and is listed in Microsoft's recommended block rules.\";\nlet q8=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\wlrmdr.exe\" or (((TargetProcessName endswith \"\\\\wlrmdr.exe\" or TargetProcessFilename =~ \"WLRMNDR.EXE\") and (TargetProcessCommandLine contains \"-s \" and TargetProcessCommandLine contains \"-f \" and TargetProcessCommandLine contains \"-t \" and TargetProcessCommandLine contains \"-m \" and TargetProcessCommandLine contains \"-a \" and TargetProcessCommandLine contains \"-u \")) and (not((ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\winlogon.exe\" or ActingProcessName =~ \"-\")))))|extend RuleId=\"9cfc00b6-bfb7-49ce-9781-ef78503154bb\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_wlrmdr.yml\"|extend RuleTitle=\"Wlrmdr Lolbin Use as Launcher\"|extend RuleDescription=\"Detects use of Wlrmdr.exe in which the -u parameter is passed to ShellExecute\";\nlet q9=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\Microsoft.Workflow.Compiler.exe\" or TargetProcessFilename =~ \"Microsoft.Workflow.Compiler.exe\")|extend RuleId=\"419dbf2b-8a9b-4bea-bf99-7544b050ec8d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_workflow_compiler.yml\"|extend RuleTitle=\"Microsoft Workflow Compiler Execution\"|extend RuleDescription=\"Detects invocation of Microsoft Workflow Compiler, which may permit the execution of arbitrary unsigned code.\";\nlet q10=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\wscript.exe\") or (TargetProcessFilename =~ \"cscript.exe\" or TargetProcessFilename =~ \"wscript.exe\")) and TargetProcessCommandLine contains \".vbs -register \")|extend RuleId=\"28c8f68b-098d-45af-8d43-8089f3e35403\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolscript_register_app.yml\"|extend RuleTitle=\"Potential Register_App.Vbs LOLScript Abuse\"|extend RuleDescription=\"Detects potential abuse of the \"register_app.vbs\" script that is part of the Windows SDK. The script offers the capability to register new VSS/VDS Provider as a COM+ application. Attackers can use this to install malicious DLLs for persistence and execution.\";\nlet q11=_Im_ProcessCreate\n| where ActingProcessName endswith \"\\\\mftrace.exe\"|extend RuleId=\"3d48c9d3-1aa6-418d-98d3-8fd3c01a564e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_mftrace_child_process.yml\"|extend RuleTitle=\"Potential Mftrace.EXE Abuse\"|extend RuleDescription=\"Detects child processes of the \"Trace log generation tool for Media Foundation Tools\" (Mftrace.exe) which can abused to execute arbitrary binaries.\";\nlet q12=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\MSBuild.exe\" or TargetProcessFilename =~ \"MSBuild.exe\") and (not((ActingProcessName endswith \"\\\\devenv.exe\" or ActingProcessName endswith \"\\\\cmd.exe\" or ActingProcessName endswith \"\\\\msbuild.exe\" or ActingProcessName endswith \"\\\\python.exe\" or ActingProcessName endswith \"\\\\explorer.exe\" or ActingProcessName endswith \"\\\\nuget.exe\"))))|extend RuleId=\"33be4333-2c6b-44f4-ae28-102cdbde0a31\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_msbuild_susp_parent_process.yml\"|extend RuleTitle=\"Suspicious Msbuild Execution By Uncommon Parent Process\"|extend RuleDescription=\"Detects suspicious execution of 'Msbuild.exe' by a uncommon parent process\";\nlet q13=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\msdt.exe\" or TargetProcessFilename =~ \"msdt.exe\") and (TargetProcessCommandLine contains \" /cab \" or TargetProcessCommandLine contains \" -cab \"))|extend RuleId=\"dc4576d4-7467-424f-9eee-fd2b02855fe0\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_msdt_susp_cab_options.yml\"|extend RuleTitle=\"Suspicious Cabinet File Execution Via Msdt.EXE\"|extend RuleDescription=\"Detects execution of msdt.exe using the \"cab\" flag which could indicates suspicious diagcab files with embedded answer files leveraging CVE-2022-30190\";\nlet q14=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"Wscript.\" and TargetProcessCommandLine contains \".Shell\" and TargetProcessCommandLine contains \".Run\")|extend RuleId=\"2c28c248-7f50-417a-9186-a85b223010ee\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_mshta_inline_vbscript.yml\"|extend RuleTitle=\"Wscript Shell Run In CommandLine\"|extend RuleDescription=\"Detects the presence of the keywords \"Wscript\", \"Shell\" and \"Run\" in the command, which could indicate a suspicious activity\";\nlet q15=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\msiexec.exe\" or TargetProcessFilename =~ \"\\\\msiexec.exe\") and (TargetProcessCommandLine contains \" /z \" or TargetProcessCommandLine contains \" -z \") and TargetProcessCommandLine contains \".dll\")|extend RuleId=\"84f52741-8834-4a8c-a413-2eb2269aa6c8\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_msiexec_dll.yml\"|extend RuleTitle=\"DllUnregisterServer Function Call Via Msiexec.EXE\"|extend RuleDescription=\"Detects MsiExec loading a DLL and calling its DllUnregisterServer function\";\nlet q16=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\cmd.exe\") and (ActingProcessCommandLine contains \"MsiExec.exe\" and ActingProcessCommandLine contains \"-Embedding \")) and (not(((TargetProcessName endswith \":\\\\Windows\\\\System32\\\\cmd.exe\" and TargetProcessCommandLine contains \"C:\\\\Program Files\\\\SplunkUniversalForwarder\\\\bin\\\\\") or (TargetProcessCommandLine contains \"\\\\DismFoDInstall.cmd\" or (ActingProcessCommandLine contains \"\\\\MsiExec.exe -Embedding \" and ActingProcessCommandLine contains \"Global\\\\MSI0000\"))))))|extend RuleId=\"4a2a2c3e-209f-4d01-b513-4155a540b469\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_msiexec_embedding.yml\"|extend RuleTitle=\"Suspicious MsiExec Embedding Parent\"|extend RuleDescription=\"Adversaries may abuse msiexec.exe to proxy the execution of malicious payloads\";\nlet q17=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\msiexec.exe\" and (TargetProcessCommandLine contains \" /y\" or TargetProcessCommandLine contains \" -y\")) and (not((TargetProcessCommandLine contains \"\\\\MsiExec.exe\\\" /Y \\\"C:\\\\Program Files\\\\Bonjour\\\\mdnsNSP.dll\" or TargetProcessCommandLine contains \"\\\\MsiExec.exe\\\" /Y \\\"C:\\\\Program Files (x86)\\\\Bonjour\\\\mdnsNSP.dll\" or TargetProcessCommandLine contains \"\\\\MsiExec.exe\\\" /Y \\\"C:\\\\Program Files (x86)\\\\Apple Software Update\\\\ScriptingObjectModel.dll\" or TargetProcessCommandLine contains \"\\\\MsiExec.exe\\\" /Y \\\"C:\\\\Program Files (x86)\\\\Apple Software Update\\\\SoftwareUpdateAdmin.dll\" or TargetProcessCommandLine contains \"\\\\MsiExec.exe\\\" /Y \\\"C:\\\\Windows\\\\CCM\\\\\" or TargetProcessCommandLine contains \"\\\\MsiExec.exe\\\" /Y C:\\\\Windows\\\\CCM\\\\\" or TargetProcessCommandLine contains \"\\\\MsiExec.exe\\\" -Y \\\"C:\\\\Program Files\\\\Bonjour\\\\mdnsNSP.dll\" or TargetProcessCommandLine contains \"\\\\MsiExec.exe\\\" -Y \\\"C:\\\\Program Files (x86)\\\\Bonjour\\\\mdnsNSP.dll\" or TargetProcessCommandLine contains \"\\\\MsiExec.exe\\\" -Y \\\"C:\\\\Program Files (x86)\\\\Apple Software Update\\\\ScriptingObjectModel.dll\" or TargetProcessCommandLine contains \"\\\\MsiExec.exe\\\" -Y \\\"C:\\\\Program Files (x86)\\\\Apple Software Update\\\\SoftwareUpdateAdmin.dll\" or TargetProcessCommandLine contains \"\\\\MsiExec.exe\\\" -Y \\\"C:\\\\Windows\\\\CCM\\\\\" or TargetProcessCommandLine contains \"\\\\MsiExec.exe\\\" -Y C:\\\\Windows\\\\CCM\\\\\"))))|extend RuleId=\"6f4191bb-912b-48a8-9ce7-682769541e6d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_msiexec_execute_dll.yml\"|extend RuleTitle=\"Suspicious Msiexec Execute Arbitrary DLL\"|extend RuleDescription=\"Adversaries may abuse msiexec.exe to proxy execution of malicious payloads.\nMsiexec.exe is the command-line utility for the Windows Installer and is thus commonly associated with executing installation packages (.msi)\n\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "CommandAndControl", "Execution"],
                "techniques": ["T1105", "T1127", "T1218", "T1202", "T1216", "T1055", "T1059"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000109",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}