{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000239')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000239')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 39",
                "description": "Sigma Windows Process Creation medium 39",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (((ActingProcessName endswith \"\\\\mshta.exe\" or ActingProcessName endswith \"\\\\powershell.exe\" or ActingProcessName endswith \"\\\\pwsh.exe\" or ActingProcessName endswith \"\\\\rundll32.exe\" or ActingProcessName endswith \"\\\\cscript.exe\" or ActingProcessName endswith \"\\\\wscript.exe\" or ActingProcessName endswith \"\\\\wmiprvse.exe\" or ActingProcessName endswith \"\\\\regsvr32.exe\") and (TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessName endswith \"\\\\nslookup.exe\" or TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessName endswith \"\\\\bitsadmin.exe\" or TargetProcessName endswith \"\\\\mshta.exe\")) and (not((TargetProcessCurrentDirectory contains \"\\\\ccmcache\\\\\" or (ActingProcessCommandLine contains \"\\\\Program Files\\\\Amazon\\\\WorkSpacesConfig\\\\Scripts\\\\setup-scheduledtask.ps1\" or ActingProcessCommandLine contains \"\\\\Program Files\\\\Amazon\\\\WorkSpacesConfig\\\\Scripts\\\\set-selfhealing.ps1\" or ActingProcessCommandLine contains \"\\\\Program Files\\\\Amazon\\\\WorkSpacesConfig\\\\Scripts\\\\check-workspacehealth.ps1\" or ActingProcessCommandLine contains \"\\\\nessus_\") or TargetProcessCommandLine contains \"\\\\nessus_\" or (ActingProcessName endswith \"\\\\mshta.exe\" and TargetProcessName endswith \"\\\\mshta.exe\" and (ActingProcessCommandLine contains \"C:\\\\MEM_Configmgr_\" and ActingProcessCommandLine contains \"\\\\splash.hta\" and ActingProcessCommandLine contains \"{1E460BD7-F1C3-4B2E-88BF-4E770A288AF5}\") and (TargetProcessCommandLine contains \"C:\\\\MEM_Configmgr_\" and TargetProcessCommandLine contains \"\\\\SMSSETUP\\\\BIN\\\\\" and TargetProcessCommandLine contains \"\\\\autorun.hta\" and TargetProcessCommandLine contains \"{1E460BD7-F1C3-4B2E-88BF-4E770A288AF5}\"))))))|extend RuleId=\"3a6586ad-127a-4d3b-a677-1e6eacdf8fde\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_shell_spawn_susp_program.yml\"|extend RuleTitle=\"Windows Shell/Scripting Processes Spawning Suspicious Programs\"|extend RuleDescription=\"Detects suspicious child processes of a Windows shell and scripting processes such as wscript, rundll32, powershell, mshta...etc.\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\svchost.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\services.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\powershell_ise.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\spoolsv.exe\" or TargetProcessName endswith \"\\\\lsass.exe\" or TargetProcessName endswith \"\\\\smss.exe\" or TargetProcessName endswith \"\\\\csrss.exe\" or TargetProcessName endswith \"\\\\conhost.exe\" or TargetProcessName endswith \"\\\\wininit.exe\" or TargetProcessName endswith \"\\\\lsm.exe\" or TargetProcessName endswith \"\\\\winlogon.exe\" or TargetProcessName endswith \"\\\\explorer.exe\" or TargetProcessName endswith \"\\\\taskhost.exe\" or TargetProcessName endswith \"\\\\Taskmgr.exe\" or TargetProcessName endswith \"\\\\sihost.exe\" or TargetProcessName endswith \"\\\\RuntimeBroker.exe\" or TargetProcessName endswith \"\\\\smartscreen.exe\" or TargetProcessName endswith \"\\\\dllhost.exe\" or TargetProcessName endswith \"\\\\audiodg.exe\" or TargetProcessName endswith \"\\\\wlanext.exe\" or TargetProcessName endswith \"\\\\dashost.exe\" or TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\wscript.exe\" or TargetProcessName endswith \"\\\\wsl.exe\" or TargetProcessName endswith \"\\\\bitsadmin.exe\" or TargetProcessName endswith \"\\\\atbroker.exe\" or TargetProcessName endswith \"\\\\bcdedit.exe\" or TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessName endswith \"\\\\certreq.exe\" or TargetProcessName endswith \"\\\\cmstp.exe\" or TargetProcessName endswith \"\\\\consent.exe\" or TargetProcessName endswith \"\\\\defrag.exe\" or TargetProcessName endswith \"\\\\dism.exe\" or TargetProcessName endswith \"\\\\dllhst3g.exe\" or TargetProcessName endswith \"\\\\eventvwr.exe\" or TargetProcessName endswith \"\\\\msiexec.exe\" or TargetProcessName endswith \"\\\\runonce.exe\" or TargetProcessName endswith \"\\\\winver.exe\" or TargetProcessName endswith \"\\\\logonui.exe\" or TargetProcessName endswith \"\\\\userinit.exe\" or TargetProcessName endswith \"\\\\dwm.exe\" or TargetProcessName endswith \"\\\\LsaIso.exe\" or TargetProcessName endswith \"\\\\ntoskrnl.exe\" or TargetProcessName endswith \"\\\\wsmprovhost.exe\" or TargetProcessName endswith \"\\\\dfrgui.exe\") and (not((((TargetProcessName startswith \"C:\\\\Windows\\\\System32\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\SysWOW64\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\WinSxS\\\\\") or TargetProcessName contains \"\\\\SystemRoot\\\\System32\\\\\" or (TargetProcessName =~ \"C:\\\\Windows\\\\explorer.exe\" or TargetProcessName =~ \"C:\\\\Program Files\\\\PowerShell\\\\7\\\\pwsh.exe\" or TargetProcessName =~ \"C:\\\\Program Files\\\\PowerShell\\\\7-preview\\\\pwsh.exe\")) or (TargetProcessName startswith \"C:\\\\Program Files\\\\WindowsApps\\\\MicrosoftCorporationII.WindowsSubsystemForLinux\" and TargetProcessName endswith \"\\\\wsl.exe\")))))|extend RuleId=\"e4a6b256-3e47-40fc-89d2-7a477edd6915\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_system_exe_anomaly.yml\"|extend RuleTitle=\"System File Execution Location Anomaly\"|extend RuleDescription=\"Detects a Windows program executable started from a suspicious folder\";\nlet q2=_Im_ProcessCreate\n| where (((TargetProcessIntegrityLevel =~ \"System\" and (TargetUsername contains \"AUTHORI\" or TargetUsername contains \"AUTORI\")) and ((TargetProcessName endswith \"\\\\calc.exe\" or TargetProcessName endswith \"\\\\wscript.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\hh.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\forfiles.exe\" or TargetProcessName endswith \"\\\\ping.exe\") or (TargetProcessCommandLine contains \" -NoP \" or TargetProcessCommandLine contains \" -W Hidden \" or TargetProcessCommandLine contains \" -decode \" or TargetProcessCommandLine contains \" /decode \" or TargetProcessCommandLine contains \" /urlcache \" or TargetProcessCommandLine contains \" -urlcache \" or TargetProcessCommandLine contains \"* -e* JAB*\" or TargetProcessCommandLine contains \"* -e* SUVYI*\" or TargetProcessCommandLine contains \"* -e* SQBFAFgA*\" or TargetProcessCommandLine contains \"* -e* aWV4I*\" or TargetProcessCommandLine contains \"* -e* IAB*\" or TargetProcessCommandLine contains \"* -e* PAA*\" or TargetProcessCommandLine contains \"* -e* aQBlAHgA*\" or TargetProcessCommandLine contains \"vssadmin delete shadows\" or TargetProcessCommandLine contains \"reg SAVE HKLM\" or TargetProcessCommandLine contains \" -ma \" or TargetProcessCommandLine contains \"Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\" or TargetProcessCommandLine contains \".downloadstring(\" or TargetProcessCommandLine contains \".downloadfile(\" or TargetProcessCommandLine contains \" /ticket:\" or TargetProcessCommandLine contains \"dpapi::\" or TargetProcessCommandLine contains \"event::clear\" or TargetProcessCommandLine contains \"event::drop\" or TargetProcessCommandLine contains \"id::modify\" or TargetProcessCommandLine contains \"kerberos::\" or TargetProcessCommandLine contains \"lsadump::\" or TargetProcessCommandLine contains \"misc::\" or TargetProcessCommandLine contains \"privilege::\" or TargetProcessCommandLine contains \"rpc::\" or TargetProcessCommandLine contains \"sekurlsa::\" or TargetProcessCommandLine contains \"sid::\" or TargetProcessCommandLine contains \"token::\" or TargetProcessCommandLine contains \"vault::cred\" or TargetProcessCommandLine contains \"vault::list\" or TargetProcessCommandLine contains \" p::d \" or TargetProcessCommandLine contains \";iex(\" or TargetProcessCommandLine contains \"MiniDump\" or TargetProcessCommandLine contains \"net user \"))) and (not((TargetProcessCommandLine =~ \"ping 127.0.0.1 -n 5\" or (TargetProcessName endswith \"\\\\PING.EXE\" and ActingProcessCommandLine contains \"\\\\DismFoDInstall.cmd\") or ActingProcessName contains \":\\\\Packages\\\\Plugins\\\\Microsoft.GuestConfiguration.ConfigurationforWindows\\\\\" or ((ActingProcessName contains \":\\\\Program Files (x86)\\\\Java\\\\\" or ActingProcessName contains \":\\\\Program Files\\\\Java\\\\\") and ActingProcessName endswith \"\\\\bin\\\\javaws.exe\" and (TargetProcessName contains \":\\\\Program Files (x86)\\\\Java\\\\\" or TargetProcessName contains \":\\\\Program Files\\\\Java\\\\\") and TargetProcessName endswith \"\\\\bin\\\\jp2launcher.exe\" and TargetProcessCommandLine contains \" -ma \")))))|extend RuleId=\"2617e7ed-adb7-40ba-b0f3-8f9945fe6c09\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_system_user_anomaly.yml\"|extend RuleTitle=\"Suspicious SYSTEM User Process Creation\"|extend RuleDescription=\"Detects a suspicious process creation as SYSTEM user (suspicious program or command line parameter)\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"echo \" or TargetProcessCommandLine contains \"copy \" or TargetProcessCommandLine contains \"type \" or TargetProcessCommandLine contains \"file createnew\") and (TargetProcessCommandLine contains \" C:\\\\Windows\\\\System32\\\\Tasks\\\\\" or TargetProcessCommandLine contains \" C:\\\\Windows\\\\SysWow64\\\\Tasks\\\\\"))|extend RuleId=\"cc4e02ba-9c06-48e2-b09e-2500cace9ae0\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_task_folder_evasion.yml\"|extend RuleTitle=\"Tasks Folder Evasion\"|extend RuleDescription=\"The Tasks folder in system32 and syswow64 are globally writable paths.\\nAdversaries can take advantage of this and load or influence any script hosts or ANY .NET Application\\nin Tasks to load and execute a custom assembly into cscript, wscript, regsvr32, mshta, eventvwr\\n\";\nlet q4=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \".exe whoami\"|extend RuleId=\"e9142d84-fbe0-401d-ac50-3e519fb00c89\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_whoami_as_param.yml\"|extend RuleTitle=\"WhoAmI as Parameter\"|extend RuleDescription=\"Detects a suspicious process command line that uses whoami as first parameter (as e.g. used by EfsPotato)\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\control.exe\" and ActingProcessName endswith \"\\\\WorkFolders.exe\") and (not(TargetProcessName =~ \"C:\\\\Windows\\\\System32\\\\control.exe\")))|extend RuleId=\"0bbc6369-43e3-453d-9944-cae58821c173\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_workfolders.yml\"|extend RuleTitle=\"Execution via WorkFolders.exe\"|extend RuleDescription=\"Detects using WorkFolders.exe to execute an arbitrary control.exe\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessCommandLine endswith \"svchost.exe\" and TargetProcessName endswith \"\\\\svchost.exe\") and (not(((ActingProcessName endswith \"\\\\rpcnet.exe\" or ActingProcessName endswith \"\\\\rpcnetp.exe\") or isempty(TargetProcessCommandLine)))))|extend RuleId=\"16c37b52-b141-42a5-a3ea-bbe098444397\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_svchost_execution_with_no_cli_flags.yml\"|extend RuleTitle=\"Suspect Svchost Activity\"|extend RuleDescription=\"It is extremely abnormal for svchost.exe to spawn without any CLI arguments and is normally observed when a malicious process spawns the process and injects code into the process memory space.\";\nlet q7=_Im_ProcessCreate\n| where ((ActingProcessCommandLine contains \"\\\\svchost.exe\" and ActingProcessCommandLine contains \"termsvcs\") and (not(((TargetProcessName endswith \"\\\\rdpclip.exe\" or TargetProcessName endswith \":\\\\Windows\\\\System32\\\\csrss.exe\" or TargetProcessName endswith \":\\\\Windows\\\\System32\\\\wininit.exe\" or TargetProcessName endswith \":\\\\Windows\\\\System32\\\\winlogon.exe\") or isempty(TargetProcessName)))))|extend RuleId=\"1012f107-b8f1-4271-af30-5aed2de89b39\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_svchost_termserv_proc_spawn.yml\"|extend RuleTitle=\"Terminal Service Process Spawn\"|extend RuleDescription=\"Detects a process spawned by the terminal service server process (this could be an indicator for an exploitation of CVE-2019-0708)\";\nlet q8=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\ADExplorer.exe\" or TargetProcessFilename =~ \"AdExp\") and TargetProcessCommandLine contains \"snapshot\" and (TargetProcessCommandLine contains \"\\\\Downloads\\\\\" or TargetProcessCommandLine contains \"\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\Temp\\\\\"))|extend RuleId=\"ef61af62-bc74-4f58-b49b-626448227652\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_adexplorer_susp_execution.yml\"|extend RuleTitle=\"Suspicious Active Directory Database Snapshot Via ADExplorer\"|extend RuleDescription=\"Detects the execution of Sysinternals ADExplorer with the \\\"-snapshot\\\" flag in order to save a local copy of the active directory database to a suspicious directory.\";\nlet q9=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \" -m\"\n| where TargetProcessCommandLine contains \" /m\"\n| where (((TargetProcessName endswith \"\\\\livekd.exe\" or TargetProcessName endswith \"\\\\livekd64.exe\") or TargetProcessFilename =~ \"livekd.exe\") and ())|extend RuleId=\"c7746f1c-47d3-43d6-8c45-cd1e54b6b0a2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_livekd_kernel_memory_dump.yml\"|extend RuleTitle=\"Kernel Memory Dump Via LiveKD\"|extend RuleDescription=\"Detects execution of LiveKD with the \\\"-m\\\" flag to potentially dump the kernel memory\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["PrivilegeEscalation", "Discovery", "DefenseEvasion", "CredentialAccess", "InitialAccess", "Persistence", "Execution", "LateralMovement"],
                "techniques": ["T1003", "T1036", "T1210", "T1027", "T1055", "T1190", "T1033", "T1552", "T1134", "T1574", "T1059", "T1218"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000239",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}