{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000107')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000107')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 07",
                "description": "Sigma Windows Process Creation low 07",
                "severity": "low",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\cmd.exe\") and (ActingProcessCommandLine contains \"MsiExec.exe\" and ActingProcessCommandLine contains \"-Embedding \")) and (not(((TargetProcessName endswith \":\\\\Windows\\\\System32\\\\cmd.exe\" and TargetProcessCommandLine contains \"C:\\\\Program Files\\\\SplunkUniversalForwarder\\\\bin\\\\\") or (TargetProcessCommandLine contains \"\\\\DismFoDInstall.cmd\" or (ActingProcessCommandLine contains \"\\\\MsiExec.exe -Embedding \" and ActingProcessCommandLine contains \"Global\\\\MSI0000\"))))))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000106\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_msiexec_embedding.yml\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\msiexec.exe\" and (TargetProcessCommandLine contains \" /y\" or TargetProcessCommandLine contains \" -y\")) and (not((TargetProcessCommandLine contains \"\\\\MsiExec.exe\\\" /Y \\\"C:\\\\Program Files\\\\Bonjour\\\\mdnsNSP.dll\" or TargetProcessCommandLine contains \"\\\\MsiExec.exe\\\" /Y \\\"C:\\\\Program Files (x86)\\\\Bonjour\\\\mdnsNSP.dll\" or TargetProcessCommandLine contains \"\\\\MsiExec.exe\\\" /Y \\\"C:\\\\Program Files (x86)\\\\Apple Software Update\\\\ScriptingObjectModel.dll\" or TargetProcessCommandLine contains \"\\\\MsiExec.exe\\\" /Y \\\"C:\\\\Program Files (x86)\\\\Apple Software Update\\\\SoftwareUpdateAdmin.dll\" or TargetProcessCommandLine contains \"\\\\MsiExec.exe\\\" /Y \\\"C:\\\\Windows\\\\CCM\\\\\" or TargetProcessCommandLine contains \"\\\\MsiExec.exe\\\" /Y C:\\\\Windows\\\\CCM\\\\\" or TargetProcessCommandLine contains \"\\\\MsiExec.exe\\\" -Y \\\"C:\\\\Program Files\\\\Bonjour\\\\mdnsNSP.dll\" or TargetProcessCommandLine contains \"\\\\MsiExec.exe\\\" -Y \\\"C:\\\\Program Files (x86)\\\\Bonjour\\\\mdnsNSP.dll\" or TargetProcessCommandLine contains \"\\\\MsiExec.exe\\\" -Y \\\"C:\\\\Program Files (x86)\\\\Apple Software Update\\\\ScriptingObjectModel.dll\" or TargetProcessCommandLine contains \"\\\\MsiExec.exe\\\" -Y \\\"C:\\\\Program Files (x86)\\\\Apple Software Update\\\\SoftwareUpdateAdmin.dll\" or TargetProcessCommandLine contains \"\\\\MsiExec.exe\\\" -Y \\\"C:\\\\Windows\\\\CCM\\\\\" or TargetProcessCommandLine contains \"\\\\MsiExec.exe\\\" -Y C:\\\\Windows\\\\CCM\\\\\"))))|extend RuleId=\"6f4191bb-912b-48a8-9ce7-682769541e6d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_msiexec_execute_dll.yml\";\nlet q2=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\msiexec.exe\" or TargetProcessFilename =~ \"msiexec.exe\") and (TargetProcessCommandLine contains \"/i\" or TargetProcessCommandLine contains \"-i\" or TargetProcessCommandLine contains \"/package\" or TargetProcessCommandLine contains \"-package\" or TargetProcessCommandLine contains \"/a\" or TargetProcessCommandLine contains \"-a\" or TargetProcessCommandLine contains \"/j\" or TargetProcessCommandLine contains \"-j\") and (TargetProcessCommandLine contains \"/q\" or TargetProcessCommandLine contains \"-q\")) and (not(((ActingProcessName startswith \"C:\\\\Users\\\\\" and ActingProcessName contains \"\\\\AppData\\\\Local\\\\Temp\\\\\") or ActingProcessName startswith \"C:\\\\Windows\\\\Temp\\\\\" or (ActingProcessName =~ \"C:\\\\Windows\\\\CCM\\\\Ccm32BitLauncher.exe\" and TargetProcessIntegrityLevel =~ \"System\")))))|extend RuleId=\"79a87aa6-e4bd-42fc-a5bb-5e6fbdcd62f5\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_msiexec_install_quiet.yml\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\msiexec.exe\" or TargetProcessFilename =~ \"msiexec.exe\") and (TargetProcessCommandLine contains \"/i\" or TargetProcessCommandLine contains \"-i\" or TargetProcessCommandLine contains \"/package\" or TargetProcessCommandLine contains \"-package\" or TargetProcessCommandLine contains \"/a\" or TargetProcessCommandLine contains \"-a\" or TargetProcessCommandLine contains \"/j\" or TargetProcessCommandLine contains \"-j\") and (TargetProcessCommandLine contains \"/q\" or TargetProcessCommandLine contains \"-q\") and (TargetProcessCommandLine contains \"http\" or TargetProcessCommandLine contains \"\\\\\\\\\"))|extend RuleId=\"8150732a-0c9d-4a99-82b9-9efb9b90c40c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_msiexec_install_remote.yml\";\nlet q4=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \" msiexec\" and TargetProcessCommandLine contains \"://\")|extend RuleId=\"f7b5f842-a6af-4da5-9e95-e32478f3cd2f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_msiexec_web_install.yml\";\nlet q5=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\sqlps.exe\" or ((TargetProcessName endswith \"\\\\sqlps.exe\" or TargetProcessFilename =~ \"sqlps.exe\") and (not(ActingProcessName endswith \"\\\\sqlagent.exe\"))))|extend RuleId=\"0152550d-3a26-4efd-9f0e-54a0b28ae2f3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_mssql_sqlps_susp_execution.yml\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\sqltoolsps.exe\" or ActingProcessName endswith \"\\\\sqltoolsps.exe\" or TargetProcessFilename =~ \"\\\\sqltoolsps.exe\") and (not(ActingProcessName endswith \"\\\\smss.exe\")))|extend RuleId=\"a746c9b8-a2fb-4ee5-a428-92bee9e99060\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_mssql_sqltoolsps_susp_execution.yml\";\nlet q7=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\mstsc.exe\" or TargetProcessFilename =~ \"mstsc.exe\") and TargetProcessCommandLine contains \" /v:\") and (not((ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\lxss\\\\wslhost.exe\" and TargetProcessCommandLine contains \"C:\\\\ProgramData\\\\Microsoft\\\\WSL\\\\wslg.rdp\"))))|extend RuleId=\"954f0af7-62dd-418f-b3df-a84bc2c7a774\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_mstsc_remote_connection.yml\";\nlet q8=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\netsh.exe\" or TargetProcessFilename =~ \"netsh.exe\") and (TargetProcessCommandLine contains \" firewall \" and TargetProcessCommandLine contains \" add \")) and (not(((TargetProcessCommandLine contains \"\\\\netsh.exe advfirewall firewall add rule name=Dropbox dir=in action=allow \\\"program=C:\\\\Program Files (x86)\\\\Dropbox\\\\Client\\\\Dropbox.exe\\\" enable=yes profile=Any\" or TargetProcessCommandLine contains \"\\\\netsh.exe advfirewall firewall add rule name=Dropbox dir=in action=allow \\\"program=C:\\\\Program Files\\\\Dropbox\\\\Client\\\\Dropbox.exe\\\" enable=yes profile=Any\") or (ActingProcessName startswith \"C:\\\\Windows\\\\Temp\\\\asgard2-agent\\\\\" and ActingProcessName endswith \"\\\\thor64.exe\" and TargetProcessCommandLine contains \"advfirewall firewall show rule name=all\")))))|extend RuleId=\"cd5cfd80-aa5f-44c0-9c20-108c4ae12e3c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_netsh_fw_add_rule.yml\";\nlet q9=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\netsh.exe\" or TargetProcessFilename =~ \"netsh.exe\") and (TargetProcessCommandLine contains \"firewall\" and TargetProcessCommandLine contains \"delete \")) and (not((ActingProcessName endswith \"\\\\Dropbox.exe\" and TargetProcessCommandLine contains \"name=Dropbox\"))))|extend RuleId=\"1a5fefe6-734f-452e-a07d-fc1c35bce4b2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_netsh_fw_delete_rule.yml\";\nlet q10=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\netsh.exe\" or TargetProcessFilename =~ \"netsh.exe\") and ((TargetProcessCommandLine contains \"firewall\" and TargetProcessCommandLine contains \"set\" and TargetProcessCommandLine contains \"opmode\" and TargetProcessCommandLine contains \"disable\") or (TargetProcessCommandLine contains \"advfirewall\" and TargetProcessCommandLine contains \"set\" and TargetProcessCommandLine contains \"state\" and TargetProcessCommandLine contains \"off\")))|extend RuleId=\"57c4bf16-227f-4394-8ec7-1b745ee061c3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_netsh_fw_disable.yml\";\nlet q11=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\netsh.exe\" or TargetProcessFilename =~ \"netsh.exe\") and (TargetProcessCommandLine contains \"advfirewall\" and TargetProcessCommandLine contains \"firewall\" and TargetProcessCommandLine contains \"set\" and TargetProcessCommandLine contains \"rule\" and TargetProcessCommandLine contains \"group=\" and TargetProcessCommandLine contains \"new\" and TargetProcessCommandLine contains \"enable=Yes\"))|extend RuleId=\"347906f3-e207-4d18-ae5b-a9403d6bcdef\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_netsh_fw_enable_group_rule.yml\";\nlet q12=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\netsh.exe\" or TargetProcessFilename =~ \"netsh.exe\") and (TargetProcessCommandLine contains \" firewall \" and TargetProcessCommandLine contains \" set \"))|extend RuleId=\"a70dcb37-3bee-453a-99df-d0c683151be6\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_netsh_fw_set_rule.yml\";\nlet q13=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\netsh.exe\" or TargetProcessFilename =~ \"netsh.exe\") and (TargetProcessCommandLine contains \"trace\" and TargetProcessCommandLine contains \"start\"))|extend RuleId=\"d3c3861d-c504-4c77-ba55-224ba82d0118\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_netsh_packet_capture.yml\";\nlet q14=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\netsh.exe\" or TargetProcessFilename =~ \"netsh.exe\") and ((TargetProcessCommandLine contains \"interface\" and TargetProcessCommandLine contains \"portproxy\" and TargetProcessCommandLine contains \"add\" and TargetProcessCommandLine contains \"v4tov4\") or (TargetProcessCommandLine contains \"i \" and TargetProcessCommandLine contains \"p \" and TargetProcessCommandLine contains \"a \" and TargetProcessCommandLine contains \"v \") or (TargetProcessCommandLine contains \"connectp\" and TargetProcessCommandLine contains \"listena\" and TargetProcessCommandLine contains \"c=\")))|extend RuleId=\"322ed9ec-fcab-4f67-9a34-e7c6aef43614\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_netsh_port_forwarding.yml\";\nlet q15=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\netsh.exe\" or TargetProcessFilename =~ \"netsh.exe\") and (TargetProcessCommandLine contains \"wlan\" and TargetProcessCommandLine contains \" s\" and TargetProcessCommandLine contains \" p\" and TargetProcessCommandLine contains \" k\" and TargetProcessCommandLine contains \"=clear\"))|extend RuleId=\"42b1a5b8-353f-4f10-b256-39de4467faff\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_netsh_wifi_credential_harvesting.yml\";\nlet q16=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\tshark.exe\" and TargetProcessCommandLine contains \"-i\") or TargetProcessName endswith \"\\\\windump.exe\")|extend RuleId=\"ba1f7802-adc7-48b4-9ecb-81e227fddfd5\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_network_sniffing.yml\";\nlet q17=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") or (TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\")) and ((((TargetProcessCommandLine contains \" group \" or TargetProcessCommandLine contains \" localgroup \") and (TargetProcessCommandLine contains \"domain admins\" or TargetProcessCommandLine contains \" administrator\" or TargetProcessCommandLine contains \" administrateur\" or TargetProcessCommandLine contains \"enterprise admins\" or TargetProcessCommandLine contains \"Exchange Trusted Subsystem\" or TargetProcessCommandLine contains \"Remote Desktop Users\" or TargetProcessCommandLine contains \"Utilisateurs du Bureau \u00e0 distance\" or TargetProcessCommandLine contains \"Usuarios de escritorio remoto\" or TargetProcessCommandLine contains \" /do\")) and (not(TargetProcessCommandLine contains \" /add\"))) or (TargetProcessCommandLine contains \" accounts \" and TargetProcessCommandLine contains \" /do\")))|extend RuleId=\"d95de845-b83c-4a9a-8a6a-4fc802ebf6c0\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_groups_and_accounts_recon.yml\";\nlet q18=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") or (TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\")) and (TargetProcessCommandLine contains \"user\" and TargetProcessCommandLine contains \"add\"))|extend RuleId=\"cd219ff3-fa99-45d4-8380-a7d15116c6dc\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_user_add.yml\";\nlet q19=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") or (TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\")) and (TargetProcessCommandLine contains \" use \" and ))|extend RuleId=\"3abd6094-7027-475f-9630-8ab9be7b9725\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_use_mount_admin_share.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["LateralMovement", "Execution", "Persistence", "CredentialAccess", "CommandAndControl", "Discovery", "DefenseEvasion"],
                "techniques": ["T1218", "T1105", "T1090", "T1040", "T1136", "T1021", "T1127", "T1562", "T1087", "T1059"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000107",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}