{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000114')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000114')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation low 14",
                "description": "Sigma Windows Process Creation low 14",
                "severity": "low",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \" -executionpolicy \" or TargetProcessCommandLine contains \" -ep \" or TargetProcessCommandLine contains \" -exec \") and (TargetProcessCommandLine contains \"Unrestricted\" or TargetProcessCommandLine contains \"bypass\" or TargetProcessCommandLine contains \"RemoteSigned\")) and (not((TargetProcessCommandLine contains \"C:\\\\Program Files\" or TargetProcessCommandLine contains \"C:\\\\ProgramData\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\Code\\\\\"))))|extend RuleId=\"87e3c4e8-a6a8-4ad9-bb4f-46e7ff99a180\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_set_policies_to_unsecure_level.yml\"|extend RuleTitle=\"Change PowerShell Policies to an Insecure Level\"|extend RuleDescription=\"\"Detects use of executionpolicy option to set insecure policies\"\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessFilename =~ \"PowerShell.EXE\") and ((TargetProcessCommandLine contains \"Set-Service\" and TargetProcessCommandLine contains \"-StartupType\") and (TargetProcessCommandLine contains \"Disabled\" or TargetProcessCommandLine contains \"Manual\")))|extend RuleId=\"62b20d44-1546-4e61-afce-8e175eb9473c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_set_service_disabled.yml\"|extend RuleTitle=\"Service StartupType Change Via PowerShell Set-Service\"|extend RuleDescription=\"\"Detects the use of the PowerShell \\\"Set-Service\\\" cmdlet to change the startup type of a service to \\\"disabled\\\" or \\\"manual\\\"\"\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"powershell.exe\" or TargetProcessCommandLine contains \"\\\\powershell\" or TargetProcessCommandLine contains \"\\\\pwsh\" or TargetProcessCommandLine contains \"pwsh.exe\") and ((TargetProcessCommandLine contains \"/c \" and TargetProcessCommandLine contains \"\\\\AppData\\\\\") and (TargetProcessCommandLine contains \"Local\\\\\" or TargetProcessCommandLine contains \"Roaming\\\\\")))|extend RuleId=\"ac175779-025a-4f12-98b0-acdaeb77ea85\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_susp_ps_appdata.yml\"|extend RuleTitle=\"PowerShell Script Run in AppData\"|extend RuleDescription=\"\"Detects a suspicious command line execution that invokes PowerShell with reference to an AppData folder\"\";\nlet q3=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and ((TargetProcessCommandLine contains \"Get-ADUser \" and TargetProcessCommandLine contains \" -Filter \\*\") and (TargetProcessCommandLine contains \" > \" or TargetProcessCommandLine contains \" | Select \" or TargetProcessCommandLine contains \"Out-File\" or TargetProcessCommandLine contains \"Set-Content\" or TargetProcessCommandLine contains \"Add-Content\")))|extend RuleId=\"1114e048-b69c-4f41-bc20-657245ae6e3f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_user_discovery_get_aduser.yml\"|extend RuleTitle=\"User Discovery And Export Via Get-ADUser Cmdlet\"|extend RuleDescription=\"\"Detects usage of the Get-ADUser cmdlet to collect user information and output it to a file\"\";\nlet q4=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"X509Enrollment.CBinaryConverter\" or TargetProcessCommandLine contains \"884e2002-217d-11da-b2a4-000e7bbb2b09\")|extend RuleId=\"114de787-4eb2-48cc-abdb-c0b449f93ea4\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_x509enrollment.yml\"|extend RuleTitle=\"Suspicious X509Enrollment - Process Creation\"|extend RuleDescription=\"\"Detect use of X509Enrollment\"\";\nlet q5=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\") or TargetProcessFileDescription =~ \"Windows PowerShell\" or TargetProcessFileProduct =~ \"PowerShell Core 6\") and TargetProcessCommandLine contains \"bxor\" and (TargetProcessCommandLine contains \"ForEach\" or TargetProcessCommandLine contains \"for(\" or TargetProcessCommandLine contains \"for \" or TargetProcessCommandLine contains \"-join \" or TargetProcessCommandLine contains \"-join'\" or TargetProcessCommandLine contains \"-join\\\"\" or TargetProcessCommandLine contains \"-join`\" or TargetProcessCommandLine contains \"::Join\" or TargetProcessCommandLine contains \"[char]\"))|extend RuleId=\"bb780e0c-16cf-4383-8383-1e5471db6cf9\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_xor_commandline.yml\"|extend RuleTitle=\"Suspicious XOR Encoded PowerShell Command\"|extend RuleDescription=\"\"Detects presence of a potentially xor encoded powershell command\"\";\nlet q6=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"Compress-Archive \" and TargetProcessCommandLine contains \" -Path \" and TargetProcessCommandLine contains \" -DestinationPath \" and TargetProcessCommandLine contains \"$env:TEMP\\\\\")|extend RuleId=\"85a8e5ba-bd03-4bfb-bbfa-a4409a8f8b98\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_zip_compress.yml\"|extend RuleTitle=\"Zip A Folder With PowerShell For Staging In Temp\"|extend RuleDescription=\"\"Use living off the land tools to zip a file and stage it in the Windows temporary folder for later exfiltration\"\";\nlet q7=_Im_ProcessCreate\n| where ActingProcessName endswith \"\\\\Microsoft.NodejsTools.PressAnyKey.exe\"|extend RuleId=\"a20391f8-76fb-437b-abc0-dba2df1952c6\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pressanykey_lolbin_execution.yml\"|extend RuleTitle=\"Visual Studio NodejsTools PressAnyKey Arbitrary Binary Execution\"|extend RuleDescription=\"\"Detects child processes of Microsoft.NodejsTools.PressAnyKey.exe that can be used to execute any other binary\"\";\nlet q8=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\print.exe\" and TargetProcessCommandLine startswith \"print\" and (TargetProcessCommandLine contains \"/D\" and TargetProcessCommandLine contains \".exe\")) and (not(TargetProcessCommandLine contains \"print.exe\")))|extend RuleId=\"bafac3d6-7de9-4dd9-8874-4a1194b493ed\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_print_remote_file_copy.yml\"|extend RuleTitle=\"Abusing Print Executable\"|extend RuleDescription=\"\"Attackers can use print.exe for remote file copy\"\";\nlet q9=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\provlaunch.exe\" and (not(((TargetProcessName endswith \"\\\\calc.exe\" or TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\notepad.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\wscript.exe\") or (TargetProcessName contains \":\\\\PerfLogs\\\\\" or TargetProcessName contains \":\\\\Temp\\\\\" or TargetProcessName contains \":\\\\Users\\\\Public\\\\\" or TargetProcessName contains \"\\\\AppData\\\\Temp\\\\\" or TargetProcessName contains \"\\\\Windows\\\\System32\\\\Tasks\\\\\" or TargetProcessName contains \"\\\\Windows\\\\Tasks\\\\\" or TargetProcessName contains \"\\\\Windows\\\\Temp\\\\\")))))|extend RuleId=\"7f5d1c9a-3e83-48df-95a7-2b98aae6c13c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_provlaunch_potential_abuse.yml\"|extend RuleTitle=\"Potential Provlaunch.EXE Binary Proxy Execution Abuse\"|extend RuleDescription=\"\"Detects child processes of \\\"provlaunch.exe\\\" which might indicate potential abuse to proxy execution.\"\";\nlet q10=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\Psr.exe\" and TargetProcessCommandLine contains \"/start\")|extend RuleId=\"2158f96f-43c2-43cb-952a-ab4580f32382\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_psr_capture_screenshots.yml\"|extend RuleTitle=\"Psr.exe Capture Screenshots\"|extend RuleDescription=\"\"The psr.exe captures desktop screenshots and saves them on the local machine\"\";\nlet q11=_Im_ProcessCreate\n| where (TargetProcessFilename =~ \"AdvancedRun.exe\" or (TargetProcessCommandLine contains \" /EXEFilename \" and TargetProcessCommandLine contains \" /Run\") or (TargetProcessCommandLine contains \" /WindowState 0\" and TargetProcessCommandLine contains \" /RunAs \" and TargetProcessCommandLine contains \" /CommandLine \"))|extend RuleId=\"d2b749ee-4225-417e-b20e-a8d2193cbb84\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_advancedrun.yml\"|extend RuleTitle=\"PUA - AdvancedRun Execution\"|extend RuleDescription=\"\"Detects the execution of AdvancedRun utility\"\";\nlet q12=_Im_ProcessCreate\n| where ((TargetProcessName contains \"\\\\advanced_ip_scanner\" or TargetProcessFilename contains \"advanced_ip_scanner\" or TargetProcessFileDescription contains \"Advanced IP Scanner\") or (TargetProcessCommandLine contains \"/portable\" and TargetProcessCommandLine contains \"/lng\"))|extend RuleId=\"bef37fa2-f205-4a7b-b484-0759bfd5f86f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_advanced_ip_scanner.yml\"|extend RuleTitle=\"PUA - Advanced IP Scanner Execution\"|extend RuleDescription=\"\"Detects the use of Advanced IP Scanner. Seems to be a popular tool for ransomware groups.\"\";\nlet q13=_Im_ProcessCreate\n| where ((TargetProcessName contains \"\\\\advanced_port_scanner\" or TargetProcessFilename contains \"advanced_port_scanner\" or TargetProcessFileDescription contains \"Advanced Port Scanner\") or (TargetProcessCommandLine contains \"/portable\" and TargetProcessCommandLine contains \"/lng\"))|extend RuleId=\"54773c5f-f1cc-4703-9126-2f797d96a69d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_advanced_port_scanner.yml\"|extend RuleTitle=\"PUA - Advanced Port Scanner Execution\"|extend RuleDescription=\"\"Detects the use of Advanced Port Scanner.\"\";\nlet q14=_Im_ProcessCreate\n| where (TargetProcessFileProduct contains \"Mouse Lock\" or TargetProcessFileCompany contains \"Misc314\" or TargetProcessCommandLine contains \"Mouse Lock_\")|extend RuleId=\"c9192ad9-75e5-43eb-8647-82a0a5b493e3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_mouselock_execution.yml\"|extend RuleTitle=\"PUA - Mouse Lock Execution\"|extend RuleDescription=\"\"In Kaspersky's 2020 Incident Response Analyst Report they listed legitimate tool \\\"Mouse Lock\\\" as being used for both credential access and collection in security incidents.\"\";\nlet q15=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\NirCmd.exe\" or TargetProcessFilename =~ \"NirCmd.exe\") or (TargetProcessCommandLine contains \" execmd \" or TargetProcessCommandLine contains \".exe script \" or TargetProcessCommandLine contains \".exe shexec \" or TargetProcessCommandLine contains \" runinteractive \")) or ((TargetProcessCommandLine contains \" exec \" or TargetProcessCommandLine contains \" exec2 \") and (TargetProcessCommandLine contains \" show \" or TargetProcessCommandLine contains \" hide \")))|extend RuleId=\"4e2ed651-1906-4a59-a78a-18220fca1b22\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_nircmd.yml\"|extend RuleTitle=\"PUA - NirCmd Execution\"|extend RuleDescription=\"\"Detects the use of NirCmd tool for command execution, which could be the result of legitimate administrative activity\"\";\nlet q16=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\rcedit-x64.exe\" or TargetProcessName endswith \"\\\\rcedit-x86.exe\") or TargetProcessFileDescription =~ \"Edit resources of exe\" or TargetProcessFileProduct =~ \"rcedit\") and TargetProcessCommandLine contains \"--set-\" and (TargetProcessCommandLine contains \"OriginalFileName\" or TargetProcessCommandLine contains \"CompanyName\" or TargetProcessCommandLine contains \"FileDescription\" or TargetProcessCommandLine contains \"ProductName\" or TargetProcessCommandLine contains \"ProductVersion\" or TargetProcessCommandLine contains \"LegalCopyright\"))|extend RuleId=\"0c92f2e6-f08f-4b73-9216-ecb0ca634689\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_rcedit_execution.yml\"|extend RuleTitle=\"PUA - Potential PE Metadata Tamper Using Rcedit\"|extend RuleDescription=\"\"Detects the use of rcedit to potentially alter executable PE metadata properties, which could conceal efforts to rename system utilities for defense evasion.\"\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "Collection", "CredentialAccess", "PrivilegeEscalation", "Execution", "Discovery"],
                "techniques": ["T1059", "T1135", "T1140", "T1134", "T1553", "T1056", "T1569", "T1033", "T1036", "T1562", "T1113", "T1046", "T1074", "T1564", "T1218", "T1027"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000114",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}