{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000235')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000235')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 35",
                "description": "Sigma Windows Process Creation medium 35",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\wevtutil.exe\" and (TargetProcessCommandLine contains \"clear-log \" or TargetProcessCommandLine contains \" cl \" or TargetProcessCommandLine contains \"set-log \" or TargetProcessCommandLine contains \" sl \" or TargetProcessCommandLine contains \"lfn:\")) or ((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") and (TargetProcessCommandLine contains \"Clear-EventLog \" or TargetProcessCommandLine contains \"Remove-EventLog \" or TargetProcessCommandLine contains \"Limit-EventLog \" or TargetProcessCommandLine contains \"Clear-WinEvent \")) or ((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\wmic.exe\") and TargetProcessCommandLine contains \"ClearEventLog\")) and (not(((ActingProcessName =~ \"C:\\\\Windows\\\\SysWOW64\\\\msiexec.exe\" or ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\msiexec.exe\") and TargetProcessCommandLine contains \" sl \"))))|extend RuleId=\"cc36992a-4671-4f21-a91d-6c2b72a2edf5\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_eventlog_clear.yml\"|extend RuleTitle=\"Suspicious Eventlog Clear or Configuration Change\"|extend RuleDescription=\"Detects clearing or configuration of eventlogs using wevtutil, powershell and wmic. Might be used by ransomwares during the attack (seen by NotPetya and others).\";\nlet q1=_Im_ProcessCreate\n| where (ActingProcessName startswith \"C:\\\\Users\\\\Public\\\\\" and (TargetProcessCommandLine contains \"powershell\" or TargetProcessCommandLine contains \"cmd.exe /c \" or TargetProcessCommandLine contains \"cmd.exe /r \" or TargetProcessCommandLine contains \"cmd.exe /k \" or TargetProcessCommandLine contains \"cmd /c \" or TargetProcessCommandLine contains \"cmd /r \" or TargetProcessCommandLine contains \"cmd /k \" or TargetProcessCommandLine contains \"wscript.exe\" or TargetProcessCommandLine contains \"cscript.exe\" or TargetProcessCommandLine contains \"bitsadmin\" or TargetProcessCommandLine contains \"certutil\" or TargetProcessCommandLine contains \"mshta.exe\"))|extend RuleId=\"69bd9b97-2be2-41b6-9816-fb08757a4d1a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_execution_from_public_folder_as_parent.yml\"|extend RuleTitle=\"Parent in Public Folder Suspicious Process\"|extend RuleDescription=\"This rule detects suspicious processes with parent images located in the C:\\\\Users\\\\Public folder\";\nlet q2=_Im_ProcessCreate\n| where (((TargetProcessName contains \"\\\\$Recycle.bin\\\\\" or TargetProcessName contains \"\\\\config\\\\systemprofile\\\\\" or TargetProcessName contains \"\\\\Intel\\\\Logs\\\\\" or TargetProcessName contains \"\\\\RSA\\\\MachineKeys\\\\\" or TargetProcessName contains \"\\\\Users\\\\All Users\\\\\" or TargetProcessName contains \"\\\\Users\\\\Default\\\\\" or TargetProcessName contains \"\\\\Users\\\\NetworkService\\\\\" or TargetProcessName contains \"\\\\Users\\\\Public\\\\\" or TargetProcessName contains \"\\\\Windows\\\\addins\\\\\" or TargetProcessName contains \"\\\\Windows\\\\debug\\\\\" or TargetProcessName contains \"\\\\Windows\\\\Fonts\\\\\" or TargetProcessName contains \"\\\\Windows\\\\Help\\\\\" or TargetProcessName contains \"\\\\Windows\\\\IME\\\\\" or TargetProcessName contains \"\\\\Windows\\\\Media\\\\\" or TargetProcessName contains \"\\\\Windows\\\\repair\\\\\" or TargetProcessName contains \"\\\\Windows\\\\security\\\\\" or TargetProcessName contains \"\\\\Windows\\\\System32\\\\Tasks\\\\\" or TargetProcessName contains \"\\\\Windows\\\\Tasks\\\\\") or TargetProcessName startswith \"C:\\\\Perflogs\\\\\") and (not((TargetProcessName startswith \"C:\\\\Users\\\\Public\\\\IBM\\\\ClientSolutions\\\\Start_Programs\\\\\" or (TargetProcessName startswith \"C:\\\\Windows\\\\SysWOW64\\\\config\\\\systemprofile\\\\Citrix\\\\UpdaterBinaries\\\\\" and TargetProcessName endswith \"\\\\CitrixReceiverUpdater.exe\")))))|extend RuleId=\"3dfd06d2-eaf4-4532-9555-68aca59f57c4\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_execution_path.yml\"|extend RuleTitle=\"Execution from Suspicious Folder\"|extend RuleDescription=\"Detects a suspicious execution from an uncommon folder\";\nlet q3=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"gatherNetworkInfo.vbs\" and (not((TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\wscript.exe\"))))|extend RuleId=\"07aa184a-870d-413d-893a-157f317f6f58\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_gather_network_info_execution.yml\"|extend RuleTitle=\"Suspicious Reconnaissance Activity Via GatherNetworkInfo.VBS\"|extend RuleDescription=\"Detects execution of the built-in script located in \\\"C:\\\\Windows\\\\System32\\\\gatherNetworkInfo.vbs\\\". Which can be used to gather information about the target machine\";\nlet q4=_Im_ProcessCreate\n| where ((not(TargetProcessName contains \"\\\\\")) and (not((isnull(TargetProcessName) or (TargetProcessName =~ \"-\" or TargetProcessName =~ \"\") or ((TargetProcessName =~ \"System\" or TargetProcessName =~ \"Registry\" or TargetProcessName =~ \"MemCompression\" or TargetProcessName =~ \"vmmem\") or (TargetProcessCommandLine =~ \"Registry\" or TargetProcessCommandLine =~ \"MemCompression\" or TargetProcessCommandLine =~ \"vmmem\"))))))|extend RuleId=\"71158e3f-df67-472b-930e-7d287acaa3e1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_image_missing.yml\"|extend RuleTitle=\"Execution Of Non-Existing File\"|extend RuleDescription=\"Checks whether the image specified in a process creation event is not a full, absolute path (caused by process ghosting or other unorthodox methods to start a process)\";\nlet q5=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"TVqQAAMAAAAEAAAA\" or TargetProcessCommandLine contains \"TVpQAAIAAAAEAA8A\" or TargetProcessCommandLine contains \"TVqAAAEAAAAEABAA\" or TargetProcessCommandLine contains \"TVoAAAAAAAAAAAAA\" or TargetProcessCommandLine contains \"TVpTAQEAAAAEAAAA\")|extend RuleId=\"22e58743-4ac8-4a9f-bf19-00a0428d8c5f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_inline_base64_mz_header.yml\"|extend RuleTitle=\"Base64 MZ Header In CommandLine\"|extend RuleDescription=\"Detects encoded base64 MZ header in the commandline\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"AddSecurityPackage\" or TargetProcessCommandLine contains \"AdjustTokenPrivileges\" or TargetProcessCommandLine contains \"Advapi32\" or TargetProcessCommandLine contains \"CloseHandle\" or TargetProcessCommandLine contains \"CreateProcessWithToken\" or TargetProcessCommandLine contains \"CreatePseudoConsole\" or TargetProcessCommandLine contains \"CreateRemoteThread\" or TargetProcessCommandLine contains \"CreateThread\" or TargetProcessCommandLine contains \"CreateUserThread\" or TargetProcessCommandLine contains \"DangerousGetHandle\" or TargetProcessCommandLine contains \"DuplicateTokenEx\" or TargetProcessCommandLine contains \"EnumerateSecurityPackages\" or TargetProcessCommandLine contains \"FreeHGlobal\" or TargetProcessCommandLine contains \"FreeLibrary\" or TargetProcessCommandLine contains \"GetDelegateForFunctionPointer\" or TargetProcessCommandLine contains \"GetLogonSessionData\" or TargetProcessCommandLine contains \"GetModuleHandle\" or TargetProcessCommandLine contains \"GetProcAddress\" or TargetProcessCommandLine contains \"GetProcessHandle\" or TargetProcessCommandLine contains \"GetTokenInformation\" or TargetProcessCommandLine contains \"ImpersonateLoggedOnUser\" or TargetProcessCommandLine contains \"kernel32\" or TargetProcessCommandLine contains \"LoadLibrary\" or TargetProcessCommandLine contains \"memcpy\" or TargetProcessCommandLine contains \"MiniDumpWriteDump\" or TargetProcessCommandLine contains \"ntdll\" or TargetProcessCommandLine contains \"OpenDesktop\" or TargetProcessCommandLine contains \"OpenProcess\" or TargetProcessCommandLine contains \"OpenProcessToken\" or TargetProcessCommandLine contains \"OpenThreadToken\" or TargetProcessCommandLine contains \"OpenWindowStation\" or TargetProcessCommandLine contains \"PtrToString\" or TargetProcessCommandLine contains \"QueueUserApc\" or TargetProcessCommandLine contains \"ReadProcessMemory\" or TargetProcessCommandLine contains \"RevertToSelf\" or TargetProcessCommandLine contains \"RtlCreateUserThread\" or TargetProcessCommandLine contains \"secur32\" or TargetProcessCommandLine contains \"SetThreadToken\" or TargetProcessCommandLine contains \"VirtualAlloc\" or TargetProcessCommandLine contains \"VirtualFree\" or TargetProcessCommandLine contains \"VirtualProtect\" or TargetProcessCommandLine contains \"WaitForSingleObject\" or TargetProcessCommandLine contains \"WriteInt32\" or TargetProcessCommandLine contains \"WriteProcessMemory\" or TargetProcessCommandLine contains \"ZeroFreeGlobalAllocUnicode\") and (not((TargetProcessName endswith \"\\\\MpCmdRun.exe\" and TargetProcessCommandLine contains \"GetLoadLibraryWAddress32\"))))|extend RuleId=\"ba3f5c1b-6272-4119-9dbd-0bc8d21c2702\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_inline_win_api_access.yml\"|extend RuleTitle=\"Potential WinAPI Calls Via CommandLine\"|extend RuleDescription=\"Detects the use of WinAPI Functions via the commandline. As seen used by threat actors via the tool winapiexec\";\nlet q7=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"lsass.dmp\" or TargetProcessCommandLine contains \"lsass.zip\" or TargetProcessCommandLine contains \"lsass.rar\" or TargetProcessCommandLine contains \"Andrew.dmp\" or TargetProcessCommandLine contains \"Coredump.dmp\" or TargetProcessCommandLine contains \"NotLSASS.zip\" or TargetProcessCommandLine contains \"lsass_2\" or TargetProcessCommandLine contains \"lsassdump\" or TargetProcessCommandLine contains \"lsassdmp\") or (TargetProcessCommandLine contains \"lsass\" and TargetProcessCommandLine contains \".dmp\") or (TargetProcessCommandLine contains \"SQLDmpr\" and TargetProcessCommandLine contains \".mdmp\") or (TargetProcessCommandLine contains \"nanodump\" and TargetProcessCommandLine contains \".dmp\"))|extend RuleId=\"ffa6861c-4461-4f59-8a41-578c39f3f23e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_lsass_dmp_cli_keywords.yml\"|extend RuleTitle=\"LSASS Dump Keyword In CommandLine\"|extend RuleDescription=\"Detects the presence of the keywords \\\"lsass\\\" and \\\".dmp\\\" in the commandline, which could indicate a potential attempt to dump or create a dump of the lsass process.\\n\";\nunion q0, q1, q2, q3, q4, q5, q6, q7;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Execution", "DefenseEvasion", "Discovery", "CredentialAccess"],
                "techniques": ["T1562", "T1564", "T1106", "T1070", "T1615", "T1003", "T1059", "T1036"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000235",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}