{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-4c76-45a9-804d-dc3f355f1015')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-4c76-45a9-804d-dc3f355f1015')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 015",
                "description": "Sigma Windows Process Creation medium 015",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\chrome.exe\" or TargetProcessName endswith \"\\\\code.exe\" or TargetProcessName endswith \"\\\\discord.exe\" or TargetProcessName endswith \"\\\\GitHubDesktop.exe\" or TargetProcessName endswith \"\\\\keybase.exe\" or TargetProcessName endswith \"\\\\msedge.exe\" or TargetProcessName endswith \"\\\\msedgewebview2.exe\" or TargetProcessName endswith \"\\\\msteams.exe\" or TargetProcessName endswith \"\\\\slack.exe\" or TargetProcessName endswith \"\\\\Teams.exe\") and (TargetProcessCommandLine contains \"--browser-subprocess-path\" or TargetProcessCommandLine contains \"--gpu-launcher\" or TargetProcessCommandLine contains \"--renderer-cmd-prefix\" or TargetProcessCommandLine contains \"--utility-cmd-prefix\"))|extend RuleId=\"378a05d8-963c-46c9-bcce-13c7657eac99\";\nlet q1=_Im_ProcessCreate\n| where ((((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\cmd.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\" or TargetProcessFilename =~ \"Cmd.Exe\")) and ((TargetUsername contains \"AUTHORI\" or TargetUsername contains \"AUTORI\") and LogonId =~ \"0x3e7\")) and (not((((ActingProcessName contains \":\\\\Windows\\\\System32\\\\\" or ActingProcessName contains \":\\\\Program Files (x86)\\\\\" or ActingProcessName contains \":\\\\Program Files\\\\\") and (TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\powershell.exe\")) or ((ActingProcessName contains \":\\\\Windows\\\\System32\" or ActingProcessName contains \":\\\\Windows\\\\WinSxS\\\\\") and ActingProcessName endswith \"\\\\CompatTelRunner.exe\" and ActingProcessCommandLine contains \":\\\\Windows\\\\system32\\\\CompatTelRunner.exe -m:appraiser.dll -f:DoScheduledTelemetryRun\") or (ActingProcessName endswith \":\\\\Windows\\\\SysWOW64\\\\msiexec.exe\" and ActingProcessCommandLine contains \":\\\\Windows\\\\syswow64\\\\MsiExec.exe -Embedding\" and TargetProcessCommandLine contains \"\\\\RegisterMicrosoftUpdate.ps1\") or ((TargetProcessCommandLine startswith \"powershell.exe -ExecutionPolicy Restricted -Command  $res = 0; \" or TargetProcessCommandLine startswith \"powershell.exe -ExecutionPolicy Restricted -Command Write-Host \") and (TargetProcessCommandLine endswith \"Write-Host 'Final result:', $Res;\" or TargetProcessCommandLine endswith \"Write-Host \\\"Final result:\\\", $res\" or TargetProcessCommandLine endswith \"Write-Host 'Final result: 1';\")) or (TargetProcessName endswith \"\\\\cmd.exe\" and TargetProcessCommandLine contains \"/d /c C:\\\\Windows\\\\system32\\\\silcollector.cmd\") or (TargetProcessName endswith \"\\\\cmd.exe\" and (TargetProcessCommandLine endswith \"cmd.exe /c btool server list replication_port --no-log\" or TargetProcessCommandLine endswith \"cmd.exe /c btool server list general --no-log\")) or (TargetProcessName endswith \"\\\\cmd.exe\" and TargetProcessCommandLine contains \":\\\\Windows\\\\system32\\\\reg.exe query hklm\\\\software\\\\microsoft\\\\windows\\\\softwareinventorylogging /v collectionstate /reg:64\") or (TargetProcessName endswith \":\\\\Windows\\\\System32\\\\cmd.exe\" and TargetProcessCommandLine endswith \":\\\\Windows\\\\system32\\\\cmd.exe /c PAUSE\")))) and (not(((ActingProcessName endswith \":\\\\ManageEngine\\\\ADManager Plus\\\\pgsql\\\\bin\\\\postgres.exe\" and TargetProcessName endswith \"\\\\cmd.exe\") or (ActingProcessName contains \":\\\\Windows\\\\SysWOW64\\\\config\\\\systemprofile\\\\Citrix\\\\UpdaterBinaries\\\\\" and ActingProcessName endswith \"\\\\CitrixReceiverUpdater.exe\" and TargetProcessName endswith \"\\\\cmd.exe\") or (TargetProcessCommandLine contains \":\\\\WINDOWS\\\\system32\\\\cmd.exe /c \\\"\" and TargetProcessCurrentDirectory contains \":\\\\WINDOWS\\\\Temp\\\\asgard2-agent\\\\\") or (ActingProcessName contains \":\\\\Windows\\\\Temp\" and ActingProcessName endswith \"\\\\invcol.exe\" and ActingProcessCommandLine contains \":\\\\ProgramData\\\\Dell\\\\UpdateService\\\\\" and TargetProcessName endswith \"\\\\cmd.exe\") or (ActingProcessName contains \":\\\\IBM\\\\SpectrumProtect\\\\webserver\\\\scripts\\\\\" and TargetProcessCommandLine contains \":\\\\IBM\\\\SpectrumProtect\\\\webserver\\\\scripts\\\\\") or TargetProcessCommandLine contains \":\\\\Windows\\\\system32\\\\cmd.exe\\\" /C copy \\\"C:\\\\ProgramData\\\\Avira\\\\SystemSpeedup\\\\Update\\\\avira_speedup_setup_update.exe\\\"\" or (ActingProcessName =~ \"\" and TargetProcessCommandLine contains \":\\\\IBM\\\\SpectrumProtect\\\\webserver\\\\scripts\\\\\") or (isnull(ActingProcessName) and TargetProcessCommandLine contains \":\\\\IBM\\\\SpectrumProtect\\\\webserver\\\\scripts\\\\\")))))|extend RuleId=\"178e615d-e666-498b-9630-9ed363038101\";\nlet q2=_Im_ProcessCreate\n| where (ActingProcessName =~ \"C:\\\\Windows\\\\explorer.exe\" and TargetProcessName =~ \"C:\\\\Windows\\\\System32\\\\cmd.exe\" and (TargetProcessCommandLine contains \"powershell\" and TargetProcessCommandLine contains \".lnk\"))|extend RuleId=\"30e92f50-bb5a-4884-98b5-d20aa80f3d7a\";\nlet q3=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\") and (TargetProcessCommandLine contains \"\\\\{\" and TargetProcessCommandLine contains \"}\\\\\")) and (not(((TargetProcessName contains \"\\\\{\" and TargetProcessName contains \"}\\\\\") or isnull(TargetProcessName) or TargetProcessName =~ \"C:\\\\Windows\\\\System32\\\\drvinst.exe\"))))|extend RuleId=\"90b63c33-2b97-4631-a011-ceb0f47b77c3\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessName contains \"\\\\wwwroot\\\\\" or TargetProcessName contains \"\\\\wmpub\\\\\" or TargetProcessName contains \"\\\\htdocs\\\\\") and (not(((TargetProcessName contains \"bin\\\\\" or TargetProcessName contains \"\\\\Tools\\\\\" or TargetProcessName contains \"\\\\SMSComponent\\\\\") and ActingProcessName endswith \"\\\\services.exe\"))))|extend RuleId=\"35efb964-e6a5-47ad-bbcd-19661854018d\";\nlet q5=_Im_ProcessCreate\n| where (((TargetProcessFileDescription =~ \"?\" and FileVersion =~ \"?\") or (TargetProcessFileDescription =~ \"?\" and TargetProcessFileProduct =~ \"?\") or (TargetProcessFileDescription =~ \"?\" and TargetProcessFileCompany =~ \"?\")) and TargetProcessName contains \"\\\\Downloads\\\\\")|extend RuleId=\"9637e8a5-7131-4f7f-bdc7-2b05d8670c43\";\nlet q6=_Im_ProcessCreate\n| where ((((TargetProcessName endswith \"\\\\cacls.exe\" or TargetProcessName endswith \"\\\\icacls.exe\" or TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") and (TargetProcessCommandLine contains \"/grant\" or TargetProcessCommandLine contains \"/setowner\" or TargetProcessCommandLine contains \"/inheritance:r\")) or (TargetProcessName endswith \"\\\\attrib.exe\" and TargetProcessCommandLine contains \"-r\") or TargetProcessName endswith \"\\\\takeown.exe\") and (not((TargetProcessCommandLine endswith \"ICACLS C:\\\\ProgramData\\\\dynatrace\\\\gateway\\\\config\\\\connectivity.history /reset\" or (TargetProcessCommandLine contains \"ICACLS C:\\\\ProgramData\\\\dynatrace\\\\gateway\\\\config\\\\config.properties /grant :r \" and TargetProcessCommandLine contains \"S-1-5-19:F\") or (TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Programs\\\\Microsoft VS Code\" or ActingProcessName endswith \"\\\\Microsoft VS Code\\\\Code.exe\")))))|extend RuleId=\"37ae075c-271b-459b-8d7b-55ad5f993dd8\";\nlet q7=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"::$index_allocation\"|extend RuleId=\"0900463c-b33b-49a8-be1d-552a3b553dae\";\nlet q8=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"echo\" or TargetProcessCommandLine contains \"copy\" or TargetProcessCommandLine contains \"type\" or TargetProcessCommandLine contains \"file createnew\" or TargetProcessCommandLine contains \"cacls\") and TargetProcessCommandLine contains \"C:\\\\Windows\\\\Fonts\\\\\" and (TargetProcessCommandLine contains \".sh\" or TargetProcessCommandLine contains \".exe\" or TargetProcessCommandLine contains \".dll\" or TargetProcessCommandLine contains \".bin\" or TargetProcessCommandLine contains \".bat\" or TargetProcessCommandLine contains \".cmd\" or TargetProcessCommandLine contains \".js\" or TargetProcessCommandLine contains \".msh\" or TargetProcessCommandLine contains \".reg\" or TargetProcessCommandLine contains \".scr\" or TargetProcessCommandLine contains \".ps\" or TargetProcessCommandLine contains \".vb\" or TargetProcessCommandLine contains \".jar\" or TargetProcessCommandLine contains \".pl\" or TargetProcessCommandLine contains \".inf\" or TargetProcessCommandLine contains \".cpl\" or TargetProcessCommandLine contains \".hta\" or TargetProcessCommandLine contains \".msi\" or TargetProcessCommandLine contains \".vbs\"))|extend RuleId=\"ae9b0bd7-8888-4606-b444-0ed7410cb728\";\nlet q9=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\calc.exe\" or TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessName endswith \"\\\\cmstp.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\installutil.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\wscript.exe\") or (TargetProcessFilename =~ \"CALC.EXE\" or TargetProcessFilename =~ \"CertUtil.exe\" or TargetProcessFilename =~ \"CMSTP.EXE\" or TargetProcessFilename =~ \"cscript.exe\" or TargetProcessFilename =~ \"installutil.exe\" or TargetProcessFilename =~ \"MSHTA.EXE\" or TargetProcessFilename =~ \"REGSVR32.EXE\" or TargetProcessFilename =~ \"RUNDLL32.EXE\" or TargetProcessFilename =~ \"wscript.exe\")) and (not((TargetProcessCurrentDirectory contains \"C:\\\\\" or TargetProcessCurrentDirectory =~ \"\" or isnull(TargetProcessCurrentDirectory)))))|extend RuleId=\"d4ca7c59-e9e4-42d8-bf57-91a776efcb87\";\nlet q10=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"for \" or TargetProcessCommandLine contains \"foreach \") and (TargetProcessCommandLine contains \"nslookup\" or TargetProcessCommandLine contains \"ping\"))|extend RuleId=\"f8ad2e2c-40b6-4117-84d7-20b89896ab23\";\nlet q11=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"~1\\\\\" or TargetProcessCommandLine contains \"~2\\\\\") and (not(((ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\Dism.exe\" or ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\cleanmgr.exe\" or ActingProcessName =~ \"C:\\\\Program Files\\\\GPSoftware\\\\Directory Opus\\\\dopus.exe\") or (ActingProcessName endswith \"\\\\WebEx\\\\WebexHost.exe\" or ActingProcessName endswith \"\\\\thor\\\\thor64.exe\" or ActingProcessName endswith \"\\\\veam.backup.shell.exe\" or ActingProcessName endswith \"\\\\winget.exe\" or ActingProcessName endswith \"\\\\Everything\\\\Everything.exe\") or ActingProcessName contains \"\\\\AppData\\\\Local\\\\Temp\\\\WinGet\\\\\" or (TargetProcessCommandLine contains \"\\\\appdata\\\\local\\\\webex\\\\webex64\\\\meetings\\\\wbxreport.exe\" or TargetProcessCommandLine contains \"C:\\\\Program Files\\\\Git\\\\post-install.bat\" or TargetProcessCommandLine contains \"C:\\\\Program Files\\\\Git\\\\cmd\\\\scalar.exe\")))))|extend RuleId=\"349d891d-fef0-4fe4-bc53-eee623a15969\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "PrivilegeEscalation", "Discovery", "Persistence", "Execution"],
                "techniques": ["T1222", "T1564", "T1059", "T1505", "T1018", "T1027", "T1211"],
                "alertRuleTemplateName": "5163A000-4c76-45a9-804d-dc3f355f1015",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}