{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000108')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000108')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation low 08",
                "description": "Sigma Windows Process Creation low 08",
                "severity": "low",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\presentationhost.exe\" or TargetProcessFilename =~ \"PresentationHost.exe\") and (TargetProcessCommandLine contains \"http://\" or TargetProcessCommandLine contains \"https://\" or TargetProcessCommandLine contains \"ftp://\"))|extend RuleId=\"b124ddf4-778d-418e-907f-6dd3fc0d31cd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_presentationhost_download.yml\"|extend RuleTitle=\"Download Arbitrary Files Via PresentationHost.exe\"|extend RuleDescription=\"Detects usage of \\\"PresentationHost\\\" which is a utility that runs \\\".xbap\\\" (Browser Applications) files to download arbitrary files\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\protocolhandler.exe\" or TargetProcessFilename =~ \"ProtocolHandler.exe\") and ((TargetProcessCommandLine contains \"\\\"ms-word\" and TargetProcessCommandLine contains \".docx\\\"\") or TargetProcessCommandLine contains \" http\"))|extend RuleId=\"104cdb48-a7a8-4ca7-a453-32942c6e5dcb\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_protocolhandler_download.yml\"|extend RuleTitle=\"File Download Using ProtocolHandler.exe\"|extend RuleDescription=\"Detects usage of \\\"ProtocolHandler\\\" to download files. Downloaded files will be located in the cache folder (for example - %LOCALAPPDATA%\\\\Microsoft\\\\Windows\\\\INetCache\\\\IE)\";\nlet q2=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"\\\\pubprn.vbs\" and TargetProcessCommandLine contains \"script:\")|extend RuleId=\"1fb76ab8-fa60-4b01-bddd-71e89bf555da\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_pubprn.yml\"|extend RuleTitle=\"Pubprn.vbs Proxy Execution\"|extend RuleDescription=\"Detects the use of the 'Pubprn.vbs' Microsoft signed script to execute commands.\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\rasautou.exe\" or TargetProcessFilename =~ \"rasdlui.exe\") and (TargetProcessCommandLine contains \" -d \" and TargetProcessCommandLine contains \" -p \"))|extend RuleId=\"cd3d1298-eb3b-476c-ac67-12847de55813\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_rasautou_dll_execution.yml\"|extend RuleTitle=\"DLL Execution via Rasautou.exe\"|extend RuleDescription=\"Detects using Rasautou.exe for loading arbitrary .DLL specified in -d option and executes the export specified in -p.\";\nlet q4=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"\\\\register_app.vbs\" and TargetProcessCommandLine contains \"-register\")|extend RuleId=\"1c8774a0-44d4-4db0-91f8-e792359c70bd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_register_app.yml\"|extend RuleTitle=\"REGISTER_APP.VBS Proxy Execution\"|extend RuleDescription=\"Detects the use of a Microsoft signed script 'REGISTER_APP.VBS' to register a VSS/VDS Provider as a COM+ application.\";\nlet q5=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\remote.exe\" or TargetProcessFilename =~ \"remote.exe\")|extend RuleId=\"4eddc365-79b4-43ff-a9d7-99422dc34b93\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_remote.yml\"|extend RuleTitle=\"Use of Remote.exe\"|extend RuleDescription=\"Remote.exe is part of WinDbg in the Windows SDK and can be used for AWL bypass and running remote files.\";\nlet q6=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\replace.exe\" and (TargetProcessCommandLine contains \"/a\" or TargetProcessCommandLine contains \"-a\"))|extend RuleId=\"9292293b-8496-4715-9db6-37028dcda4b3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_replace.yml\"|extend RuleTitle=\"Replace.exe Usage\"|extend RuleDescription=\"Detects the use of Replace.exe which can be used to replace file with another file\";\nlet q7=_Im_ProcessCreate\n| where ActingProcessName endswith \"\\\\runexehelper.exe\"|extend RuleId=\"cd71385d-fd9b-4691-9b98-2b1f7e508714\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_runexehelper.yml\"|extend RuleTitle=\"Lolbin Runexehelper Use As Proxy\"|extend RuleDescription=\"Detect usage of the \\\"runexehelper.exe\\\" binary as a proxy to launch other programs\";\nlet q8=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\Runscripthelper.exe\" and TargetProcessCommandLine contains \"surfacecheck\")|extend RuleId=\"eca49c87-8a75-4f13-9c73-a5a29e845f03\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_runscripthelper.yml\"|extend RuleTitle=\"Suspicious Runscripthelper.exe\"|extend RuleDescription=\"Detects execution of powershell scripts via Runscripthelper.exe\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\ScriptRunner.exe\" or TargetProcessFilename =~ \"ScriptRunner.exe\") and TargetProcessCommandLine contains \" -appvscript \")|extend RuleId=\"64760eef-87f7-4ed3-93fd-655668ea9420\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_scriptrunner.yml\"|extend RuleTitle=\"Use of Scriptrunner.exe\"|extend RuleDescription=\"The \\\"ScriptRunner.exe\\\" binary can be abused to proxy execution through it and bypass possible whitelisting\";\nlet q10=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\setres.exe\" and TargetProcessName endswith \"\\\\choice\")|extend RuleId=\"835e75bf-4bfd-47a4-b8a6-b766cac8bcb7\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_setres.yml\"|extend RuleTitle=\"Use of Setres.exe\"|extend RuleDescription=\"Detects the use of Setres.exe to set the screen resolution and then potentially launch a file named \\\"choice\\\" (with any executable extension such as \\\".cmd\\\" or \\\".exe\\\") from the current execution path\";\nlet q11=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\sftp.exe\" and (TargetProcessCommandLine contains \" -D ..\" or TargetProcessCommandLine contains \" -D C:\\\\\"))|extend RuleId=\"a85ffc3a-e8fd-4040-93bf-78aff284d801\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_sftp.yml\"|extend RuleTitle=\"Use Of The SFTP.EXE Binary As A LOLBIN\"|extend RuleDescription=\"Detects the usage of the \\\"sftp.exe\\\" binary as a LOLBIN by abusing the \\\"-D\\\" flag\";\nlet q12=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\link.exe\" and TargetProcessCommandLine contains \"LINK /\") and (not(((ActingProcessName startswith \"C:\\\\Program Files\\\\Microsoft Visual Studio\\\\\" or ActingProcessName startswith \"C:\\\\Program Files (x86)\\\\Microsoft Visual Studio\\\\\") and ActingProcessName contains \"\\\\VC\\\\Tools\\\\MSVC\\\\\"))))|extend RuleId=\"6e968eb1-5f05-4dac-94e9-fd0c5cb49fd6\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_sideload_link_binary.yml\"|extend RuleTitle=\"Sideloading Link.EXE\"|extend RuleDescription=\"Detects the execution utitilies often found in Visual Studio tools that hardcode the call to the binary \\\"link.exe\\\". They can be abused to sideload any binary with the same name\";\nlet q13=_Im_ProcessCreate\n| where ActingProcessName endswith \"\\\\sigverif.exe\"|extend RuleId=\"7d4aaec2-08ed-4430-8b96-28420e030e04\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_sigverif.yml\"|extend RuleTitle=\"Suspicious Sigverif Execution\"|extend RuleDescription=\"Detects the execution of sigverif binary as a parent process which could indicate it being used as a LOLBIN to proxy execution\";\nlet q14=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\squirrel.exe\" or TargetProcessName endswith \"\\\\update.exe\") and (((TargetProcessCommandLine contains \" --download \" or TargetProcessCommandLine contains \" --update \" or TargetProcessCommandLine contains \" --updateRollback=\") and TargetProcessCommandLine contains \"http\") or (TargetProcessCommandLine contains \"--processStart\" or TargetProcessCommandLine contains \"--processStartAndWait\" or TargetProcessCommandLine contains \"--createShortcut\")) and (not(((TargetProcessCommandLine contains \"C:\\\\Users\\\\\" and TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Discord\\\\Update.exe\" and TargetProcessCommandLine contains \" --processStart\" and TargetProcessCommandLine contains \"Discord.exe\") or ((TargetProcessCommandLine contains \"C:\\\\Users\\\\\" and TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\GitHubDesktop\\\\Update.exe\" and TargetProcessCommandLine contains \"GitHubDesktop.exe\") and (TargetProcessCommandLine contains \"--createShortcut\" or TargetProcessCommandLine contains \"--processStartAndWait\")) or ((TargetProcessCommandLine contains \"C:\\\\Users\\\\\" and TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\Update.exe\" and TargetProcessCommandLine contains \"Teams.exe\") and (TargetProcessCommandLine contains \"--processStart\" or TargetProcessCommandLine contains \"--createShortcut\")) or ((TargetProcessCommandLine contains \"C:\\\\Users\\\\\" and TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\yammerdesktop\\\\Update.exe\" and TargetProcessCommandLine contains \"Yammer.exe\") and (TargetProcessCommandLine contains \"--processStart\" or TargetProcessCommandLine contains \"--createShortcut\"))))))|extend RuleId=\"45239e6a-b035-4aaf-b339-8ad379fcb67e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_squirrel.yml\"|extend RuleTitle=\"Use of Squirrel.exe\"|extend RuleDescription=\"Detects the usage of the \\\"Squirrel.exe\\\" binary as a LOLBIN. This binary is part of multiple software installations (Slack, Teams, Discord, etc.)\";\nlet q15=_Im_ProcessCreate\n| where (ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\OpenSSH\\\\sshd.exe\" or (TargetProcessName endswith \"\\\\ssh.exe\" and (TargetProcessCommandLine contains \"ProxyCommand=\" or (TargetProcessCommandLine contains \"PermitLocalCommand\" and TargetProcessCommandLine contains \"LocalCommand\"))))|extend RuleId=\"7d6d30b8-5b91-4b90-a891-46cccaf29598\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_ssh.yml\"|extend RuleTitle=\"Lolbin Ssh.exe Use As Proxy\"|extend RuleDescription=\"Detect usage of the \\\"ssh.exe\\\" binary as a proxy to launch other programs\";\nlet q16=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"-i\" or TargetProcessCommandLine contains \"/install\" or TargetProcessCommandLine contains \"-a\" or TargetProcessCommandLine contains \"/add-driver\" or TargetProcessCommandLine contains \".inf\") and TargetProcessName endswith \"\\\\pnputil.exe\")|extend RuleId=\"a2ea3ae7-d3d0-40a0-a55c-25a45c87cac1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_susp_driver_installed_by_pnputil.yml\"|extend RuleTitle=\"Suspicious Driver Install by pnputil.exe\"|extend RuleDescription=\"Detects when a possible suspicious driver is being installed via pnputil.exe lolbin\";\nlet q17=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\DXCap.exe\" or TargetProcessFilename =~ \"DXCap.exe\") and TargetProcessCommandLine contains \" -c \")|extend RuleId=\"60f16a96-db70-42eb-8f76-16763e333590\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_susp_dxcap.yml\"|extend RuleTitle=\"Application Whitelisting Bypass via Dxcap.exe\"|extend RuleDescription=\"Detects execution of of Dxcap.exe\";\nlet q18=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\sqldumper.exe\" and (TargetProcessCommandLine contains \"0x0110\" or TargetProcessCommandLine contains \"0x01100:40\"))|extend RuleId=\"23ceaf5c-b6f1-4a32-8559-f2ff734be516\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_susp_sqldumper_activity.yml\"|extend RuleTitle=\"Dumping Process via Sqldumper.exe\"|extend RuleDescription=\"Detects process dump via legitimate sqldumper.exe binary\";\nlet q19=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\SyncAppvPublishingServer.exe\" or TargetProcessFilename =~ \"syncappvpublishingserver.exe\") and TargetProcessCommandLine contains \"\\\"n; \")|extend RuleId=\"fbd7c32d-db2a-4418-b92c-566eb8911133\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_syncappvpublishingserver_execute_psh.yml\"|extend RuleTitle=\"SyncAppvPublishingServer Execute Arbitrary PowerShell Code\"|extend RuleDescription=\"Executes arbitrary PowerShell code using SyncAppvPublishingServer.exe.\";\nlet q20=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"\\\\SyncAppvPublishingServer.vbs\" and TargetProcessCommandLine contains \";\")|extend RuleId=\"36475a7d-0f6d-4dce-9b01-6aeb473bbaf1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_syncappvpublishingserver_vbs_execute_psh.yml\"|extend RuleTitle=\"SyncAppvPublishingServer VBS Execute Arbitrary PowerShell Code\"|extend RuleDescription=\"Executes arbitrary PowerShell code using SyncAppvPublishingServer.vbs\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19, q20;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "CommandAndControl", "Execution", "Persistence", "CredentialAccess", "PrivilegeEscalation"],
                "techniques": ["T1127", "T1547", "T1059", "T1105", "T1218", "T1216", "T1003", "T1202"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000108",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}