{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-4c76-45a9-804d-dc3f355f2022')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-4c76-45a9-804d-dc3f355f2022')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation high 022",
                "description": "Sigma Windows Process Creation high 022",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"reg\" and TargetProcessCommandLine contains \"add\") and ((TargetProcessCommandLine contains \"d 4\" and TargetProcessCommandLine contains \"v Start\") and (TargetProcessCommandLine contains \"\\\\AppIDSvc\" or TargetProcessCommandLine contains \"\\\\MsMpSvc\" or TargetProcessCommandLine contains \"\\\\NisSrv\" or TargetProcessCommandLine contains \"\\\\SecurityHealthService\" or TargetProcessCommandLine contains \"\\\\Sense\" or TargetProcessCommandLine contains \"\\\\UsoSvc\" or TargetProcessCommandLine contains \"\\\\WdBoot\" or TargetProcessCommandLine contains \"\\\\WdFilter\" or TargetProcessCommandLine contains \"\\\\WdNisDrv\" or TargetProcessCommandLine contains \"\\\\WdNisSvc\" or TargetProcessCommandLine contains \"\\\\WinDefend\" or TargetProcessCommandLine contains \"\\\\wscsvc\" or TargetProcessCommandLine contains \"\\\\wuauserv\")))|extend RuleId=\"5e95028c-5229-4214-afae-d653d573d0ec\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\reg.exe\" or TargetProcessFilename =~ \"reg.exe\") and (TargetProcessCommandLine contains \"save\" or TargetProcessCommandLine contains \"export\" or TargetProcessCommandLine contains \"\u02e2ave\" or TargetProcessCommandLine contains \"e\u02e3port\") and (TargetProcessCommandLine contains \"hklm\" or TargetProcessCommandLine contains \"hk\u02eam\" or TargetProcessCommandLine contains \"hkey_local_machine\" or TargetProcessCommandLine contains \"hkey_\u02eaocal_machine\" or TargetProcessCommandLine contains \"hkey_loca\u02ea_machine\" or TargetProcessCommandLine contains \"hkey_\u02eaoca\u02ea_machine\") and (TargetProcessCommandLine contains \"\\\\system\" or TargetProcessCommandLine contains \"\\\\sam\" or TargetProcessCommandLine contains \"\\\\security\" or TargetProcessCommandLine contains \"\\\\\u02e2ystem\" or TargetProcessCommandLine contains \"\\\\sy\u02e2tem\" or TargetProcessCommandLine contains \"\\\\\u02e2y\u02e2tem\" or TargetProcessCommandLine contains \"\\\\\u02e2am\" or TargetProcessCommandLine contains \"\\\\\u02e2ecurity\"))|extend RuleId=\"fd877b94-9bb5-4191-bb25-d79cbd93c167\";\nlet q2=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"\\\\System\\\\CurrentControlSet\\\\Control\\\\Lsa\\\\\" and TargetProcessCommandLine contains \"DisableRestrictedAdmin\" and TargetProcessCommandLine contains \" 1\")|extend RuleId=\"28ac00d6-22d9-4a3c-927f-bbd770104573\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\reg.exe\" or TargetProcessFilename =~ \"reg.exe\") and (TargetProcessCommandLine contains \"SYSTEM\\\\CurrentControlSet\\\\Control\\\\Lsa\" and (TargetProcessCommandLine contains \" add \" and TargetProcessCommandLine contains \" /d 0\" and TargetProcessCommandLine contains \" /v RunAsPPL \")))|extend RuleId=\"8c0eca51-0f88-4db2-9183-fdfb10c703f9\";\nlet q4=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\reg.exe\" or TargetProcessFilename =~ \"reg.exe\") and (TargetProcessCommandLine contains \" add \" and TargetProcessCommandLine contains \"\\\\CurrentControlSet\\\\Control\\\\Terminal Server\" and TargetProcessCommandLine contains \"REG_DWORD\" and TargetProcessCommandLine contains \" /f\")) and ((TargetProcessCommandLine contains \"Licensing Core\" and TargetProcessCommandLine contains \"EnableConcurrentSessions\") or (TargetProcessCommandLine contains \"WinStations\\\\RDP-Tcp\" or TargetProcessCommandLine contains \"MaxInstanceCount\" or TargetProcessCommandLine contains \"fEnableWinStation\" or TargetProcessCommandLine contains \"TSUserEnabled\" or TargetProcessCommandLine contains \"TSEnabled\" or TargetProcessCommandLine contains \"TSAppCompat\" or TargetProcessCommandLine contains \"IdleWinStationPoolCount\" or TargetProcessCommandLine contains \"TSAdvertise\" or TargetProcessCommandLine contains \"AllowTSConnections\" or TargetProcessCommandLine contains \"fSingleSessionPerUser\" or TargetProcessCommandLine contains \"fDenyTSConnections\")))|extend RuleId=\"0d5675be-bc88-4172-86d3-1e96a4476536\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\reg.exe\" or TargetProcessFilename =~ \"reg.exe\") and (TargetProcessCommandLine contains \"\\\\AppDataLow\\\\Software\\\\Microsoft\\\\\" or TargetProcessCommandLine contains \"\\\\Policies\\\\Microsoft\\\\Windows\\\\OOBE\" or TargetProcessCommandLine contains \"\\\\Policies\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Winlogon\" or TargetProcessCommandLine contains \"\\\\SOFTWARE\\\\Microsoft\\\\Windows NT\\\\Currentversion\\\\Winlogon\" or TargetProcessCommandLine contains \"\\\\CurrentControlSet\\\\Control\\\\SecurityProviders\\\\WDigest\" or TargetProcessCommandLine contains \"\\\\Microsoft\\\\Windows Defender\\\\\"))|extend RuleId=\"b7e2a8d4-74bb-4b78-adc9-3f92af2d4829\";\nlet q6=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"reg\" and TargetProcessCommandLine contains \" add \" and TargetProcessCommandLine contains \"\\\\Services\\\\VSS\\\\Diag\" and TargetProcessCommandLine contains \"/d Disabled\")|extend RuleId=\"dee4af55-1f22-4e1d-a9d2-4bdc7ecb472a\";\nlet q7=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\reg.exe\" or TargetProcessFilename =~ \"reg.exe\") and (TargetProcessCommandLine contains \"SOFTWARE\\\\Microsoft\\\\Windows Defender\\\\\" or TargetProcessCommandLine contains \"SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows Defender Security Center\" or TargetProcessCommandLine contains \"SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows Defender\\\\\")) and (((TargetProcessCommandLine contains \" add \" and TargetProcessCommandLine contains \"d 0\") and (TargetProcessCommandLine contains \"DisallowExploitProtectionOverride\" or TargetProcessCommandLine contains \"EnableControlledFolderAccess\" or TargetProcessCommandLine contains \"MpEnablePus\" or TargetProcessCommandLine contains \"PUAProtection\" or TargetProcessCommandLine contains \"SpynetReporting\" or TargetProcessCommandLine contains \"SubmitSamplesConsent\" or TargetProcessCommandLine contains \"TamperProtection\")) or ((TargetProcessCommandLine contains \" add \" and TargetProcessCommandLine contains \"d 1\") and (TargetProcessCommandLine contains \"DisableAntiSpyware\" or TargetProcessCommandLine contains \"DisableAntiSpywareRealtimeProtection\" or TargetProcessCommandLine contains \"DisableAntiVirus\" or TargetProcessCommandLine contains \"DisableArchiveScanning\" or TargetProcessCommandLine contains \"DisableBehaviorMonitoring\" or TargetProcessCommandLine contains \"DisableBlockAtFirstSeen\" or TargetProcessCommandLine contains \"DisableConfig\" or TargetProcessCommandLine contains \"DisableEnhancedNotifications\" or TargetProcessCommandLine contains \"DisableIntrusionPreventionSystem\" or TargetProcessCommandLine contains \"DisableIOAVProtection\" or TargetProcessCommandLine contains \"DisableOnAccessProtection\" or TargetProcessCommandLine contains \"DisablePrivacyMode\" or TargetProcessCommandLine contains \"DisableRealtimeMonitoring\" or TargetProcessCommandLine contains \"DisableRoutinelyTakingAction\" or TargetProcessCommandLine contains \"DisableScanOnRealtimeEnable\" or TargetProcessCommandLine contains \"DisableScriptScanning\" or TargetProcessCommandLine contains \"Notification_Suppress\" or TargetProcessCommandLine contains \"SignatureDisableUpdateOnStartupWithoutEngine\"))))|extend RuleId=\"452bce90-6fb0-43cc-97a5-affc283139b3\";\nlet q8=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"--install\" and TargetProcessCommandLine contains \"--start-with-win\" and TargetProcessCommandLine contains \"--silent\")|extend RuleId=\"114e7f1c-f137-48c8-8f54-3088c24ce4b9\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\AnyDesk.exe\" or TargetProcessFileDescription =~ \"AnyDesk\" or TargetProcessFileProduct =~ \"AnyDesk\" or TargetProcessFileCompany =~ \"AnyDesk Software GmbH\") and (not((TargetProcessName contains \"\\\\AppData\\\\\" or TargetProcessName contains \"Program Files (x86)\\\\AnyDesk\" or TargetProcessName contains \"Program Files\\\\AnyDesk\"))))|extend RuleId=\"065b00ca-5d5c-4557-ac95-64a6d0b64d86\";\nlet q10=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"e=Access&\" and TargetProcessCommandLine contains \"y=Guest&\" and TargetProcessCommandLine contains \"&p=\" and TargetProcessCommandLine contains \"&c=\" and TargetProcessCommandLine contains \"&k=\")|extend RuleId=\"75bfe6e6-cd8e-429e-91d3-03921e1d7962\";\nlet q11=_Im_ProcessCreate\n| where (ActingProcessName endswith \"ScreenConnect.ClientService.exe\" and (TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\"))|extend RuleId=\"7b582f1a-b318-4c6a-bf4e-66fe49bf55a5\";\nlet q12=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \"domainlist\" or TargetProcessCommandLine contains \"trustdmp\" or TargetProcessCommandLine contains \"dcmodes\" or TargetProcessCommandLine contains \"adinfo\" or TargetProcessCommandLine contains \" dclist \" or TargetProcessCommandLine contains \"computer_pwdnotreqd\" or TargetProcessCommandLine contains \"objectcategory=\" or TargetProcessCommandLine contains \"-subnets -f\" or TargetProcessCommandLine contains \"name=\\\"Domain Admins\\\"\" or TargetProcessCommandLine contains \"-sc u:\" or TargetProcessCommandLine contains \"domainncs\" or TargetProcessCommandLine contains \"dompol\" or TargetProcessCommandLine contains \" oudmp \" or TargetProcessCommandLine contains \"subnetdmp\" or TargetProcessCommandLine contains \"gpodmp\" or TargetProcessCommandLine contains \"fspdmp\" or TargetProcessCommandLine contains \"users_noexpire\" or TargetProcessCommandLine contains \"computers_active\" or TargetProcessCommandLine contains \"computers_pwdnotreqd\") or ((TargetProcessIMPHASH =~ \"bca5675746d13a1f246e2da3c2217492\" or TargetProcessIMPHASH =~ \"53e117a96057eaf19c41380d0e87f1c2\") or (Hashes contains \"IMPHASH=BCA5675746D13A1F246E2DA3C2217492\" or Hashes contains \"IMPHASH=53E117A96057EAF19C41380D0E87F1C2\")) or TargetProcessFilename =~ \"AdFind.exe\") and (not(TargetProcessName endswith \"\\\\AdFind.exe\")))|extend RuleId=\"df55196f-f105-44d3-a675-e9dfb6cc2f2b\";\nlet q13=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \" /AutoIt3ExecuteScript\" or TargetProcessCommandLine contains \" /ErrorStdOut\") or ((TargetProcessIMPHASH =~ \"fdc554b3a8683918d731685855683ddf\" or TargetProcessIMPHASH =~ \"cd30a61b60b3d60cecdb034c8c83c290\" or TargetProcessIMPHASH =~ \"f8a00c72f2d667d2edbb234d0c0ae000\") or (Hashes contains \"IMPHASH=FDC554B3A8683918D731685855683DDF\" or Hashes contains \"IMPHASH=CD30A61B60B3D60CECDB034C8C83C290\" or Hashes contains \"IMPHASH=F8A00C72F2D667D2EDBB234D0C0AE000\")) or (TargetProcessFilename =~ \"AutoIt3.exe\" or TargetProcessFilename =~ \"AutoIt2.exe\" or TargetProcessFilename =~ \"AutoIt.exe\")) and (not((TargetProcessName endswith \"\\\\AutoIt.exe\" or TargetProcessName endswith \"\\\\AutoIt2.exe\" or TargetProcessName endswith \"\\\\AutoIt3_x64.exe\" or TargetProcessName endswith \"\\\\AutoIt3.exe\"))))|extend RuleId=\"f4264e47-f522-4c38-a420-04525d5b880f\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Discovery", "CredentialAccess", "LateralMovement", "DefenseEvasion", "Persistence", "InitialAccess", "CommandAndControl"],
                "techniques": ["T1482", "T1087", "T1018", "T1562", "T1003", "T1133", "T1069", "T1021", "T1219", "T1027", "T1112"],
                "alertRuleTemplateName": "5163A000-4c76-45a9-804d-dc3f355f2022",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}