{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000220')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000220')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 20",
                "description": "Sigma Windows Process Creation medium 20",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"Add-Exfiltration\" or TargetProcessCommandLine contains \"Add-Persistence\" or TargetProcessCommandLine contains \"Add-RegBackdoor\" or TargetProcessCommandLine contains \"Add-RemoteRegBackdoor\" or TargetProcessCommandLine contains \"Add-ScrnSaveBackdoor\" or TargetProcessCommandLine contains \"Check-VM\" or TargetProcessCommandLine contains \"ConvertTo-Rc4ByteStream\" or TargetProcessCommandLine contains \"Decrypt-Hash\" or TargetProcessCommandLine contains \"Disable-ADIDNSNode\" or TargetProcessCommandLine contains \"Disable-MachineAccount\" or TargetProcessCommandLine contains \"Do-Exfiltration\" or TargetProcessCommandLine contains \"Enable-ADIDNSNode\" or TargetProcessCommandLine contains \"Enable-MachineAccount\" or TargetProcessCommandLine contains \"Enabled-DuplicateToken\" or TargetProcessCommandLine contains \"Exploit-Jboss\" or TargetProcessCommandLine contains \"Export-ADR\" or TargetProcessCommandLine contains \"Export-ADRCSV\" or TargetProcessCommandLine contains \"Export-ADRExcel\" or TargetProcessCommandLine contains \"Export-ADRHTML\" or TargetProcessCommandLine contains \"Export-ADRJSON\" or TargetProcessCommandLine contains \"Export-ADRXML\" or TargetProcessCommandLine contains \"Find-Fruit\" or TargetProcessCommandLine contains \"Find-GPOLocation\" or TargetProcessCommandLine contains \"Find-TrustedDocuments\" or TargetProcessCommandLine contains \"Get-ADIDNS\" or TargetProcessCommandLine contains \"Get-ApplicationHost\" or TargetProcessCommandLine contains \"Get-ChromeDump\" or TargetProcessCommandLine contains \"Get-ClipboardContents\" or TargetProcessCommandLine contains \"Get-FoxDump\" or TargetProcessCommandLine contains \"Get-GPPPassword\" or TargetProcessCommandLine contains \"Get-IndexedItem\" or TargetProcessCommandLine contains \"Get-KerberosAESKey\" or TargetProcessCommandLine contains \"Get-Keystrokes\" or TargetProcessCommandLine contains \"Get-LSASecret\" or TargetProcessCommandLine contains \"Get-MachineAccountAttribute\" or TargetProcessCommandLine contains \"Get-MachineAccountCreator\" or TargetProcessCommandLine contains \"Get-PassHashes\" or TargetProcessCommandLine contains \"Get-RegAlwaysInstallElevated\" or TargetProcessCommandLine contains \"Get-RegAutoLogon\" or TargetProcessCommandLine contains \"Get-RemoteBootKey\" or TargetProcessCommandLine contains \"Get-RemoteCachedCredential\" or TargetProcessCommandLine contains \"Get-RemoteLocalAccountHash\" or TargetProcessCommandLine contains \"Get-RemoteLSAKey\" or TargetProcessCommandLine contains \"Get-RemoteMachineAccountHash\" or TargetProcessCommandLine contains \"Get-RemoteNLKMKey\" or TargetProcessCommandLine contains \"Get-RickAstley\" or TargetProcessCommandLine contains \"Get-Screenshot\" or TargetProcessCommandLine contains \"Get-SecurityPackages\" or TargetProcessCommandLine contains \"Get-ServiceFilePermission\" or TargetProcessCommandLine contains \"Get-ServicePermission\" or TargetProcessCommandLine contains \"Get-ServiceUnquoted\" or TargetProcessCommandLine contains \"Get-SiteListPassword\" or TargetProcessCommandLine contains \"Get-System\" or TargetProcessCommandLine contains \"Get-TimedScreenshot\" or TargetProcessCommandLine contains \"Get-UnattendedInstallFile\" or TargetProcessCommandLine contains \"Get-Unconstrained\" or TargetProcessCommandLine contains \"Get-USBKeystrokes\" or TargetProcessCommandLine contains \"Get-VaultCredential\" or TargetProcessCommandLine contains \"Get-VulnAutoRun\" or TargetProcessCommandLine contains \"Get-VulnSchTask\" or TargetProcessCommandLine contains \"Grant-ADIDNSPermission\" or TargetProcessCommandLine contains \"Gupt-Backdoor\" or TargetProcessCommandLine contains \"HTTP-Login\" or TargetProcessCommandLine contains \"Install-ServiceBinary\" or TargetProcessCommandLine contains \"Install-SSP\" or TargetProcessCommandLine contains \"Invoke-ACLScanner\" or TargetProcessCommandLine contains \"Invoke-ADRecon\" or TargetProcessCommandLine contains \"Invoke-ADSBackdoor\" or TargetProcessCommandLine contains \"Invoke-AgentSmith\" or TargetProcessCommandLine contains \"Invoke-AllChecks\" or TargetProcessCommandLine contains \"Invoke-ARPScan\" or TargetProcessCommandLine contains \"Invoke-AzureHound\" or TargetProcessCommandLine contains \"Invoke-BackdoorLNK\" or TargetProcessCommandLine contains \"Invoke-BadPotato\" or TargetProcessCommandLine contains \"Invoke-BetterSafetyKatz\" or TargetProcessCommandLine contains \"Invoke-BypassUAC\" or TargetProcessCommandLine contains \"Invoke-Carbuncle\" or TargetProcessCommandLine contains \"Invoke-Certify\" or TargetProcessCommandLine contains \"Invoke-ConPtyShell\" or TargetProcessCommandLine contains \"Invoke-CredentialInjection\" or TargetProcessCommandLine contains \"Invoke-DAFT\" or TargetProcessCommandLine contains \"Invoke-DCSync\" or TargetProcessCommandLine contains \"Invoke-DinvokeKatz\" or TargetProcessCommandLine contains \"Invoke-DllInjection\" or TargetProcessCommandLine contains \"Invoke-DNSUpdate\" or TargetProcessCommandLine contains \"Invoke-DomainPasswordSpray\" or TargetProcessCommandLine contains \"Invoke-DowngradeAccount\" or TargetProcessCommandLine contains \"Invoke-EgressCheck\" or TargetProcessCommandLine contains \"Invoke-Eyewitness\" or TargetProcessCommandLine contains \"Invoke-FakeLogonScreen\" or TargetProcessCommandLine contains \"Invoke-Farmer\" or TargetProcessCommandLine contains \"Invoke-Get-RBCD-Threaded\" or TargetProcessCommandLine contains \"Invoke-Gopher\" or TargetProcessCommandLine contains \"Invoke-Grouper\" or TargetProcessCommandLine contains \"Invoke-HandleKatz\" or TargetProcessCommandLine contains \"Invoke-ImpersonatedProcess\" or TargetProcessCommandLine contains \"Invoke-ImpersonateSystem\" or TargetProcessCommandLine contains \"Invoke-InteractiveSystemPowerShell\" or TargetProcessCommandLine contains \"Invoke-Internalmonologue\" or TargetProcessCommandLine contains \"Invoke-Inveigh\" or TargetProcessCommandLine contains \"Invoke-InveighRelay\" or TargetProcessCommandLine contains \"Invoke-KrbRelay\" or TargetProcessCommandLine contains \"Invoke-LdapSignCheck\" or TargetProcessCommandLine contains \"Invoke-Lockless\" or TargetProcessCommandLine contains \"Invoke-MalSCCM\" or TargetProcessCommandLine contains \"Invoke-Mimikatz\" or TargetProcessCommandLine contains \"Invoke-Mimikittenz\" or TargetProcessCommandLine contains \"Invoke-MITM6\" or TargetProcessCommandLine contains \"Invoke-NanoDump\" or TargetProcessCommandLine contains \"Invoke-NetRipper\" or TargetProcessCommandLine contains \"Invoke-Nightmare\" or TargetProcessCommandLine contains \"Invoke-NinjaCopy\" or TargetProcessCommandLine contains \"Invoke-OfficeScrape\" or TargetProcessCommandLine contains \"Invoke-OxidResolver\" or TargetProcessCommandLine contains \"Invoke-P0wnedshell\" or TargetProcessCommandLine contains \"Invoke-Paranoia\" or TargetProcessCommandLine contains \"Invoke-PortScan\" or TargetProcessCommandLine contains \"Invoke-PoshRatHttp\" or TargetProcessCommandLine contains \"Invoke-PostExfil\" or TargetProcessCommandLine contains \"Invoke-PowerDump\" or TargetProcessCommandLine contains \"Invoke-PowerShellTCP\" or TargetProcessCommandLine contains \"Invoke-PowerShellWMI\" or TargetProcessCommandLine contains \"Invoke-PPLDump\" or TargetProcessCommandLine contains \"Invoke-PsExec\" or TargetProcessCommandLine contains \"Invoke-PSInject\" or TargetProcessCommandLine contains \"Invoke-PsUaCme\" or TargetProcessCommandLine contains \"Invoke-ReflectivePEInjection\" or TargetProcessCommandLine contains \"Invoke-ReverseDNSLookup\" or TargetProcessCommandLine contains \"Invoke-Rubeus\" or TargetProcessCommandLine contains \"Invoke-RunAs\" or TargetProcessCommandLine contains \"Invoke-SafetyKatz\" or TargetProcessCommandLine contains \"Invoke-SauronEye\" or TargetProcessCommandLine contains \"Invoke-SCShell\" or TargetProcessCommandLine contains \"Invoke-Seatbelt\" or TargetProcessCommandLine contains \"Invoke-ServiceAbuse\" or TargetProcessCommandLine contains \"Invoke-ShadowSpray\" or TargetProcessCommandLine contains \"Invoke-Sharp\" or TargetProcessCommandLine contains \"Invoke-Shellcode\" or TargetProcessCommandLine contains \"Invoke-SMBScanner\" or TargetProcessCommandLine contains \"Invoke-Snaffler\" or TargetProcessCommandLine contains \"Invoke-Spoolsample\" or TargetProcessCommandLine contains \"Invoke-SpraySinglePassword\" or TargetProcessCommandLine contains \"Invoke-SSHCommand\" or TargetProcessCommandLine contains \"Invoke-StandIn\" or TargetProcessCommandLine contains \"Invoke-StickyNotesExtract\" or TargetProcessCommandLine contains \"Invoke-SystemCommand\" or TargetProcessCommandLine contains \"Invoke-Tasksbackdoor\" or TargetProcessCommandLine contains \"Invoke-Tater\" or TargetProcessCommandLine contains \"Invoke-Thunderfox\" or TargetProcessCommandLine contains \"Invoke-ThunderStruck\" or TargetProcessCommandLine contains \"Invoke-TokenManipulation\" or TargetProcessCommandLine contains \"Invoke-Tokenvator\" or TargetProcessCommandLine contains \"Invoke-TotalExec\" or TargetProcessCommandLine contains \"Invoke-UrbanBishop\" or TargetProcessCommandLine contains \"Invoke-UserHunter\" or TargetProcessCommandLine contains \"Invoke-VoiceTroll\" or TargetProcessCommandLine contains \"Invoke-Whisker\" or TargetProcessCommandLine contains \"Invoke-WinEnum\" or TargetProcessCommandLine contains \"Invoke-winPEAS\" or TargetProcessCommandLine contains \"Invoke-WireTap\" or TargetProcessCommandLine contains \"Invoke-WmiCommand\" or TargetProcessCommandLine contains \"Invoke-WMIExec\" or TargetProcessCommandLine contains \"Invoke-WScriptBypassUAC\" or TargetProcessCommandLine contains \"Invoke-Zerologon\" or TargetProcessCommandLine contains \"MailRaider\" or TargetProcessCommandLine contains \"New-ADIDNSNode\" or TargetProcessCommandLine contains \"New-DNSRecordArray\" or TargetProcessCommandLine contains \"New-HoneyHash\" or TargetProcessCommandLine contains \"New-InMemoryModule\" or TargetProcessCommandLine contains \"New-MachineAccount\" or TargetProcessCommandLine contains \"New-SOASerialNumberArray\" or TargetProcessCommandLine contains \"Out-Minidump\" or TargetProcessCommandLine contains \"Port-Scan\" or TargetProcessCommandLine contains \"PowerBreach\" or TargetProcessCommandLine contains \"powercat \" or TargetProcessCommandLine contains \"PowerUp\" or TargetProcessCommandLine contains \"PowerView\" or TargetProcessCommandLine contains \"Remove-ADIDNSNode\" or TargetProcessCommandLine contains \"Remove-MachineAccount\" or TargetProcessCommandLine contains \"Remove-Update\" or TargetProcessCommandLine contains \"Rename-ADIDNSNode\" or TargetProcessCommandLine contains \"Revoke-ADIDNSPermission\" or TargetProcessCommandLine contains \"Set-ADIDNSNode\" or TargetProcessCommandLine contains \"Set-MacAttribute\" or TargetProcessCommandLine contains \"Set-MachineAccountAttribute\" or TargetProcessCommandLine contains \"Set-Wallpaper\" or TargetProcessCommandLine contains \"Show-TargetScreen\" or TargetProcessCommandLine contains \"Start-CaptureServer\" or TargetProcessCommandLine contains \"Start-WebcamRecorder\" or TargetProcessCommandLine contains \"VolumeShadowCopyTools\")|extend RuleId=\"02030f2f-6199-49ec-b258-ea71b07e03dc\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_malicious_cmdlets.yml\"|extend RuleTitle=\"Malicious PowerShell Commandlets - ProcessCreation\"|extend RuleDescription=\"Detects Commandlet names from well-known PowerShell exploitation frameworks\";\nlet q1=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"(WCHAR)0x\"|extend RuleId=\"e312efd0-35a1-407f-8439-b8d434b438a6\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_obfuscation_via_utf8.yml\"|extend RuleTitle=\"Potential PowerShell Obfuscation Via WCHAR\"|extend RuleDescription=\"Detects suspicious encoded character syntax often used for defense evasion\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") and (TargetProcessCommandLine contains \"-f C:\\\\Users\\\\Public\" or TargetProcessCommandLine contains \"-f \\\"C:\\\\Users\\\\Public\" or TargetProcessCommandLine contains \"-f %Public%\" or TargetProcessCommandLine contains \"-fi C:\\\\Users\\\\Public\" or TargetProcessCommandLine contains \"-fi \\\"C:\\\\Users\\\\Public\" or TargetProcessCommandLine contains \"-fi %Public%\" or TargetProcessCommandLine contains \"-fil C:\\\\Users\\\\Public\" or TargetProcessCommandLine contains \"-fil \\\"C:\\\\Users\\\\Public\" or TargetProcessCommandLine contains \"-fil %Public%\" or TargetProcessCommandLine contains \"-file C:\\\\Users\\\\Public\" or TargetProcessCommandLine contains \"-file \\\"C:\\\\Users\\\\Public\" or TargetProcessCommandLine contains \"-file %Public%\"))|extend RuleId=\"fb9d3ff7-7348-46ab-af8c-b55f5fbf39b4\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_public_folder.yml\"|extend RuleTitle=\"Execution of Powershell Script in Public Folder\"|extend RuleDescription=\"This rule detects execution of PowerShell scripts located in the \"C:\\Users\\Public\" folder\";\nlet q3=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"Invoke-ATHRemoteFXvGPUDisablementCommand\" or TargetProcessCommandLine contains \"Invoke-ATHRemoteFXvGPUDisableme\")|extend RuleId=\"a6fc3c46-23b8-4996-9ea2-573f4c4d88c5\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_remotefxvgpudisablement_abuse.yml\"|extend RuleTitle=\"RemoteFXvGPUDisablement Abuse Via AtomicTestHarnesses\"|extend RuleDescription=\"Detects calls to the AtomicTestHarnesses \"Invoke-ATHRemoteFXvGPUDisablementCommand\" which is designed to abuse the \"RemoteFXvGPUDisablement.exe\" binary to run custom PowerShell code via module load-order hijacking.\";\nunion q0, q1, q2, q3;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "Execution", "Discovery"],
                "techniques": ["T1482", "T1218", "T1069", "T1027", "T1087", "T1059"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000220",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}