{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000225')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000225')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 25",
                "description": "Sigma Windows Process Creation medium 25",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (((ActingProcessCommandLine contains \".bat\" or ActingProcessCommandLine contains \".chm\" or ActingProcessCommandLine contains \".cmd\" or ActingProcessCommandLine contains \".hta\" or ActingProcessCommandLine contains \".htm\" or ActingProcessCommandLine contains \".html\" or ActingProcessCommandLine contains \".js\" or ActingProcessCommandLine contains \".lnk\" or ActingProcessCommandLine contains \".ps1\" or ActingProcessCommandLine contains \".vbe\" or ActingProcessCommandLine contains \".vbs\" or ActingProcessCommandLine contains \".wsf\") or (ActingProcessCommandLine contains \":\\\\Perflogs\\\\\" or ActingProcessCommandLine contains \":\\\\Temp\\\\\" or ActingProcessCommandLine contains \":\\\\Users\\\\Public\\\\\" or ActingProcessCommandLine contains \":\\\\Windows\\\\Temp\\\\\" or ActingProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\" or ActingProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\\" or ActingProcessCommandLine contains \"\\\\Temporary Internet\") or ((ActingProcessCommandLine contains \":\\\\Users\\\\\" and ActingProcessCommandLine contains \"\\\\Favorites\\\\\") or (ActingProcessCommandLine contains \":\\\\Users\\\\\" and ActingProcessCommandLine contains \"\\\\Favourites\\\\\") or (ActingProcessCommandLine contains \":\\\\Users\\\\\" and ActingProcessCommandLine contains \"\\\\Contacts\\\\\"))) and (ActingProcessCommandLine contains \".bat\" or ActingProcessCommandLine contains \".chm\" or ActingProcessCommandLine contains \".cmd\" or ActingProcessCommandLine contains \".hta\" or ActingProcessCommandLine contains \".htm\" or ActingProcessCommandLine contains \".html\" or ActingProcessCommandLine contains \".js\" or ActingProcessCommandLine contains \".lnk\" or ActingProcessCommandLine contains \".ps1\" or ActingProcessCommandLine contains \".vbe\" or ActingProcessCommandLine contains \".vbs\" or ActingProcessCommandLine contains \".wsf\") and (TargetProcessName endswith \"\\\\PingCastle.exe\" or TargetProcessFilename =~ \"PingCastle.exe\" or TargetProcessFileProduct =~ \"Ping Castle\" or (TargetProcessCommandLine contains \"--scanner aclcheck\" or TargetProcessCommandLine contains \"--scanner antivirus\" or TargetProcessCommandLine contains \"--scanner computerversion\" or TargetProcessCommandLine contains \"--scanner foreignusers\" or TargetProcessCommandLine contains \"--scanner laps_bitlocker\" or TargetProcessCommandLine contains \"--scanner localadmin\" or TargetProcessCommandLine contains \"--scanner nullsession\" or TargetProcessCommandLine contains \"--scanner nullsession-trust\" or TargetProcessCommandLine contains \"--scanner oxidbindings\" or TargetProcessCommandLine contains \"--scanner remote\" or TargetProcessCommandLine contains \"--scanner share\" or TargetProcessCommandLine contains \"--scanner smb\" or TargetProcessCommandLine contains \"--scanner smb3querynetwork\" or TargetProcessCommandLine contains \"--scanner spooler\" or TargetProcessCommandLine contains \"--scanner startup\" or TargetProcessCommandLine contains \"--scanner zerologon\") or TargetProcessCommandLine contains \"--no-enum-limit\" or (TargetProcessCommandLine contains \"--healthcheck\" and TargetProcessCommandLine contains \"--level Full\") or (TargetProcessCommandLine contains \"--healthcheck\" and TargetProcessCommandLine contains \"--server \")))|extend RuleId=\"b37998de-a70b-4f33-b219-ec36bf433dc0\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_pingcastle_script_parent.yml\"|extend RuleTitle=\"PUA - PingCastle Execution From Potentially Suspicious Parent\"|extend RuleDescription=\"Detects the execution of PingCastle, a tool designed to quickly assess the Active Directory security level via a script located in a potentially suspicious or uncommon location.\\n\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"--config \" and TargetProcessCommandLine contains \"--no-check-certificate \" and TargetProcessCommandLine contains \" copy \") or ((TargetProcessName endswith \"\\\\rclone.exe\" or TargetProcessFileDescription =~ \"Rsync for cloud storage\") and (TargetProcessCommandLine contains \"pass\" or TargetProcessCommandLine contains \"user\" or TargetProcessCommandLine contains \"copy\" or TargetProcessCommandLine contains \"sync\" or TargetProcessCommandLine contains \"config\" or TargetProcessCommandLine contains \"lsd\" or TargetProcessCommandLine contains \"remote\" or TargetProcessCommandLine contains \"ls\" or TargetProcessCommandLine contains \"mega\" or TargetProcessCommandLine contains \"pcloud\" or TargetProcessCommandLine contains \"ftp\" or TargetProcessCommandLine contains \"ignore-existing\" or TargetProcessCommandLine contains \"auto-confirm\" or TargetProcessCommandLine contains \"transfers\" or TargetProcessCommandLine contains \"multi-thread-streams\" or TargetProcessCommandLine contains \"no-check-certificate \")))|extend RuleId=\"e37db05d-d1f9-49c8-b464-cee1a4b11638\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_rclone_execution.yml\"|extend RuleTitle=\"PUA - Rclone Execution\"|extend RuleDescription=\"Detects execution of RClone utility for exfiltration as used by various ransomwares strains like REvil, Conti, FiveHands, etc\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \" /account=system \" or TargetProcessCommandLine contains \" /account=ti \") and TargetProcessCommandLine contains \"/exec=\")|extend RuleId=\"93199800-b52a-4dec-b762-75212c196542\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_runxcmd.yml\"|extend RuleTitle=\"PUA - RunXCmd Execution\"|extend RuleDescription=\"Detects the use of the RunXCmd tool to execute commands with System or TrustedInstaller accounts\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\Seatbelt.exe\" or TargetProcessFilename =~ \"Seatbelt.exe\" or TargetProcessFileDescription =~ \"Seatbelt\" or (TargetProcessCommandLine contains \" DpapiMasterKeys\" or TargetProcessCommandLine contains \" InterestingProcesses\" or TargetProcessCommandLine contains \" InterestingFiles\" or TargetProcessCommandLine contains \" CertificateThumbprints\" or TargetProcessCommandLine contains \" ChromiumBookmarks\" or TargetProcessCommandLine contains \" ChromiumHistory\" or TargetProcessCommandLine contains \" ChromiumPresence\" or TargetProcessCommandLine contains \" CloudCredentials\" or TargetProcessCommandLine contains \" CredEnum\" or TargetProcessCommandLine contains \" CredGuard\" or TargetProcessCommandLine contains \" FirefoxHistory\" or TargetProcessCommandLine contains \" ProcessCreationEvents\")) or ((TargetProcessCommandLine contains \" -group=misc\" or TargetProcessCommandLine contains \" -group=remote\" or TargetProcessCommandLine contains \" -group=chromium\" or TargetProcessCommandLine contains \" -group=slack\" or TargetProcessCommandLine contains \" -group=system\" or TargetProcessCommandLine contains \" -group=user\" or TargetProcessCommandLine contains \" -group=all\") and TargetProcessCommandLine contains \" -outputfile=\"))|extend RuleId=\"38646daa-e78f-4ace-9de0-55547b2d30da\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_seatbelt.yml\"|extend RuleTitle=\"PUA - Seatbelt Execution\"|extend RuleDescription=\"Detects the execution of the PUA/Recon tool Seatbelt via PE information of command line parameters\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\wsudo.exe\" or TargetProcessFilename =~ \"wsudo.exe\" or TargetProcessFileDescription =~ \"Windows sudo utility\" or ActingProcessName endswith \"\\\\wsudo-bridge.exe\") or (TargetProcessCommandLine contains \"-u System\" or TargetProcessCommandLine contains \"-uSystem\" or TargetProcessCommandLine contains \"-u TrustedInstaller\" or TargetProcessCommandLine contains \"-uTrustedInstaller\" or TargetProcessCommandLine contains \" --ti \"))|extend RuleId=\"bdeeabc9-ff2a-4a51-be59-bb253aac7891\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_wsudo_susp_execution.yml\"|extend RuleTitle=\"PUA - Wsudo Suspicious Execution\"|extend RuleDescription=\"Detects usage of wsudo (Windows Sudo Utility). Which is a tool that let the user execute programs with different permissions (System, Trusted Installer, Administrator...etc)\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"python.exe\" or TargetProcessName endswith \"python3.exe\" or TargetProcessName endswith \"python2.exe\") and ((TargetProcessCommandLine contains \"import pty\" and TargetProcessCommandLine contains \".spawn(\") or TargetProcessCommandLine contains \"from pty import spawn\"))|extend RuleId=\"480e7e51-e797-47e3-8d72-ebfce65b6d8d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_python_pty_spawn.yml\"|extend RuleTitle=\"Python Spawning Pretty TTY on Windows\"|extend RuleDescription=\"Detects python spawning a pretty tty\";\nlet q6=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \" -hp\" and (TargetProcessCommandLine contains \" -m\" or TargetProcessCommandLine contains \" a \"))|extend RuleId=\"faa48cae-6b25-4f00-a094-08947fef582f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rar_compression_with_password.yml\"|extend RuleTitle=\"Rar Usage with Password and Compression Level\"|extend RuleDescription=\"Detects the use of rar.exe, on the command line, to create an archive with password protection or with a specific compression level. This is pretty indicative of malicious actions.\";\nlet q7=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\rar.exe\" or TargetProcessFileDescription =~ \"Command line RAR\") or (TargetProcessCommandLine contains \".exe a \" or TargetProcessCommandLine contains \" a -m\")) and ((TargetProcessCommandLine contains \" -hp\" and TargetProcessCommandLine contains \" -r \") and (TargetProcessCommandLine contains \"* :\\\\\\*.*\" or TargetProcessCommandLine contains \"* :\\\\\\\\\\*.*\" or TargetProcessCommandLine contains \"* :\\\\$Recycle.bin\\\\*\" or TargetProcessCommandLine contains \"* :\\\\PerfLogs\\\\*\" or TargetProcessCommandLine contains \"* :\\\\Temp*\" or TargetProcessCommandLine contains \"* :\\\\Users\\\\Public\\\\*\" or TargetProcessCommandLine contains \"* :\\\\Windows\\\\*\" or TargetProcessCommandLine contains \" %public%\")))|extend RuleId=\"afe52666-401e-4a02-b4ff-5d128990b8cb\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rar_susp_greedy_compression.yml\"|extend RuleTitle=\"Suspicious Greedy Compression Using Rar.EXE\"|extend RuleDescription=\"Detects RAR usage that creates an archive from a suspicious folder, either a system folder or one of the folders often used by attackers for staging purposes\";\nlet q8=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \"fullmemdmp\" or TargetProcessCommandLine contains \"/memdmp\" or TargetProcessCommandLine contains \"-memdmp\") and (TargetProcessCommandLine contains \" -o \" or TargetProcessCommandLine contains \" /o \") and (TargetProcessCommandLine contains \" -p \" or TargetProcessCommandLine contains \" /p \")) or ((TargetProcessName endswith \"\\\\rdrleakdiag.exe\" or TargetProcessFilename =~ \"RdrLeakDiag.exe\") and (TargetProcessCommandLine contains \"fullmemdmp\" or TargetProcessCommandLine contains \"/memdmp\" or TargetProcessCommandLine contains \"-memdmp\")))|extend RuleId=\"edadb1e5-5919-4e4c-8462-a9e643b02c4b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rdrleakdiag_process_dumping.yml\"|extend RuleTitle=\"Process Memory Dump via RdrLeakDiag.EXE\"|extend RuleDescription=\"Detects the use of the Microsoft Windows Resource Leak Diagnostic tool \\\"rdrleakdiag.exe\\\" to dump process memory\";\nlet q9=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \" -E \"\n| where TargetProcessCommandLine contains \" /E \"\n| where ((TargetProcessName endswith \"\\\\regedit.exe\" or TargetProcessFilename =~ \"REGEDIT.EXE\") and () and (TargetProcessCommandLine contains \"hklm\" or TargetProcessCommandLine contains \"hkey_local_machine\") and (TargetProcessCommandLine endswith \"\\\\system\" or TargetProcessCommandLine endswith \"\\\\sam\" or TargetProcessCommandLine endswith \"\\\\security\"))|extend RuleId=\"82880171-b475-4201-b811-e9c826cd5eaa\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_regedit_export_critical_keys.yml\"|extend RuleTitle=\"Exports Critical Registry Keys To a File\"|extend RuleDescription=\"Detects the export of a crital Registry key to a file.\";\nlet q10=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \" -e \"\n| where TargetProcessCommandLine contains \" /e \"\n| where TargetProcessCommandLine contains \" -a \"\n| where TargetProcessCommandLine contains \" /a \"\n| where TargetProcessCommandLine contains \" -c \"\n| where TargetProcessCommandLine contains \" /c \"\n| where (((TargetProcessName endswith \"\\\\regedit.exe\" or TargetProcessFilename =~ \"REGEDIT.EXE\") and ((TargetProcessCommandLine contains \" /i \" or TargetProcessCommandLine contains \".reg\") and TargetProcessCommandLine matches regex \":[^ \\\\\\\\]\")) and (not(( or  or ))))|extend RuleId=\"0b80ade5-6997-4b1d-99a1-71701778ea61\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_regedit_import_keys_ads.yml\"|extend RuleTitle=\"Imports Registry Key From an ADS\"|extend RuleDescription=\"Detects the import of a alternate datastream to the registry with regedit.exe.\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "CredentialAccess", "Collection", "Exfiltration", "Reconnaissance", "PrivilegeEscalation", "Discovery", "Execution"],
                "techniques": ["T1003", "T1567", "T1012", "T1112", "T1560", "T1595", "T1569", "T1526", "T1083", "T1087", "T1059"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000225",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}