{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000204')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000204')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 04",
                "description": "Sigma Windows Process Creation medium 04",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\fltMC.exe\" or TargetProcessFilename =~ \"fltMC.exe\") and (TargetProcessCommandLine contains \"unload\" and TargetProcessCommandLine contains \"sysmon\"))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000203\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_fltmc_unload_driver_sysmon.yml\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\fsutil.exe\" or TargetProcessFilename =~ \"fsutil.exe\") and (TargetProcessCommandLine contains \"deletejournal\" or TargetProcessCommandLine contains \"createjournal\" or TargetProcessCommandLine contains \"setZeroData\"))|extend RuleId=\"add64136-62e5-48ea-807e-88638d02df1e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_fsutil_usage.yml\";\nlet q2=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\GoogleUpdate.exe\" and (not(((TargetProcessName contains \"\\\\Google\" or (TargetProcessName endswith \"\\\\setup.exe\" or TargetProcessName endswith \"chrome_updater.exe\" or TargetProcessName endswith \"chrome_installer.exe\")) or isnull(TargetProcessName)))))|extend RuleId=\"84b1ecf9-6eff-4004-bafb-bae5c0e251b2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_googleupdate_susp_child_process.yml\";\nlet q3=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\gpg.exe\" or TargetProcessName endswith \"\\\\gpg2.exe\") or TargetProcessFilename =~ \"gpg.exe\" or TargetProcessFileDescription =~ \"GnuPG\u2019s OpenPGP tool\") and (not((TargetProcessName contains \":\\\\Program Files (x86)\\\\GnuPG\\\\bin\\\\\" or TargetProcessName contains \":\\\\Program Files (x86)\\\\GNU\\\\GnuPG\\\\bin\\\\\" or TargetProcessName contains \":\\\\Program Files (x86)\\\\Gpg4win\\\\bin\\\\\"))))|extend RuleId=\"77df53a5-1d78-4f32-bc5a-0e7465bd8f41\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_gpg4win_portable_execution.yml\";\nlet q4=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\gpg.exe\" or TargetProcessName endswith \"\\\\gpg2.exe\") or TargetProcessFileProduct =~ \"GNU Privacy Guard (GnuPG)\" or TargetProcessFileDescription =~ \"GnuPG\u2019s OpenPGP tool\") and TargetProcessCommandLine contains \"-passphrase\" and (TargetProcessCommandLine contains \":\\\\PerfLogs\\\\\" or TargetProcessCommandLine contains \":\\\\Temp\\\\\" or TargetProcessCommandLine contains \":\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\\"))|extend RuleId=\"e1e0b7d7-e10b-4ee4-ac49-a4bda05d320d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_gpg4win_susp_location.yml\";\nlet q5=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\GUP.exe\" or TargetProcessFilename =~ \"gup.exe\") and (TargetProcessCommandLine contains \" -unzipTo \" and TargetProcessCommandLine contains \"http\")) and (not(ActingProcessName endswith \"\\\\notepad++.exe\")))|extend RuleId=\"44143844-0631-49ab-97a0-96387d6b2d7c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_gup_download.yml\";\nlet q6=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\GUP.exe\" and (not(((TargetProcessName endswith \"\\\\Program Files\\\\Notepad++\\\\updater\\\\GUP.exe\" or TargetProcessName endswith \"\\\\Program Files (x86)\\\\Notepad++\\\\updater\\\\GUP.exe\") or (TargetProcessName contains \"\\\\Users\\\\\" and (TargetProcessName endswith \"\\\\AppData\\\\Local\\\\Notepad++\\\\updater\\\\GUP.exe\" or TargetProcessName endswith \"\\\\AppData\\\\Roaming\\\\Notepad++\\\\updater\\\\GUP.exe\"))))))|extend RuleId=\"0a4f6091-223b-41f6-8743-f322ec84930b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_gup_suspicious_execution.yml\";\nlet q7=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"HH.exe\" or TargetProcessName endswith \"\\\\hh.exe\") and TargetProcessCommandLine contains \"http\")|extend RuleId=\"f57c58b3-ee69-4ef5-9041-455bf39aaa89\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hh_chm_remote_download_or_execution.yml\";\nlet q8=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\hh.exe\" and (TargetProcessName endswith \"\\\\CertReq.exe\" or TargetProcessName endswith \"\\\\CertUtil.exe\" or TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\installutil.exe\" or TargetProcessName endswith \"\\\\MSbuild.exe\" or TargetProcessName endswith \"\\\\MSHTA.EXE\" or TargetProcessName endswith \"\\\\msiexec.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessName endswith \"\\\\wmic.exe\" or TargetProcessName endswith \"\\\\wscript.exe\"))|extend RuleId=\"52cad028-0ff0-4854-8f67-d25dfcbc78b4\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hh_html_help_susp_child_process.yml\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"HH.exe\" or TargetProcessName endswith \"\\\\hh.exe\") and (TargetProcessCommandLine contains \".application\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\Content.Outlook\\\\\" or TargetProcessCommandLine contains \"\\\\Downloads\\\\\" or TargetProcessCommandLine contains \"\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\Temp\\\\\"))|extend RuleId=\"e8a95b5e-c891-46e2-b33a-93937d3abc31\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hh_susp_execution.yml\";\nlet q10=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \" --adcs \" and TargetProcessCommandLine contains \" --port \")|extend RuleId=\"cd8c163e-a19b-402e-bdd5-419ff5859f12\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_adcspwn.yml\";\nlet q11=_Im_ProcessCreate\n| where ((TargetProcessFileProduct contains \"SharpHound\" or TargetProcessFileDescription contains \"SharpHound\" or (TargetProcessFileCompany contains \"SpecterOps\" or TargetProcessFileCompany contains \"evil corp\") or (TargetProcessName contains \"\\\\Bloodhound.exe\" or TargetProcessName contains \"\\\\SharpHound.exe\")) or (TargetProcessCommandLine contains \" -CollectionMethod All \" or TargetProcessCommandLine contains \" --CollectionMethods Session \" or TargetProcessCommandLine contains \" --Loop --Loopduration \" or TargetProcessCommandLine contains \" --PortScanTimeout \" or TargetProcessCommandLine contains \".exe -c All -d \" or TargetProcessCommandLine contains \"Invoke-Bloodhound\" or TargetProcessCommandLine contains \"Get-BloodHoundData\") or (TargetProcessCommandLine contains \" -JsonFolder \" and TargetProcessCommandLine contains \" -ZipFileName \") or (TargetProcessCommandLine contains \" DCOnly \" and TargetProcessCommandLine contains \" --NoSaveCache \"))|extend RuleId=\"f376c8a7-a2d0-4ddc-aa0c-16c17236d962\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_bloodhound_sharphound.yml\";\nlet q12=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\Certify.exe\" or TargetProcessFilename =~ \"Certify.exe\" or TargetProcessFileDescription contains \"Certify\") or ((TargetProcessCommandLine contains \".exe cas \" or TargetProcessCommandLine contains \".exe find \" or TargetProcessCommandLine contains \".exe pkiobjects \" or TargetProcessCommandLine contains \".exe request \" or TargetProcessCommandLine contains \".exe download \") and (TargetProcessCommandLine contains \" /vulnerable\" or TargetProcessCommandLine contains \" /template:\" or TargetProcessCommandLine contains \" /altname:\" or TargetProcessCommandLine contains \" /domain:\" or TargetProcessCommandLine contains \" /path:\" or TargetProcessCommandLine contains \" /ca:\")))|extend RuleId=\"762f2482-ff21-4970-8939-0aa317a886bb\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_certify.yml\";\nlet q13=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\Certipy.exe\" or TargetProcessFilename =~ \"Certipy.exe\" or TargetProcessFileDescription contains \"Certipy\") or ((TargetProcessCommandLine contains \" auth \" or TargetProcessCommandLine contains \" find \" or TargetProcessCommandLine contains \" forge \" or TargetProcessCommandLine contains \" relay \" or TargetProcessCommandLine contains \" req \" or TargetProcessCommandLine contains \" shadow \") and (TargetProcessCommandLine contains \" -bloodhound\" or TargetProcessCommandLine contains \" -ca-pfx \" or TargetProcessCommandLine contains \" -dc-ip \" or TargetProcessCommandLine contains \" -kirbi\" or TargetProcessCommandLine contains \" -old-bloodhound\" or TargetProcessCommandLine contains \" -pfx \" or TargetProcessCommandLine contains \" -target\" or TargetProcessCommandLine contains \" -username \" or TargetProcessCommandLine contains \" -vulnerable\" or TargetProcessCommandLine contains \"auth -pfx\" or TargetProcessCommandLine contains \"shadow auto\" or TargetProcessCommandLine contains \"shadow list\")))|extend RuleId=\"6938366d-8954-4ddc-baff-c830b3ba8fcd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_certipy.yml\";\nlet q14=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"Cmd.Exe\" or TargetProcessName endswith \"\\\\cmd.exe\") and ((TargetProcessCommandLine startswith \"cmd \" or TargetProcessCommandLine startswith \"cmd.exe\" or TargetProcessCommandLine startswith \"c:\\\\windows\\\\system32\\\\cmd.exe\") and (TargetProcessCommandLine contains \"psinject\" or TargetProcessCommandLine contains \"spawnas\" or TargetProcessCommandLine contains \"make_token\" or TargetProcessCommandLine contains \"remote-exec\" or TargetProcessCommandLine contains \"rev2self\" or TargetProcessCommandLine contains \"dcsync\" or TargetProcessCommandLine contains \"logonpasswords\" or TargetProcessCommandLine contains \"execute-assembly\" or TargetProcessCommandLine contains \"getsystem\")))|extend RuleId=\"647c7b9e-d784-4fda-b9a0-45c565a7b729\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_cobaltstrike_bloopers_cmd.yml\";\nlet q15=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"Cmd.Exe\" or TargetProcessName endswith \"\\\\cmd.exe\") and (TargetProcessCommandLine contains \"Invoke-UserHunter\" or TargetProcessCommandLine contains \"Invoke-ShareFinder\" or TargetProcessCommandLine contains \"Invoke-Kerberoast\" or TargetProcessCommandLine contains \"Invoke-SMBAutoBrute\" or TargetProcessCommandLine contains \"Invoke-Nightmare\" or TargetProcessCommandLine contains \"zerologon\" or TargetProcessCommandLine contains \"av_query\"))|extend RuleId=\"4f154fb6-27d1-4813-a759-78b93e0b9c48\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_cobaltstrike_bloopers_modules.yml\";\nlet q16=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessFilename =~ \"RUNDLL32.EXE\" or (TargetProcessCommandLine contains \"rundll32.exe\" or TargetProcessCommandLine contains \"rundll32 \")) and (TargetProcessCommandLine contains \".dll\" and (TargetProcessCommandLine endswith \" StartW\" or TargetProcessCommandLine endswith \",StartW\")))|extend RuleId=\"ae9c6a7c-9521-42a6-915e-5aaa8689d529\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_cobaltstrike_load_by_rundll32.yml\";\nlet q17=_Im_ProcessCreate\n| where ((TargetProcessCommandLine endswith \"cmd.exe /C whoami\" and ActingProcessName startswith \"C:\\\\Temp\\\\\") or ((ActingProcessName endswith \"\\\\runonce.exe\" or ActingProcessName endswith \"\\\\dllhost.exe\") and (TargetProcessCommandLine contains \"cmd.exe /c echo\" and TargetProcessCommandLine contains \"> \\\\\\\\.\\\\pipe\")) or ((ActingProcessCommandLine contains \"cmd.exe /C echo\" and ActingProcessCommandLine contains \" > \\\\\\\\.\\\\pipe\") and TargetProcessCommandLine endswith \"conhost.exe 0xffffffff -ForceV1\") or (ActingProcessCommandLine endswith \"/C whoami\" and TargetProcessCommandLine endswith \"conhost.exe 0xffffffff -ForceV1\"))|extend RuleId=\"f35c5d71-b489-4e22-a115-f003df287317\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_cobaltstrike_process_patterns.yml\";\nlet q18=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\CoercedPotato.exe\" or TargetProcessCommandLine contains \" --exploitId \" or ((TargetProcessIMPHASH =~ \"a75d7669db6b2e107a44c4057ff7f7d6\" or TargetProcessIMPHASH =~ \"f91624350e2c678c5dcbe5e1f24e22c9\" or TargetProcessIMPHASH =~ \"14c81850a079a87e83d50ca41c709a15\") or (Hashes =~ \"IMPHASH=A75D7669DB6B2E107A44C4057FF7F7D6\" or Hashes =~ \"IMPHASH=F91624350E2C678C5DCBE5E1F24E22C9\" or Hashes =~ \"IMPHASH=14C81850A079A87E83D50CA41C709A15\")))|extend RuleId=\"e8d34729-86a4-4140-adfd-0a29c2106307\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_coercedpotato.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Collection", "DefenseEvasion", "CommandAndControl", "Impact", "InitialAccess", "Execution", "PrivilegeEscalation", "Discovery", "CredentialAccess"],
                "techniques": ["T1566", "T1562", "T1486", "T1070", "T1059", "T1482", "T1105", "T1218", "T1557", "T1574", "T1485", "T1047", "T1069", "T1055", "T1087"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000204",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}