{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000212')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000212')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation high 12",
                "description": "Sigma Windows Process Creation medium 12",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (((ActingProcessName endswith \"\\\\WINWORD.EXE\" or ActingProcessName endswith \"\\\\EXCEL.EXE\" or ActingProcessName endswith \"\\\\POWERPNT.exe\" or ActingProcessName endswith \"\\\\MSPUB.exe\" or ActingProcessName endswith \"\\\\VISIO.exe\" or ActingProcessName endswith \"\\\\MSACCESS.exe\" or ActingProcessName endswith \"\\\\EQNEDT32.exe\") and TargetProcessName startswith \"C:\\\\users\\\\\" and TargetProcessName endswith \".exe\") and (not(TargetProcessName endswith \"\\\\Teams.exe\")))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000211\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_office_spawn_exe_from_users_directory.yml\";\nlet q1=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\EQNEDT32.EXE\" or ActingProcessName endswith \"\\\\EXCEL.EXE\" or ActingProcessName endswith \"\\\\MSACCESS.EXE\" or ActingProcessName endswith \"\\\\MSPUB.exe\" or ActingProcessName endswith \"\\\\ONENOTE.EXE\" or ActingProcessName endswith \"\\\\POWERPNT.exe\" or ActingProcessName endswith \"\\\\VISIO.exe\" or ActingProcessName endswith \"\\\\WINWORD.EXE\" or ActingProcessName endswith \"\\\\wordpad.exe\" or ActingProcessName endswith \"\\\\wordview.exe\") and (((TargetProcessFilename =~ \"bitsadmin.exe\" or TargetProcessFilename =~ \"CertOC.exe\" or TargetProcessFilename =~ \"CertUtil.exe\" or TargetProcessFilename =~ \"Cmd.Exe\" or TargetProcessFilename =~ \"CMSTP.EXE\" or TargetProcessFilename =~ \"cscript.exe\" or TargetProcessFilename =~ \"curl.exe\" or TargetProcessFilename =~ \"HH.exe\" or TargetProcessFilename =~ \"IEExec.exe\" or TargetProcessFilename =~ \"InstallUtil.exe\" or TargetProcessFilename =~ \"javaw.exe\" or TargetProcessFilename =~ \"Microsoft.Workflow.Compiler.exe\" or TargetProcessFilename =~ \"msdt.exe\" or TargetProcessFilename =~ \"MSHTA.EXE\" or TargetProcessFilename =~ \"msiexec.exe\" or TargetProcessFilename =~ \"Msxsl.exe\" or TargetProcessFilename =~ \"odbcconf.exe\" or TargetProcessFilename =~ \"pcalua.exe\" or TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"RegAsm.exe\" or TargetProcessFilename =~ \"RegSvcs.exe\" or TargetProcessFilename =~ \"REGSVR32.exe\" or TargetProcessFilename =~ \"RUNDLL32.exe\" or TargetProcessFilename =~ \"schtasks.exe\" or TargetProcessFilename =~ \"ScriptRunner.exe\" or TargetProcessFilename =~ \"wmic.exe\" or TargetProcessFilename =~ \"WorkFolders.exe\" or TargetProcessFilename =~ \"wscript.exe\") or (TargetProcessName endswith \"\\\\AppVLP.exe\" or TargetProcessName endswith \"\\\\bash.exe\" or TargetProcessName endswith \"\\\\bitsadmin.exe\" or TargetProcessName endswith \"\\\\certoc.exe\" or TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\cmstp.exe\" or TargetProcessName endswith \"\\\\control.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\curl.exe\" or TargetProcessName endswith \"\\\\forfiles.exe\" or TargetProcessName endswith \"\\\\hh.exe\" or TargetProcessName endswith \"\\\\ieexec.exe\" or TargetProcessName endswith \"\\\\installutil.exe\" or TargetProcessName endswith \"\\\\javaw.exe\" or TargetProcessName endswith \"\\\\mftrace.exe\" or TargetProcessName endswith \"\\\\Microsoft.Workflow.Compiler.exe\" or TargetProcessName endswith \"\\\\msbuild.exe\" or TargetProcessName endswith \"\\\\msdt.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\msidb.exe\" or TargetProcessName endswith \"\\\\msiexec.exe\" or TargetProcessName endswith \"\\\\msxsl.exe\" or TargetProcessName endswith \"\\\\odbcconf.exe\" or TargetProcessName endswith \"\\\\pcalua.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\regasm.exe\" or TargetProcessName endswith \"\\\\regsvcs.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessName endswith \"\\\\scrcons.exe\" or TargetProcessName endswith \"\\\\scriptrunner.exe\" or TargetProcessName endswith \"\\\\sh.exe\" or TargetProcessName endswith \"\\\\svchost.exe\" or TargetProcessName endswith \"\\\\verclsid.exe\" or TargetProcessName endswith \"\\\\wmic.exe\" or TargetProcessName endswith \"\\\\workfolders.exe\" or TargetProcessName endswith \"\\\\wscript.exe\")) or (TargetProcessName contains \"\\\\AppData\\\\\" or TargetProcessName contains \"\\\\Users\\\\Public\\\\\" or TargetProcessName contains \"\\\\ProgramData\\\\\" or TargetProcessName contains \"\\\\Windows\\\\Tasks\\\\\" or TargetProcessName contains \"\\\\Windows\\\\Temp\\\\\" or TargetProcessName contains \"\\\\Windows\\\\System32\\\\Tasks\\\\\")))|extend RuleId=\"438025f9-5856-4663-83f7-52f878a70a50\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_office_susp_child_processes.yml\";\nlet q2=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\ping.exe\" and TargetProcessCommandLine contains \"0x\")|extend RuleId=\"1a0d4aba-7668-4365-9ce4-6d79ab088dfd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_ping_hex_ip.yml\";\nlet q3=_Im_ProcessCreate\n| where (TargetProcessFileDescription =~ \"Command-line SSH, Telnet, and Rlogin client\" and TargetProcessCommandLine contains \" -R \")|extend RuleId=\"48a61b29-389f-4032-b317-b30de6b95314\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_plink_port_forwarding.yml\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\plink.exe\" and TargetProcessCommandLine contains \":127.0.0.1:3389\") or ((TargetProcessName endswith \"\\\\plink.exe\" and TargetProcessCommandLine contains \":3389\") and (TargetProcessCommandLine contains \" -P 443\" or TargetProcessCommandLine contains \" -P 22\")))|extend RuleId=\"f38ce0b9-5e97-4b47-a211-7dc8d8b871da\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_plink_susp_tunneling.yml\";\nlet q5=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.Exe\" or TargetProcessFilename =~ \"pwsh.dll\")) and (TargetProcessCommandLine contains \"Add-AADInt\" or TargetProcessCommandLine contains \"ConvertTo-AADInt\" or TargetProcessCommandLine contains \"Disable-AADInt\" or TargetProcessCommandLine contains \"Enable-AADInt\" or TargetProcessCommandLine contains \"Export-AADInt\" or TargetProcessCommandLine contains \"Get-AADInt\" or TargetProcessCommandLine contains \"Grant-AADInt\" or TargetProcessCommandLine contains \"Install-AADInt\" or TargetProcessCommandLine contains \"Invoke-AADInt\" or TargetProcessCommandLine contains \"Join-AADInt\" or TargetProcessCommandLine contains \"New-AADInt\" or TargetProcessCommandLine contains \"Open-AADInt\" or TargetProcessCommandLine contains \"Read-AADInt\" or TargetProcessCommandLine contains \"Register-AADInt\" or TargetProcessCommandLine contains \"Remove-AADInt\" or TargetProcessCommandLine contains \"Restore-AADInt\" or TargetProcessCommandLine contains \"Search-AADInt\" or TargetProcessCommandLine contains \"Send-AADInt\" or TargetProcessCommandLine contains \"Set-AADInt\" or TargetProcessCommandLine contains \"Start-AADInt\" or TargetProcessCommandLine contains \"Update-AADInt\"))|extend RuleId=\"c86500e9-a645-4680-98d7-f882c70c1ea3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_aadinternals_cmdlets_execution.yml\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"System.Management.Automation.AmsiUtils\" or TargetProcessCommandLine contains \"amsiInitFailed\") or (TargetProcessCommandLine contains \"[Ref].Assembly.GetType\" and TargetProcessCommandLine contains \"SetValue($null,$true)\" and TargetProcessCommandLine contains \"NonPublic,Static\"))|extend RuleId=\"30edb182-aa75-42c0-b0a9-e998bb29067c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_amsi_init_failed_bypass.yml\";\nlet q7=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and ((TargetProcessCommandLine contains \" -e\" and (TargetProcessCommandLine contains \" JAB\" or TargetProcessCommandLine contains \" SUVYI\" or TargetProcessCommandLine contains \" SQBFAFgA\" or TargetProcessCommandLine contains \" aQBlAHgA\" or TargetProcessCommandLine contains \" aWV4I\" or TargetProcessCommandLine contains \" IAA\" or TargetProcessCommandLine contains \" IAB\" or TargetProcessCommandLine contains \" UwB\" or TargetProcessCommandLine contains \" cwB\")) or (TargetProcessCommandLine contains \".exe -ENCOD \" or TargetProcessCommandLine contains \" BA^J e-\")) and (not(TargetProcessCommandLine contains \" -ExecutionPolicy remotesigned \")))|extend RuleId=\"ca2092a1-c273-4878-9b4b-0d60115bf5ea\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_base64_encoded_cmd.yml\";\nlet q8=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"OjpGcm9tQmFzZTY0U3RyaW5n\"\n| where TargetProcessCommandLine contains \"o6RnJvbUJhc2U2NFN0cmluZ\"\n| where TargetProcessCommandLine contains \"6OkZyb21CYXNlNjRTdHJpbm\"\n| where ( or (TargetProcessCommandLine contains \"OgA6AEYAcgBvAG0AQgBhAHMAZQA2ADQAUwB0AHIAaQBuAGcA\" or TargetProcessCommandLine contains \"oAOgBGAHIAbwBtAEIAYQBzAGUANgA0AFMAdAByAGkAbgBnA\" or TargetProcessCommandLine contains \"6ADoARgByAG8AbQBCAGEAcwBlADYANABTAHQAcgBpAG4AZw\"))|extend RuleId=\"fdb62a13-9a81-4e5c-a38f-ea93a16f6d7c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_base64_frombase64string.yml\";\nlet q9=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"SUVYIChb\"\n| where TargetProcessCommandLine contains \"lFWCAoW\"\n| where TargetProcessCommandLine contains \"JRVggKF\"\n| where TargetProcessCommandLine contains \"aWV4IChb\"\n| where TargetProcessCommandLine contains \"lleCAoW\"\n| where TargetProcessCommandLine contains \"pZXggKF\"\n| where TargetProcessCommandLine contains \"aWV4IChOZX\"\n| where TargetProcessCommandLine contains \"lleCAoTmV3\"\n| where TargetProcessCommandLine contains \"pZXggKE5ld\"\n| where TargetProcessCommandLine contains \"SUVYIChOZX\"\n| where TargetProcessCommandLine contains \"lFWCAoTmV3\"\n| where TargetProcessCommandLine contains \"JRVggKE5ld\"\n| where TargetProcessCommandLine contains \"SUVYKF\"\n| where TargetProcessCommandLine contains \"lFWChb\"\n| where TargetProcessCommandLine contains \"JRVgoW\"\n| where TargetProcessCommandLine contains \"aWV4KF\"\n| where TargetProcessCommandLine contains \"lleChb\"\n| where TargetProcessCommandLine contains \"pZXgoW\"\n| where TargetProcessCommandLine contains \"aWV4KE5ld\"\n| where TargetProcessCommandLine contains \"lleChOZX\"\n| where TargetProcessCommandLine contains \"pZXgoTmV3\"\n| where TargetProcessCommandLine contains \"SUVYKE5ld\"\n| where TargetProcessCommandLine contains \"lFWChOZX\"\n| where TargetProcessCommandLine contains \"JRVgoTmV3\"\n| where TargetProcessCommandLine contains \"SUVYKCgn\"\n| where TargetProcessCommandLine contains \"lFWCgoJ\"\n| where TargetProcessCommandLine contains \"JRVgoKC\"\n| where TargetProcessCommandLine contains \"aWV4KCgn\"\n| where TargetProcessCommandLine contains \"lleCgoJ\"\n| where TargetProcessCommandLine contains \"pZXgoKC\"\n| where (( or  or  or  or  or  or  or  or  or ) or (TargetProcessCommandLine contains \"SQBFAFgAIAAoAFsA\" or TargetProcessCommandLine contains \"kARQBYACAAKABbA\" or TargetProcessCommandLine contains \"JAEUAWAAgACgAWw\" or TargetProcessCommandLine contains \"aQBlAHgAIAAoAFsA\" or TargetProcessCommandLine contains \"kAZQB4ACAAKABbA\" or TargetProcessCommandLine contains \"pAGUAeAAgACgAWw\" or TargetProcessCommandLine contains \"aQBlAHgAIAAoAE4AZQB3A\" or TargetProcessCommandLine contains \"kAZQB4ACAAKABOAGUAdw\" or TargetProcessCommandLine contains \"pAGUAeAAgACgATgBlAHcA\" or TargetProcessCommandLine contains \"SQBFAFgAIAAoAE4AZQB3A\" or TargetProcessCommandLine contains \"kARQBYACAAKABOAGUAdw\" or TargetProcessCommandLine contains \"JAEUAWAAgACgATgBlAHcA\"))|extend RuleId=\"88f680b8-070e-402c-ae11-d2914f2257f1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_base64_iex.yml\";\nlet q10=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and TargetProcessCommandLine contains \" -e\" and (TargetProcessCommandLine contains \"SQBuAHYAbwBrAGUALQ\" or TargetProcessCommandLine contains \"kAbgB2AG8AawBlAC0A\" or TargetProcessCommandLine contains \"JAG4AdgBvAGsAZQAtA\" or TargetProcessCommandLine contains \"SW52b2tlL\" or TargetProcessCommandLine contains \"ludm9rZS\" or TargetProcessCommandLine contains \"JbnZva2Ut\"))|extend RuleId=\"6385697e-9f1b-40bd-8817-f4a91f40508e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_base64_invoke.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["LateralMovement", "CredentialAccess", "CommandAndControl", "Discovery", "Impact", "Execution", "Reconnaissance", "DefenseEvasion"],
                "techniques": ["T1218", "T1572", "T1204", "T1047", "T1021", "T1562", "T1140", "T1059", "T1027"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000212",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}