{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000203')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000203')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation high 03",
                "description": "Sigma Windows Process Creation medium 03",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\curlexe\" or TargetProcessFilename =~ \"curlexe\") and (TargetProcessCommandLine contains \"githubusercontentcom\" or TargetProcessCommandLine contains \"anonfilescom\" or TargetProcessCommandLine contains \"cdndiscordappcom\" or TargetProcessCommandLine contains \"cdndiscordappcom/attachments/\" or TargetProcessCommandLine contains \"ddnsnet\" or TargetProcessCommandLine contains \"dldropboxusercontentcom\" or TargetProcessCommandLine contains \"ghostbinco\" or TargetProcessCommandLine contains \"gofileio\" or TargetProcessCommandLine contains \"hastebincom\" or TargetProcessCommandLine contains \"mediafirecom\" or TargetProcessCommandLine contains \"meganz\" or TargetProcessCommandLine contains \"pasteee\" or TargetProcessCommandLine contains \"pastebincom\" or TargetProcessCommandLine contains \"pastebinpl\" or TargetProcessCommandLine contains \"pastetextnet\" or TargetProcessCommandLine contains \"privatlabcom\" or TargetProcessCommandLine contains \"privatlabnet\" or TargetProcessCommandLine contains \"sendexploitin\" or TargetProcessCommandLine contains \"sendspacecom\" or TargetProcessCommandLine contains \"storagegoogleapiscom\" or TargetProcessCommandLine contains \"storjshareio\" or TargetProcessCommandLine contains \"tempsh\" or TargetProcessCommandLine contains \"transfersh\" or TargetProcessCommandLine contains \"ufileio\") and TargetProcessCommandLine contains \"http\" and (TargetProcessCommandLine contains \" -O\" or TargetProcessCommandLine contains \"--remote-name\" or TargetProcessCommandLine contains \"--output\") and (TargetProcessCommandLine endswith \"ps1\" or TargetProcessCommandLine endswith \"ps1'\" or TargetProcessCommandLine endswith \"ps1\\\"\" or TargetProcessCommandLine endswith \"dat\" or TargetProcessCommandLine endswith \"dat'\" or TargetProcessCommandLine endswith \"dat\\\"\" or TargetProcessCommandLine endswith \"msi\" or TargetProcessCommandLine endswith \"msi'\" or TargetProcessCommandLine endswith \"msi\\\"\" or TargetProcessCommandLine endswith \"bat\" or TargetProcessCommandLine endswith \"bat'\" or TargetProcessCommandLine endswith \"bat\\\"\" or TargetProcessCommandLine endswith \"exe\" or TargetProcessCommandLine endswith \"exe'\" or TargetProcessCommandLine endswith \"exe\\\"\" or TargetProcessCommandLine endswith \"vbs\" or TargetProcessCommandLine endswith \"vbs'\" or TargetProcessCommandLine endswith \"vbs\\\"\" or TargetProcessCommandLine endswith \"vbe\" or TargetProcessCommandLine endswith \"vbe'\" or TargetProcessCommandLine endswith \"vbe\\\"\" or TargetProcessCommandLine endswith \"hta\" or TargetProcessCommandLine endswith \"hta'\" or TargetProcessCommandLine endswith \"hta\\\"\" or TargetProcessCommandLine endswith \"dll\" or TargetProcessCommandLine endswith \"dll'\" or TargetProcessCommandLine endswith \"dll\\\"\" or TargetProcessCommandLine endswith \"psm1\" or TargetProcessCommandLine endswith \"psm1'\" or TargetProcessCommandLine endswith \"psm1\\\"\"))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000202\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_curl_download_susp_file_sharing_domains.yml\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\curlexe\" or TargetProcessFileProduct =~ \"The curl executable\") and ((TargetProcessCommandLine contains \"%AppData%\" or TargetProcessCommandLine contains \"%Public%\" or TargetProcessCommandLine contains \"%Temp%\" or TargetProcessCommandLine contains \"%tmp%\" or TargetProcessCommandLine contains \"\\\\AppData\\\\\" or TargetProcessCommandLine contains \"\\\\Desktop\\\\\" or TargetProcessCommandLine contains \"\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \"C:\\\\PerfLogs\\\\\" or TargetProcessCommandLine contains \"C:\\\\ProgramData\\\\\" or TargetProcessCommandLine contains \"C:\\\\Windows\\\\Temp\\\\\") or (TargetProcessCommandLine endswith \"dll\" or TargetProcessCommandLine endswith \"gif\" or TargetProcessCommandLine endswith \"jpeg\" or TargetProcessCommandLine endswith \"jpg\" or TargetProcessCommandLine endswith \"png\" or TargetProcessCommandLine endswith \"temp\" or TargetProcessCommandLine endswith \"tmp\" or TargetProcessCommandLine endswith \"txt\" or TargetProcessCommandLine endswith \"vbe\" or TargetProcessCommandLine endswith \"vbs\")) and (not((ActingProcessName =~ \"C:\\\\Program Files\\\\Git\\\\usr\\\\bin\\\\shexe\" and TargetProcessName =~ \"C:\\\\Program Files\\\\Git\\\\mingw64\\\\bin\\\\curlexe\" and (TargetProcessCommandLine contains \"--silent --show-error --output \" and TargetProcessCommandLine contains \"gfw-httpget-\" and TargetProcessCommandLine contains \"AppData\")))))|extend RuleId=\"e218595b-bbe7-4ee5-8a96-f32a24ad3468\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_curl_susp_download.yml\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \" /lockscreenurl:\" and (not((TargetProcessCommandLine contains \"jpg\" or TargetProcessCommandLine contains \"jpeg\" or TargetProcessCommandLine contains \"png\")))) or (TargetProcessCommandLine contains \"reg delete\" and TargetProcessCommandLine contains \"\\\\PersonalizationCSP\"))|extend RuleId=\"bb58aa4a-b80b-415a-a2c0-2f65a4c81009\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_desktopimgdownldr_susp_execution.yml\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\dllhostexe\" and (TargetProcessCommandLine =~ \"dllhostexe\" or TargetProcessCommandLine =~ \"dllhost\")) and (not(isnull(TargetProcessCommandLine))))|extend RuleId=\"e7888eb1-13b0-4616-bd99-4bc0c2b054b9\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_dllhost_no_cli_execution.yml\";\nlet q4=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\VMwareXferlogsexe\" and (not(TargetProcessName startswith \"C:\\\\Program Files\\\\VMware\\\\\")))|extend RuleId=\"ebea773c-a8f1-42ad-a856-00cb221966e8\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_dll_sideload_vmware_xfer.yml\";\nlet q5=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\dnscmdexe\" and (TargetProcessCommandLine contains \"/config\" and TargetProcessCommandLine contains \"/serverlevelplugindll\"))|extend RuleId=\"f63b56ee-3f79-4b8a-97fb-5c48007e8573\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_dnscmd_install_new_server_level_plugin_dll.yml\";\nlet q6=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\iodineexe\" or TargetProcessName contains \"\\\\dnscat2\")|extend RuleId=\"98a96a5a-64a0-4c42-92c5-489da3866cb0\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_dns_exfiltration_tools_execution.yml\";\nlet q7=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\dnsexe\" and (not(TargetProcessName endswith \"\\\\conhostexe\")))|extend RuleId=\"a4e3d776-f12e-42c2-8510-9e6ed1f43ec3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_dns_susp_child_process.yml\";\nlet q8=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"driverqueryexe\" or TargetProcessFilename =~ \"drvqryexe\") and ((ActingProcessName endswith \"\\\\cscriptexe\" or ActingProcessName endswith \"\\\\mshtaexe\" or ActingProcessName endswith \"\\\\regsvr32exe\" or ActingProcessName endswith \"\\\\rundll32exe\" or ActingProcessName endswith \"\\\\wscriptexe\") or (ActingProcessName contains \"\\\\AppData\\\\Local\\\\\" or ActingProcessName contains \"\\\\Users\\\\Public\\\\\" or ActingProcessName contains \"\\\\Windows\\\\Temp\\\\\")))|extend RuleId=\"9fc3072c-dc8f-4bf7-b231-18950000fadd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_driverquery_recon.yml\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\dtraceexe\" and TargetProcessCommandLine contains \"lkd(0)\") or (TargetProcessCommandLine contains \"syscall:::return\" and TargetProcessCommandLine contains \"lkd(\"))|extend RuleId=\"7124aebe-4cd7-4ccb-8df0-6d6b93c96795\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_dtrace_kernel_dump.yml\";\nlet q10=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\DumpMinitoolexe\" or TargetProcessName endswith \"\\\\DumpMinitoolx86exe\" or TargetProcessName endswith \"\\\\DumpMinitoolarm64exe\") or (TargetProcessFilename =~ \"DumpMinitoolexe\" or TargetProcessFilename =~ \"DumpMinitoolx86exe\" or TargetProcessFilename =~ \"DumpMinitoolarm64exe\")) and ((not((TargetProcessName contains \"\\\\Microsoft Visual Studio\\\\\" or TargetProcessName contains \"\\\\Extensions\\\\\"))) or TargetProcessCommandLine contains \"txt\" or ((TargetProcessCommandLine contains \" Full\" or TargetProcessCommandLine contains \" Mini\" or TargetProcessCommandLine contains \" WithHeap\") and (not(TargetProcessCommandLine contains \"--dumpType\")))))|extend RuleId=\"eb1c4225-1c23-4241-8dd4-051389fde4ce\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_dumpminitool_susp_execution.yml\";\nlet q11=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\esentutlexe\" or TargetProcessFilename =~ \"\\\\esentutlexe\") and (TargetProcessCommandLine contains \"vss\" or TargetProcessCommandLine contains \" /m \" or TargetProcessCommandLine contains \" /y \")) or (TargetProcessCommandLine contains \"\\\\windows\\\\ntds\\\\ntdsdit\" or TargetProcessCommandLine contains \"\\\\config\\\\sam\" or TargetProcessCommandLine contains \"\\\\config\\\\security\" or TargetProcessCommandLine contains \"\\\\config\\\\system \" or TargetProcessCommandLine contains \"\\\\repair\\\\sam\" or TargetProcessCommandLine contains \"\\\\repair\\\\system\" or TargetProcessCommandLine contains \"\\\\repair\\\\security\" or TargetProcessCommandLine contains \"\\\\config\\\\RegBack\\\\sam\" or TargetProcessCommandLine contains \"\\\\config\\\\RegBack\\\\system\" or TargetProcessCommandLine contains \"\\\\config\\\\RegBack\\\\security\"))|extend RuleId=\"e7be6119-fc37-43f0-ad4f-1f3f99be2f9f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_esentutl_sensitive_file_copy.yml\";\nlet q12=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\eventvwrexe\" and (not((TargetProcessName endswith \":\\\\Windows\\\\System32\\\\mmcexe\" or TargetProcessName endswith \":\\\\Windows\\\\System32\\\\WerFaultexe\" or TargetProcessName endswith \":\\\\Windows\\\\SysWOW64\\\\WerFaultexe\"))))|extend RuleId=\"be344333-921d-4c4d-8bb8-e584cf584780\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_eventvwr_susp_child_process.yml\";\nlet q13=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\explorerexe\" and TargetProcessCommandLine contains \"/NOUACCHECK\") and (not((ActingProcessCommandLine =~ \"C:\\\\Windows\\\\system32\\\\svchostexe -k netsvcs -p -s Schedule\" or ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\svchostexe\"))))|extend RuleId=\"534f2ef7-e8a2-4433-816d-c91bccde289b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_explorer_nouaccheck.yml\";\nlet q14=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\findstrexe\" or TargetProcessFilename =~ \"FINDSTREXE\") and (TargetProcessCommandLine contains \"cpassword\" and TargetProcessCommandLine contains \"\\\\sysvol\\\\\" and TargetProcessCommandLine contains \"xml\"))|extend RuleId=\"91a2c315-9ee6-4052-a853-6f6a8238f90d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_findstr_gpp_passwords.yml\";\nlet q15=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\findstrexe\" or TargetProcessFilename =~ \"FINDSTREXE\") and TargetProcessCommandLine contains \"lsass\") or (TargetProcessCommandLine contains \" /i \\\"lsass\" or TargetProcessCommandLine contains \" /i lsassexe\" or TargetProcessCommandLine contains \"findstr \\\"lsass\" or TargetProcessCommandLine contains \"findstr lsass\" or TargetProcessCommandLine contains \"findstrexe \\\"lsass\" or TargetProcessCommandLine contains \"findstrexe lsass\"))|extend RuleId=\"fe63010f-8823-4864-a96b-a7b4a0f7b929\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_findstr_lsass.yml\";\nlet q16=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\findstrexe\" or TargetProcessFilename =~ \"FINDSTREXE\") and TargetProcessCommandLine contains \" 385201\")|extend RuleId=\"37db85d1-b089-490a-a59a-c7b6f984f480\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_findstr_sysmon_discovery_via_default_altitude.yml\";\nlet q17=_Im_ProcessCreate\n| where (TargetProcessFilename =~ \"fingerexe\" or TargetProcessName endswith \"\\\\fingerexe\")|extend RuleId=\"af491bca-e752-4b44-9c86-df5680533dbc\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_finger_usage.yml\";\nlet q18=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\fltMCexe\" or TargetProcessFilename =~ \"fltMCexe\") and TargetProcessCommandLine contains \"unload\") and (not(TargetProcessCommandLine endswith \"unload rtp_filesystem_filter\")))|extend RuleId=\"4931188c-178e-4ee7-a348-39e8a7a56821\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_fltmc_unload_driver.yml\";\nlet q19=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\fltMCexe\" or TargetProcessFilename =~ \"fltMCexe\") and (TargetProcessCommandLine contains \"unload\" and TargetProcessCommandLine contains \"sysmon\"))|extend RuleId=\"4d7cda18-1b12-4e52-b45c-d28653210df8\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_fltmc_unload_driver_sysmon.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["CommandAndControl", "DefenseEvasion", "Discovery", "Persistence", "Exfiltration", "Execution", "InitialAccess", "PrivilegeEscalation", "CredentialAccess"],
                "techniques": ["T1055", "T1070", "T1552", "T1133", "T1574", "T1082", "T1003", "T1518", "T1071", "T1048", "T1112", "T1132", "T1036", "T1562", "T1105", "T1548"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000203",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}