{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000118')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000118')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation low 18",
                "description": "Sigma Windows Process Creation low 18",
                "severity": "low",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName contains \":\\\\RECYCLER\\\\\" or TargetProcessName contains \":\\\\SystemVolumeInformation\\\\\") or (TargetProcessName startswith \"C:\\\\Windows\\\\Tasks\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\debug\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\fonts\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\help\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\drivers\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\addins\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\cursors\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\system32\\\\tasks\\\\\"))|extend RuleId=\"15b75071-74cc-47e0-b4c6-b43744a62a2b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_run_locations.yml\"|extend RuleTitle=\"Suspicious Process Start Locations\"|extend RuleDescription=\"Detects suspicious process run from unusual locations\";\nlet q1=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"rundll32\" and (TargetProcessCommandLine contains \"mshtml,RunHTMLApplication\" or TargetProcessCommandLine contains \"mshtml,#135\") and (TargetProcessCommandLine contains \"javascript:\" or TargetProcessCommandLine contains \"vbscript:\"))|extend RuleId=\"73fcad2e-ff14-4c38-b11d-4172c8ac86c7\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_script_run.yml\"|extend RuleTitle=\"Suspicious Rundll32 Script in CommandLine\"|extend RuleDescription=\"Detects suspicious process related to rundll32 based on arguments\";\nlet q2=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\runonce.exe\" and ActingProcessName endswith \"\\\\rundll32.exe\" and (ActingProcessCommandLine contains \"setupapi.dll\" and ActingProcessCommandLine contains \"InstallHinfSection\"))|extend RuleId=\"285b85b1-a555-4095-8652-a8a4106af63f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_setupapi_installhinfsection.yml\"|extend RuleTitle=\"Suspicious Rundll32 Setupapi.dll Activity\"|extend RuleDescription=\"setupapi.dll library provide InstallHinfSection function for processing INF files. INF file may contain instructions allowing to create values in the registry, modify files and install drivers. This technique could be used to obtain persistence via modifying one of Run or RunOnce registry keys, run process or use other DLLs chain calls (see references) InstallHinfSection function in setupapi.dll calls runonce.exe executable regardless of actual content of INF file.\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessFilename =~ \"RUNDLL32.EXE\") and TargetProcessCommandLine contains \"RunDll_ShellExecuteW\")|extend RuleId=\"82343930-652f-43f5-ab70-2ee9fdd6d5e9\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_shelldispatch_potential_abuse.yml\"|extend RuleTitle=\"Potential ShellDispatch.DLL Functionality Abuse\"|extend RuleDescription=\"Detects potential \"ShellDispatch.dll\" functionality abuse to execute arbitrary binaries via \"ShellExecute\"\";\nlet q4=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \"javascript:\" and TargetProcessCommandLine contains \".RegisterXLL\") or (TargetProcessCommandLine contains \"url.dll\" and TargetProcessCommandLine contains \"OpenURL\") or (TargetProcessCommandLine contains \"url.dll\" and TargetProcessCommandLine contains \"OpenURLA\") or (TargetProcessCommandLine contains \"url.dll\" and TargetProcessCommandLine contains \"FileProtocolHandler\") or (TargetProcessCommandLine contains \"zipfldr.dll\" and TargetProcessCommandLine contains \"RouteTheCall\") or (TargetProcessCommandLine contains \"shell32.dll\" and TargetProcessCommandLine contains \"Control_RunDLL\") or (TargetProcessCommandLine contains \"shell32.dll\" and TargetProcessCommandLine contains \"ShellExec_RunDLL\") or (TargetProcessCommandLine contains \"mshtml.dll\" and TargetProcessCommandLine contains \"PrintHTML\") or (TargetProcessCommandLine contains \"advpack.dll\" and TargetProcessCommandLine contains \"LaunchINFSection\") or (TargetProcessCommandLine contains \"advpack.dll\" and TargetProcessCommandLine contains \"RegisterOCX\") or (TargetProcessCommandLine contains \"ieadvpack.dll\" and TargetProcessCommandLine contains \"LaunchINFSection\") or (TargetProcessCommandLine contains \"ieadvpack.dll\" and TargetProcessCommandLine contains \"RegisterOCX\") or (TargetProcessCommandLine contains \"ieframe.dll\" and TargetProcessCommandLine contains \"OpenURL\") or (TargetProcessCommandLine contains \"shdocvw.dll\" and TargetProcessCommandLine contains \"OpenURL\") or (TargetProcessCommandLine contains \"syssetup.dll\" and TargetProcessCommandLine contains \"SetupInfObjectInstallAction\") or (TargetProcessCommandLine contains \"setupapi.dll\" and TargetProcessCommandLine contains \"InstallHinfSection\") or (TargetProcessCommandLine contains \"pcwutl.dll\" and TargetProcessCommandLine contains \"LaunchApplication\") or (TargetProcessCommandLine contains \"dfshim.dll\" and TargetProcessCommandLine contains \"ShOpenVerbApplication\") or (TargetProcessCommandLine contains \"dfshim.dll\" and TargetProcessCommandLine contains \"ShOpenVerbShortcut\") or (TargetProcessCommandLine contains \"scrobj.dll\" and TargetProcessCommandLine contains \"GenerateTypeLib\" and TargetProcessCommandLine contains \"http\") or (TargetProcessCommandLine contains \"shimgvw.dll\" and TargetProcessCommandLine contains \"ImageView_Fullscreen\" and TargetProcessCommandLine contains \"http\") or (TargetProcessCommandLine contains \"comsvcs.dll\" and TargetProcessCommandLine contains \"MiniDump\")) and (not((TargetProcessCommandLine contains \"shell32.dll,Control_RunDLL desk.cpl,screensaver,@screensaver\" or (ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\control.exe\" and ActingProcessCommandLine contains \".cpl\" and (TargetProcessCommandLine contains \"Shell32.dll\" and TargetProcessCommandLine contains \"Control_RunDLL\" and TargetProcessCommandLine contains \".cpl\")) or (ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\control.exe\" and TargetProcessCommandLine startswith \"\\\"C:\\\\Windows\\\\system32\\\\rundll32.exe\\\" Shell32.dll,Control_RunDLL \\\"C:\\\\Windows\\\\System32\\\\\" and TargetProcessCommandLine endswith \".cpl\\\",\")))))|extend RuleId=\"e593cf51-88db-4ee1-b920-37e89012a3c9\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_susp_activity.yml\"|extend RuleTitle=\"Potentially Suspicious Rundll32 Activity\"|extend RuleDescription=\"Detects suspicious execution of rundll32, with specific calls to some DLLs with known LOLBIN functionalities\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessFilename =~ \"RUNDLL32.EXE\") and ActingProcessName endswith \"\\\\cmd.exe\" and TargetProcessCommandLine contains \"user32.dll,\" and TargetProcessCommandLine contains \"LockWorkStation\")|extend RuleId=\"3b5b0213-0460-4e3f-8937-3abf98ff7dcc\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_user32_dll.yml\"|extend RuleTitle=\"Suspicious Workstation Locking via Rundll32\"|extend RuleDescription=\"Detects a suspicious call to the user32.dll function that locks the user workstation\";\nlet q6=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\svchost.exe\" and (TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessFilename =~ \"RUNDLL32.EXE\") and TargetProcessCommandLine contains \"C:\\\\windows\\\\system32\\\\davclnt.dll,DavSetCookie\")|extend RuleId=\"2dbd9d3d-9e27-42a8-b8df-f13825c6c3d5\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_webdav_client_execution.yml\"|extend RuleTitle=\"WebDav Client Execution Via Rundll32.EXE\"|extend RuleDescription=\"Detects \"svchost.exe\" spawning \"rundll32.exe\" with command arguments like \"C:\\windows\\system32\\davclnt.dll,DavSetCookie\".\nThis could be an indicator of exfiltration or use of WebDav to launch code (hosted on a WebDav server).\n\";\nlet q7=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\schtasks.exe\" and TargetProcessCommandLine contains \"/Create \") and (TargetProcessCommandLine contains \"/TN \\\"{\" or TargetProcessCommandLine contains \"/TN '{\" or TargetProcessCommandLine contains \"/TN {\") and (TargetProcessCommandLine contains \"}\\\"\" or TargetProcessCommandLine contains \"}'\" or TargetProcessCommandLine contains \"} \"))|extend RuleId=\"ff2fff64-4cd6-4a2b-ba7d-e28a30bbe66b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_schtasks_guid_task_name.yml\"|extend RuleTitle=\"Suspicious Scheduled Task Name As GUID\"|extend RuleDescription=\"Detects creation of a scheduled task with a GUID like name\";\nlet q8=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\schtasks.exe\" and TargetProcessCommandLine contains \"/Create \" and (ActingProcessName contains \"\\\\AppData\\\\Local\\\\\" or ActingProcessName contains \"\\\\AppData\\\\Roaming\\\\\" or ActingProcessName contains \"\\\\Temporary Internet\" or ActingProcessName contains \"\\\\Users\\\\Public\\\\\")) and (not((TargetProcessCommandLine contains \"update_task.xml\" or TargetProcessCommandLine contains \"unattended.ini\"))))|extend RuleId=\"9494479d-d994-40bf-a8b1-eea890237021\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_schtasks_parent.yml\"|extend RuleTitle=\"Suspicious Add Scheduled Task Parent\"|extend RuleDescription=\"Detects suspicious scheduled task creations from a parent stored in a temporary folder\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessFilename =~ \"schtasks.exe\") and (TargetProcessCommandLine contains \"run \" and TargetProcessCommandLine contains \"\\\\Application Experience\\\\Microsoft Compatibility Appraiser\"))|extend RuleId=\"f548a603-c9f2-4c89-b511-b089f7e94549\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_schtasks_persistence_windows_telemetry.yml\"|extend RuleTitle=\"Potential Persistence Via Microsoft Compatibility Appraiser\"|extend RuleDescription=\"Detects manual execution of the \"Microsoft Compatibility Appraiser\" task via schtasks.\nIn order to trigger persistence stored in the \"\\AppCompatFlags\\TelemetryController\" registry key.\n\";\nlet q10=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessFilename =~ \"schtasks.exe\") and TargetProcessCommandLine contains \"/Create\" and (TargetProcessCommandLine contains \"Get-ItemProperty\" or TargetProcessCommandLine contains \" gp \") and (TargetProcessCommandLine contains \"HKCU:\" or TargetProcessCommandLine contains \"HKLM:\" or TargetProcessCommandLine contains \"registry::\" or TargetProcessCommandLine contains \"HKEY_\")) and (not((TargetProcessCommandLine contains \"FromBase64String\" or TargetProcessCommandLine contains \"encodedcommand\"))))|extend RuleId=\"86588b36-c6d3-465f-9cee-8f9093e07798\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_schtasks_reg_loader.yml\"|extend RuleTitle=\"Scheduled Task Executing Payload from Registry\"|extend RuleDescription=\"Detects the creation of a schtasks that potentially executes a payload stored in the Windows Registry using PowerShell.\";\nlet q11=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessFilename =~ \"schtasks.exe\") and (TargetProcessCommandLine contains \" ONLOGON \" or TargetProcessCommandLine contains \" ONSTART \" or TargetProcessCommandLine contains \" ONCE \" or TargetProcessCommandLine contains \" ONIDLE \") and (TargetProcessCommandLine contains \"NT AUT\" or TargetProcessCommandLine contains \" SYSTEM\" or TargetProcessCommandLine contains \"HIGHEST\"))|extend RuleId=\"7a02e22e-b885-4404-b38b-1ddc7e65258a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_schtasks_schedule_type_system.yml\"|extend RuleTitle=\"Suspicious Schtasks Schedule Type With High Privileges\"|extend RuleDescription=\"Detects scheduled task creations or modification to be run with high privileges on a suspicious schedule type\";\nlet q12=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessFilename =~ \"schtasks.exe\") and (TargetProcessCommandLine contains \"/create\" or TargetProcessCommandLine contains \"-create\") and (TargetProcessCommandLine contains \"/xml\" or TargetProcessCommandLine contains \"-xml\")) and (not((TargetProcessCommandLine contains \".xml\" or TargetProcessIntegrityLevel =~ \"System\" or (ActingProcessName endswith \"\\\\rundll32.exe\" and (ActingProcessCommandLine contains \":\\\\WINDOWS\\\\Installer\\\\MSI\" and ActingProcessCommandLine contains \".tmp,zzzzInvokeManagedCustomActionOutOfProc\"))))) and (not((ActingProcessName contains \"*:\\\\ProgramData\\\\OEM\\\\UpgradeTool\\\\CareCenter_*\\\\BUnzip\\\\Setup_msi.exe\" or ActingProcessName endswith \":\\\\Program Files\\\\Axis Communications\\\\AXIS Camera Station\\\\SetupActions.exe\" or ActingProcessName endswith \":\\\\Program Files\\\\Axis Communications\\\\AXIS Device Manager\\\\AdmSetupActions.exe\" or ActingProcessName endswith \":\\\\Program Files (x86)\\\\Zemana\\\\AntiMalware\\\\AntiMalware.exe\" or ActingProcessName endswith \":\\\\Program Files\\\\Dell\\\\SupportAssist\\\\pcdrcui.exe\"))))|extend RuleId=\"dd2a821e-3b07-4d3b-a9ac-929fe4c6ca0c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_schtasks_schedule_via_masqueraded_xml_file.yml\"|extend RuleTitle=\"Suspicious Scheduled Task Creation via Masqueraded XML File\"|extend RuleDescription=\"Detects the creation of a scheduled task using the \"-XML\" flag with a file without the '.xml' extension. This behavior could be indicative of potential defense evasion attempt during persistence\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "Persistence", "Execution", "Exfiltration", "PrivilegeEscalation"],
                "techniques": ["T1218", "T1036", "T1053", "T1048", "T1059"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000118",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}