{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000114')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000114')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation low 14",
                "description": "Sigma Windows Process Creation low 14",
                "severity": "low",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\sc.exe\" or TargetProcessFilename =~ \"sc.exe\") and ((TargetProcessCommandLine contains \" config \" and TargetProcessCommandLine contains \"start\") and (TargetProcessCommandLine contains \"disabled\" or TargetProcessCommandLine contains \"demand\")))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000113\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sc_disable_service.yml\"|extend RuleTitle=\"Service StartupType Change Via Sc.EXE\"|extend RuleDescription=\"Detect the use of \"sc.exe\" to change the startup type of a service to \"disabled\" or \"demand\"\";\nlet q1=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\sc.exe\" and (TargetProcessCommandLine contains \"create\" or TargetProcessCommandLine contains \"config\") and (TargetProcessCommandLine contains \"binPath\" and TargetProcessCommandLine contains \"type\" and TargetProcessCommandLine contains \"kernel\"))|extend RuleId=\"431a1fdb-4799-4f3b-91c3-a683b003fc49\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sc_new_kernel_driver.yml\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\sc.exe\" or TargetProcessFilename =~ \"sc.exe\") and TargetProcessCommandLine contains \"sdset\")|extend RuleId=\"98c5aeef-32d5-492f-b174-64a691896d25\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sc_sdset_modification.yml\";\nlet q3=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \"sc \" and TargetProcessCommandLine contains \"config \" and TargetProcessCommandLine contains \"binpath=\") or (TargetProcessCommandLine contains \"sc \" and TargetProcessCommandLine contains \"failure\" and TargetProcessCommandLine contains \"command=\")) or (((TargetProcessCommandLine contains \"reg \" and TargetProcessCommandLine contains \"add \" and TargetProcessCommandLine contains \"FailureCommand\") or (TargetProcessCommandLine contains \"reg \" and TargetProcessCommandLine contains \"add \" and TargetProcessCommandLine contains \"ImagePath\")) and (TargetProcessCommandLine contains \".sh\" or TargetProcessCommandLine contains \".exe\" or TargetProcessCommandLine contains \".dll\" or TargetProcessCommandLine contains \".bin$\" or TargetProcessCommandLine contains \".bat\" or TargetProcessCommandLine contains \".cmd\" or TargetProcessCommandLine contains \".js\" or TargetProcessCommandLine contains \".msh$\" or TargetProcessCommandLine contains \".reg$\" or TargetProcessCommandLine contains \".scr\" or TargetProcessCommandLine contains \".ps\" or TargetProcessCommandLine contains \".vb\" or TargetProcessCommandLine contains \".jar\" or TargetProcessCommandLine contains \".pl\")))|extend RuleId=\"38879043-7e1e-47a9-8d46-6bec88e201df\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sc_service_tamper_for_persistence.yml\";\nlet q4=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\sdbinst.exe\" or TargetProcessFilename =~ \"sdbinst.exe\") and TargetProcessCommandLine contains \".sdb\") and (not((ActingProcessName endswith \"\\\\msiexec.exe\" and TargetProcessCommandLine contains \"iisexpressshim.sdb\"))))|extend RuleId=\"517490a7-115a-48c6-8862-1a481504d5a8\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sdbinst_shim_persistence.yml\";\nlet q5=_Im_ProcessCreate\n| where ActingProcessName endswith \"\\\\sdclt.exe\"|extend RuleId=\"da2738f2-fadb-4394-afa7-0a0674885afa\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sdclt_child_process.yml\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\secedit.exe\" or TargetProcessFilename =~ \"SeCEdit\") and ((TargetProcessCommandLine contains \"/export\" and TargetProcessCommandLine contains \"/cfg\") or (TargetProcessCommandLine contains \"/configure\" and TargetProcessCommandLine contains \"/db\")))|extend RuleId=\"c2c76b77-32be-4d1f-82c9-7e544bdfe0eb\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_secedit_execution.yml\";\nlet q7=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\setspn.exe\" or TargetProcessFilename =~ \"setspn.exe\" or (TargetProcessFileDescription contains \"Query or reset the computer\" and TargetProcessFileDescription contains \"SPN attribute\")) and (TargetProcessCommandLine contains \" -q \" or TargetProcessCommandLine contains \" /q \"))|extend RuleId=\"1eeed653-dbc8-4187-ad0c-eeebb20e6599\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_setspn_spn_enumeration.yml\";\nlet q8=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\shutdown.exe\" and (TargetProcessCommandLine contains \"/r \" or TargetProcessCommandLine contains \"/s \"))|extend RuleId=\"34ebb878-1b15-4895-b352-ca2eeb99b274\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_shutdown_execution.yml\";\nlet q9=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\shutdown.exe\" and TargetProcessCommandLine contains \"/l\")|extend RuleId=\"ec290c06-9b6b-4338-8b6b-095c0f284f10\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_shutdown_logoff.yml\";\nlet q10=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\SndVol.exe\" and (not((TargetProcessName endswith \"\\\\rundll32.exe\" and TargetProcessCommandLine contains \" shell32.dll,Control_RunDLL \"))))|extend RuleId=\"ba42babc-0666-4393-a4f7-ceaf5a69191e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sndvol_susp_child_processes.yml\";\nlet q11=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\SoundRecorder.exe\" and TargetProcessCommandLine contains \"/FILE\")|extend RuleId=\"83865853-59aa-449e-9600-74b9d89a6d6e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_soundrecorder_audio_capture.yml\";\nlet q12=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\sqlcmd.exe\" and (TargetProcessCommandLine contains \"VeeamBackup\" and TargetProcessCommandLine contains \"From \")) and (TargetProcessCommandLine contains \"BackupRepositories\" or TargetProcessCommandLine contains \"Backups\" or TargetProcessCommandLine contains \"Credentials\" or TargetProcessCommandLine contains \"HostCreds\" or TargetProcessCommandLine contains \"SmbFileShares\" or TargetProcessCommandLine contains \"Ssh_creds\" or TargetProcessCommandLine contains \"VSphereInfo\"))|extend RuleId=\"696bfb54-227e-4602-ac5b-30d9d2053312\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sqlcmd_veeam_db_recon.yml\";\nlet q13=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\amazon-ssm-agent.exe\" and (TargetProcessCommandLine contains \"-register \" and TargetProcessCommandLine contains \"-code \" and TargetProcessCommandLine contains \"-id \" and TargetProcessCommandLine contains \"-region \"))|extend RuleId=\"d20ee2f4-822c-4827-9e15-41500b1fff10\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_ssm_agent_abuse.yml\";\nlet q14=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\ntvdm.exe\" or TargetProcessName endswith \"\\\\csrstub.exe\")|extend RuleId=\"16905e21-66ee-42fe-b256-1318ada2d770\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_16bit_application.yml\";\nlet q15=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \"localgroup \" and TargetProcessCommandLine contains \" /add\") or (TargetProcessCommandLine contains \"Add-LocalGroupMember \" and TargetProcessCommandLine contains \" -Group \")) and (TargetProcessCommandLine contains \" administrators \" or TargetProcessCommandLine contains \" administrateur\"))|extend RuleId=\"ad720b90-25ad-43ff-9b5e-5c841facc8e5\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_add_user_local_admin_group.yml\";\nlet q16=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"txt:\" and ((TargetProcessCommandLine contains \"type \" and TargetProcessCommandLine contains \" > \") or (TargetProcessCommandLine contains \"makecab \" and TargetProcessCommandLine contains \".cab\") or (TargetProcessCommandLine contains \"reg \" and TargetProcessCommandLine contains \" export \") or (TargetProcessCommandLine contains \"regedit \" and TargetProcessCommandLine contains \" /E \") or (TargetProcessCommandLine contains \"esentutl \" and TargetProcessCommandLine contains \" /y \" and TargetProcessCommandLine contains \" /d \" and TargetProcessCommandLine contains \" /o \")))|extend RuleId=\"7f43c430-5001-4f8b-aaa9-c3b88f18fa5c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_alternate_data_streams.yml\";\nlet q17=_Im_ProcessCreate\n| where ((((TargetProcessName contains \"\\\\Windows\\\\Installer\\\\\" and TargetProcessName contains \"msi\") and TargetProcessName endswith \"tmp\") or (TargetProcessName endswith \"\\\\msiexec.exe\" and TargetProcessIntegrityLevel =~ \"System\")) and (TargetUsername contains \"AUTHORI\" or TargetUsername contains \"AUTORI\") and (not((ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\services.exe\" or (TargetProcessCommandLine endswith \"\\\\system32\\\\msiexec.exe /V\" or ActingProcessCommandLine endswith \"\\\\system32\\\\msiexec.exe /V\") or ActingProcessName startswith \"C:\\\\ProgramData\\\\Sophos\\\\\" or ActingProcessName startswith \"C:\\\\ProgramData\\\\Avira\\\\\" or (ActingProcessName startswith \"C:\\\\Program Files\\\\Avast Software\\\\\" or ActingProcessName startswith \"C:\\\\Program Files (x86)\\\\Avast Software\\\\\") or (ActingProcessName startswith \"C:\\\\Program Files\\\\Google\\\\Update\\\\\" or ActingProcessName startswith \"C:\\\\Program Files (x86)\\\\Google\\\\Update\\\\\")))))|extend RuleId=\"cd951fdc-4b2f-47f5-ba99-a33bf61e3770\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_always_install_elevated_windows_installer.yml\";\nlet q18=_Im_ProcessCreate\n| where (ActingProcessName contains \"C:\\\\Program Files\\\\WindowsApps\\\\\" and ((TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\wscript.exe\") or (TargetProcessCommandLine contains \"cmd /c\" or TargetProcessCommandLine contains \"Invoke-\" or TargetProcessCommandLine contains \"Base64\")) and (not((ActingProcessName contains \":\\\\Program Files\\\\WindowsApps\\\\Microsoft.WindowsTerminal\" and ActingProcessName endswith \"\\\\WindowsTerminal.exe\" and (TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\")))))|extend RuleId=\"f91ed517-a6ba-471d-9910-b3b4a398c0f3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_appx_execution.yml\";\nlet q19=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \".SettingContent-ms\" and (not(TargetProcessCommandLine contains \"immersivecontrolpanel\")))|extend RuleId=\"24de4f3b-804c-4165-b442-5a06a2302c7e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_arbitrary_shell_execution_via_settingcontent.yml\";\nlet q20=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \".doc\" or TargetProcessCommandLine contains \".docx\" or TargetProcessCommandLine contains \".xls\" or TargetProcessCommandLine contains \".xlsx\" or TargetProcessCommandLine contains \".ppt\" or TargetProcessCommandLine contains \".pptx\" or TargetProcessCommandLine contains \".rtf\" or TargetProcessCommandLine contains \".pdf\" or TargetProcessCommandLine contains \".txt\") and ((TargetProcessCommandLine contains \"dir \" and TargetProcessCommandLine contains \" /b \" and TargetProcessCommandLine contains \" /s \") or (TargetProcessFilename =~ \"FINDSTR.EXE\" and (TargetProcessCommandLine contains \" /e \" or TargetProcessCommandLine contains \" /si \"))))|extend RuleId=\"f576a613-2392-4067-9d1a-9345fb58d8d1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_automated_collection.yml\";\nlet q21=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"h^t^t^p\" or TargetProcessCommandLine contains \"h\\\"t\\\"t\\\"p\")|extend RuleId=\"f0cdd048-82dc-4f7a-8a7a-b87a52b6d0fd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_cli_obfuscation_escape_char.yml\";\nlet q22=_Im_ProcessCreate\n| where (((TargetProcessName contains \"\\\\Windows\\\\\" and (TargetProcessCommandLine contains \"\\\\..\\\\Windows\\\\\" or TargetProcessCommandLine contains \"\\\\..\\\\System32\\\\\" or TargetProcessCommandLine contains \"\\\\..\\\\..\\\\\")) or TargetProcessCommandLine contains \".exe\\\\..\\\\\") and (not((TargetProcessCommandLine contains \"\\\\Google\\\\Drive\\\\googledrivesync.exe\\\\..\\\\\" or TargetProcessCommandLine contains \"\\\\Citrix\\\\Virtual Smart Card\\\\Citrix.Authentication.VirtualSmartcard.Launcher.exe\\\\..\\\\\"))))|extend RuleId=\"1327381e-6ab0-4f38-b583-4c1b8346a56b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_commandline_path_traversal_evasion.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19, q20, q21, q22;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["PrivilegeEscalation", "CommandAndControl", "CredentialAccess", "DefenseEvasion", "Discovery", "Impact", "InitialAccess", "Persistence", "Collection", "Execution"],
                "techniques": ["T1529", "T1005", "T1036", "T1098", "T1566", "T1123", "T1119", "T1548", "T1219", "T1547", "T1543", "T1574", "T1564", "T1204", "T1558", "T1140", "T1546", "T1505", "T1562", "T1556", "T1082", "T1552", "T1557"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000114",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}