{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000210')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000210')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 10",
                "description": "Sigma Windows Process Creation medium 10",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"winPEAS.exe\" or (TargetProcessName endswith \"\\\\winPEASany.exe\" or TargetProcessName endswith \"\\\\winPEASany_ofs.exe\" or TargetProcessName endswith \"\\\\winPEASx64.exe\" or TargetProcessName endswith \"\\\\winPEASx64_ofs.exe\" or TargetProcessName endswith \"\\\\winPEASx86.exe\" or TargetProcessName endswith \"\\\\winPEASx86_ofs.exe\")) or (TargetProcessCommandLine contains \" applicationsinfo\" or TargetProcessCommandLine contains \" browserinfo\" or TargetProcessCommandLine contains \" eventsinfo\" or TargetProcessCommandLine contains \" fileanalysis\" or TargetProcessCommandLine contains \" filesinfo\" or TargetProcessCommandLine contains \" processinfo\" or TargetProcessCommandLine contains \" servicesinfo\" or TargetProcessCommandLine contains \" windowscreds\") or TargetProcessCommandLine contains \"https://github.com/carlospolop/PEASS-ng/releases/latest/download/\" or (ActingProcessCommandLine endswith \" -linpeas\" or TargetProcessCommandLine endswith \" -linpeas\"))|extend RuleId=\"98b53e78-ebaf-46f8-be06-421aafd176d9\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_winpeas.yml\"|extend RuleTitle=\"HackTool - winPEAS Execution\"|extend RuleDescription=\"WinPEAS is a script that search for possible paths to escalate privileges on Windows hosts. The checks are explained on book.hacktricks.xyz\";\nlet q1=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"-NoP -NoL -sta -NonI -W Hidden -Exec Bypass -Enc\"|extend RuleId=\"022eaba8-f0bf-4dd9-9217-4604b0bb3bb0\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_wmiexec_default_powershell.yml\"|extend RuleTitle=\"HackTool - Wmiexec Default Powershell Command\"|extend RuleDescription=\"Detects the execution of PowerShell with a specific flag sequence that is used by the Wmiexec script\";\nlet q2=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\xordump.exe\" or (TargetProcessCommandLine contains \" -process lsass.exe \" or TargetProcessCommandLine contains \" -m comsvcs \" or TargetProcessCommandLine contains \" -m dbghelp \" or TargetProcessCommandLine contains \" -m dbgcore \"))|extend RuleId=\"66e563f9-1cbd-4a22-a957-d8b7c0f44372\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_xordump.yml\"|extend RuleTitle=\"HackTool - XORDump Execution\"|extend RuleDescription=\"Detects suspicious use of XORDump process memory dumping utility\";\nlet q3=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\Hwp.exe\" and TargetProcessName endswith \"\\\\gbb.exe\")|extend RuleId=\"023394c4-29d5-46ab-92b8-6a534c6f447b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hwp_exploits.yml\"|extend RuleTitle=\"Suspicious HWP Sub Processes\"|extend RuleDescription=\"Detects suspicious Hangul Word Processor (Hanword) sub processes that could indicate an exploitation\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\appcmd.exe\" or TargetProcessFilename =~ \"appcmd.exe\") and (TargetProcessCommandLine contains \"set\" and TargetProcessCommandLine contains \"config\" and TargetProcessCommandLine contains \"section:httplogging\" and TargetProcessCommandLine contains \"dontLog:true\"))|extend RuleId=\"e4ed6030-ffe5-4e6a-8a8a-ab3c1ab9d94e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_iis_appcmd_http_logging.yml\"|extend RuleTitle=\"Disable Windows IIS HTTP Logging\"|extend RuleDescription=\"Disables HTTP logging on a Windows IIS web server as seen by Threat Group 3390 (Bronze Union)\";\nlet q5=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\appcmd.exe\" or TargetProcessFilename =~ \"appcmd.exe\") and TargetProcessCommandLine contains \"list \") and ((TargetProcessCommandLine contains \" /config\" or TargetProcessCommandLine contains \" /xml\" or TargetProcessCommandLine contains \" -config\" or TargetProcessCommandLine contains \" -xml\") or ((TargetProcessCommandLine contains \" /@t\" or TargetProcessCommandLine contains \" /text\" or TargetProcessCommandLine contains \" /show\" or TargetProcessCommandLine contains \" -@t\" or TargetProcessCommandLine contains \" -text\" or TargetProcessCommandLine contains \" -show\") and (TargetProcessCommandLine contains \":\\\\*\" or TargetProcessCommandLine contains \"password\"))))|extend RuleId=\"2d3cdeec-c0db-45b4-aa86-082f7eb75701\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_iis_appcmd_service_account_password_dumped.yml\"|extend RuleTitle=\"Microsoft IIS Service Account Password Dumped\"|extend RuleDescription=\"Detects the Internet Information Services (IIS) command-line tool, AppCmd, being used to list passwords\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\aspnet_regiis.exe\" or TargetProcessFilename =~ \"aspnet_regiis.exe\") and (TargetProcessCommandLine contains \"connectionStrings\" and TargetProcessCommandLine contains \" -pdf\"))|extend RuleId=\"97dbf6e2-e436-44d8-abee-4261b24d3e41\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_iis_connection_strings_decryption.yml\"|extend RuleTitle=\"Microsoft IIS Connection Strings Decryption\"|extend RuleDescription=\"Detects use of aspnet_regiis to decrypt Microsoft IIS connection strings. An attacker with Microsoft IIS web server access via a webshell or alike can decrypt and dump any hardcoded connection strings, such as the MSSQL service account password using aspnet_regiis command.\";\nlet q7=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\w3wp.exe\" and (TargetProcessCommandLine contains \"appcmd.exe add module\" or (TargetProcessCommandLine contains \" system.enterpriseservices.internal.publish\" and TargetProcessName endswith \"\\\\powershell.exe\") or (TargetProcessCommandLine contains \"gacutil\" and TargetProcessCommandLine contains \" /I\")))|extend RuleId=\"043c4b8b-3a54-4780-9682-081cb6b8185c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_iis_susp_module_registration.yml\"|extend RuleTitle=\"Suspicious IIS Module Registration\"|extend RuleDescription=\"Detects a suspicious IIS module registration as described in Microsoft threat report on IIS backdoors\";\nlet q8=_Im_ProcessCreate\n| where (((ActingProcessName endswith \"\\\\WmiPrvSE.exe\" or ActingProcessName endswith \"\\\\svchost.exe\" or ActingProcessName endswith \"\\\\dllhost.exe\") and TargetProcessName endswith \"\\\\ImagingDevices.exe\") or ActingProcessName endswith \"\\\\ImagingDevices.exe\")|extend RuleId=\"f11f2808-adb4-46c0-802a-8660db50fa99\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_imagingdevices_unusual_parents.yml\"|extend RuleTitle=\"ImagingDevices Unusual Parent/Child Processes\"|extend RuleDescription=\"Detects unusual parent or children of the ImagingDevices.exe (Windows Contacts) process as seen being used with Bumblebee activity\";\nlet q9=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\keytool.exe\" and (TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\sh.exe\" or TargetProcessName endswith \"\\\\bash.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessName endswith \"\\\\whoami.exe\" or TargetProcessName endswith \"\\\\bitsadmin.exe\" or TargetProcessName endswith \"\\\\wscript.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\scrcons.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\hh.exe\" or TargetProcessName endswith \"\\\\wmic.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\forfiles.exe\" or TargetProcessName endswith \"\\\\scriptrunner.exe\" or TargetProcessName endswith \"\\\\mftrace.exe\" or TargetProcessName endswith \"\\\\AppVLP.exe\" or TargetProcessName endswith \"\\\\systeminfo.exe\" or TargetProcessName endswith \"\\\\reg.exe\" or TargetProcessName endswith \"\\\\query.exe\"))|extend RuleId=\"90fb5e62-ca1f-4e22-b42e-cc521874c938\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_java_keytool_susp_child_process.yml\"|extend RuleTitle=\"Suspicious Shells Spawn by Java Utility Keytool\"|extend RuleDescription=\"Detects suspicious shell spawn from Java utility keytool process (e.g. adselfservice plus exploitation)\";\nlet q10=_Im_ProcessCreate\n| where (((ActingProcessName contains \"\\\\ManageEngine\\\\ServiceDesk\\\\\" and ActingProcessName contains \"\\\\java.exe\") and (TargetProcessName endswith \"\\\\AppVLP.exe\" or TargetProcessName endswith \"\\\\bash.exe\" or TargetProcessName endswith \"\\\\bitsadmin.exe\" or TargetProcessName endswith \"\\\\calc.exe\" or TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\curl.exe\" or TargetProcessName endswith \"\\\\forfiles.exe\" or TargetProcessName endswith \"\\\\mftrace.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\" or TargetProcessName endswith \"\\\\notepad.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\query.exe\" or TargetProcessName endswith \"\\\\reg.exe\" or TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessName endswith \"\\\\scrcons.exe\" or TargetProcessName endswith \"\\\\sh.exe\" or TargetProcessName endswith \"\\\\systeminfo.exe\" or TargetProcessName endswith \"\\\\whoami.exe\" or TargetProcessName endswith \"\\\\wmic.exe\" or TargetProcessName endswith \"\\\\wscript.exe\")) and (not(((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") and TargetProcessCommandLine contains \" stop\"))))|extend RuleId=\"cea2b7ea-792b-405f-95a1-b903ea06458f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_java_manageengine_susp_child_process.yml\"|extend RuleTitle=\"Suspicious Child Process Of Manage Engine ServiceDesk\"|extend RuleDescription=\"Detects suspicious child processes of the \\\"Manage Engine ServiceDesk Plus\\\" Java web service\";\nlet q11=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\java.exe\" and (TargetProcessName endswith \"\\\\sh.exe\" or TargetProcessName endswith \"\\\\bash.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessName endswith \"\\\\whoami.exe\" or TargetProcessName endswith \"\\\\bitsadmin.exe\" or TargetProcessName endswith \"\\\\wscript.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\scrcons.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\hh.exe\" or TargetProcessName endswith \"\\\\wmic.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\forfiles.exe\" or TargetProcessName endswith \"\\\\scriptrunner.exe\" or TargetProcessName endswith \"\\\\mftrace.exe\" or TargetProcessName endswith \"\\\\AppVLP.exe\" or TargetProcessName endswith \"\\\\curl.exe\" or TargetProcessName endswith \"\\\\systeminfo.exe\" or TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\" or TargetProcessName endswith \"\\\\reg.exe\" or TargetProcessName endswith \"\\\\query.exe\"))|extend RuleId=\"0d34ed8b-1c12-4ff2-828c-16fc860b766d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_java_susp_child_process.yml\"|extend RuleTitle=\"Suspicious Shells Spawned by Java\"|extend RuleDescription=\"Detects suspicious shell spawned from Java host process (e.g. log4j exploitation)\";\nlet q12=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\kd.exe\" or TargetProcessFilename =~ \"kd.exe\")|extend RuleId=\"27ee9438-90dc-4bef-904b-d3ef927f5e7e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_kd_execution.yml\"|extend RuleTitle=\"Windows Kernel Debugger Execution\"|extend RuleDescription=\"Detects execution of the Windows Kernel Debugger \\\"kd.exe\\\".\";\nlet q13=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\logman.exe\" or TargetProcessFilename =~ \"Logman.exe\") and (TargetProcessCommandLine contains \"stop \" or TargetProcessCommandLine contains \"delete \") and (TargetProcessCommandLine contains \"Circular Kernel Context Logger\" or TargetProcessCommandLine contains \"EventLog-\" or TargetProcessCommandLine contains \"SYSMON TRACE\" or TargetProcessCommandLine contains \"SysmonDnsEtwSession\"))|extend RuleId=\"cd1f961e-0b96-436b-b7c6-38da4583ec00\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_logman_disable_eventlog.yml\"|extend RuleTitle=\"Suspicious Windows Trace ETW Session Tamper Via Logman.EXE\"|extend RuleDescription=\"Detects the execution of \\\"logman\\\" utility in order to disable or delete Windows trace sessions\";\nlet q14=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\certoc.exe\" or TargetProcessFilename =~ \"CertOC.exe\") and TargetProcessCommandLine contains \"-GetCACAPS\")|extend RuleId=\"70ad0861-d1fe-491c-a45f-fa48148a300d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_certoc_download.yml\"|extend RuleTitle=\"Suspicious File Download via CertOC.exe\"|extend RuleDescription=\"Detects when a user downloads file by using CertOC.exe\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["PrivilegeEscalation", "Discovery", "InitialAccess", "Execution", "LateralMovement", "Persistence", "DefenseEvasion", "CredentialAccess", "CommandAndControl"],
                "techniques": ["T1046", "T1203", "T1003", "T1036", "T1562", "T1566", "T1070", "T1102", "T1105", "T1082", "T1087", "T1059", "T1505"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000210",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}