{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000105')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000105')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation low 05",
                "description": "Sigma Windows Process Creation low 05",
                "severity": "low",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"HH.exe\" or TargetProcessName endswith \"\\\\hh.exe\") and TargetProcessCommandLine contains \".chm\")|extend RuleId=\"68c8acb4-1b60-4890-8e82-3ddf7a6dba84\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hh_chm_execution.yml\"|extend RuleTitle=\"HH.EXE Execution\"|extend RuleDescription=\"Detects the usage of \\\"hh.exe\\\" to execute \\\".chm\\\" files.\";\nlet q1=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\ruby.exe\" and (TargetProcessCommandLine contains \"-i \" and TargetProcessCommandLine contains \"-u \" and TargetProcessCommandLine contains \"-p \"))|extend RuleId=\"a197e378-d31b-41c0-9635-cfdf1c1bb423\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_evil_winrm.yml\"|extend RuleTitle=\"HackTool - WinRM Access Via Evil-WinRM\"|extend RuleDescription=\"Adversaries may use Valid Accounts to log into a computer using the Remote Desktop Protocol (RDP). The adversary may then perform actions as the logged-on user.\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"impersonate.exe\" and (TargetProcessCommandLine contains \" list \" or TargetProcessCommandLine contains \" exec \" or TargetProcessCommandLine contains \" adduser \")) or ((TargetProcessIMPHASH=~\"MD5=9520714AB576B0ED01D1513691377D01\" or TargetProcessIMPHASH=~\"SHA256=E81CC96E2118DC4FBFE5BAD1604E0AC7681960143E2101E1A024D52264BB0A8A\" or TargetProcessIMPHASH=~\"0A358FFC1697B7A07D0E817AC740DF62\") or (TargetProcessMD5 =~ \"9520714AB576B0ED01D1513691377D01\" or TargetProcessSHA256 =~ \"E81CC96E2118DC4FBFE5BAD1604E0AC7681960143E2101E1A024D52264BB0A8A\" or TargetProcessIMPHASH =~ \"0A358FFC1697B7A07D0E817AC740DF62\")))|extend RuleId=\"cf0c254b-22f1-4b2b-8221-e137b3c0af94\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_impersonate.yml\"|extend RuleTitle=\"HackTool - Impersonate Execution\"|extend RuleDescription=\"Detects execution of the Impersonate tool. Which can be used to manipulate tokens on a Windows computers remotely (PsExec/WmiExec) or interactively\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"new-object\" and TargetProcessCommandLine contains \"text.encoding]::ascii\") and (TargetProcessCommandLine contains \"system.io.compression.deflatestream\" or TargetProcessCommandLine contains \"system.io.streamreader\" or TargetProcessCommandLine contains \"readtoend(\"))|extend RuleId=\"7eedcc9d-9fdb-4d94-9c54-474e8affc0c7\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_invoke_obfuscation_via_compress.yml\"|extend RuleTitle=\"Invoke-Obfuscation COMPRESS OBFUSCATION\"|extend RuleDescription=\"Detects Obfuscated Powershell via COMPRESS OBFUSCATION\";\nlet q4=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\cmd.exe\" and ActingProcessCommandLine endswith \".bat\") and ((TargetProcessName endswith \"\\\\xcopy.exe\" and (TargetProcessCommandLine contains \"powershell.exe\" and TargetProcessCommandLine contains \".bat.exe\")) or (TargetProcessName endswith \"\\\\xcopy.exe\" and (TargetProcessCommandLine contains \"pwsh.exe\" and TargetProcessCommandLine contains \".bat.exe\")) or (TargetProcessName endswith \"\\\\attrib.exe\" and (TargetProcessCommandLine contains \"+s\" and TargetProcessCommandLine contains \"+h\" and TargetProcessCommandLine contains \".bat.exe\"))))|extend RuleId=\"0a99eb3e-1617-41bd-b095-13dc767f3def\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_jlaive_batch_execution.yml\"|extend RuleTitle=\"HackTool - Jlaive In-Memory Assembly Execution\"|extend RuleDescription=\"Detects the use of Jlaive to execute assemblies in a copied PowerShell\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\SharpLDAPmonitor.exe\" or TargetProcessFilename =~ \"SharpLDAPmonitor.exe\") or (TargetProcessCommandLine contains \"/user:\" and TargetProcessCommandLine contains \"/pass:\" and TargetProcessCommandLine contains \"/dcip:\"))|extend RuleId=\"9f8fc146-1d1a-4dbf-b8fd-dfae15e08541\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_sharp_ldap_monitor.yml\"|extend RuleTitle=\"HackTool - SharpLDAPmonitor Execution\"|extend RuleDescription=\"Detects execution of the SharpLDAPmonitor. Which can monitor the creation, deletion and changes to LDAP objects.\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"/generic:Microsoft_Windows_Shell_ZipFolder:filename=\" and TargetProcessCommandLine contains \".zip\" and TargetProcessCommandLine contains \"/pass:\" and TargetProcessCommandLine contains \"/user:\") or (TargetProcessCommandLine contains \"/delete\" and TargetProcessCommandLine contains \"Microsoft_Windows_Shell_ZipFolder:filename=\" and TargetProcessCommandLine contains \".zip\"))|extend RuleId=\"90dcf730-1b71-4ae7-9ffc-6fcf62bd0132\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_zipexec.yml\"|extend RuleTitle=\"Suspicious ZipExec Execution\"|extend RuleDescription=\"ZipExec is a Proof-of-Concept (POC) tool to wrap binary-based tools into a password-protected zip file.\";\nlet q7=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"\u0410\" or TargetProcessCommandLine contains \"\u0412\" or TargetProcessCommandLine contains \"\u0415\" or TargetProcessCommandLine contains \"\u041a\" or TargetProcessCommandLine contains \"\u041c\" or TargetProcessCommandLine contains \"\u041d\" or TargetProcessCommandLine contains \"\u041e\" or TargetProcessCommandLine contains \"\u0420\" or TargetProcessCommandLine contains \"\u0421\" or TargetProcessCommandLine contains \"\u0422\" or TargetProcessCommandLine contains \"\u0425\" or TargetProcessCommandLine contains \"\u0405\" or TargetProcessCommandLine contains \"\u0406\" or TargetProcessCommandLine contains \"\u0408\" or TargetProcessCommandLine contains \"\u04ae\" or TargetProcessCommandLine contains \"\u04c0\" or TargetProcessCommandLine contains \"\u050c\" or TargetProcessCommandLine contains \"\u051a\" or TargetProcessCommandLine contains \"\u051c\" or TargetProcessCommandLine contains \"\u0391\" or TargetProcessCommandLine contains \"\u0392\" or TargetProcessCommandLine contains \"\u0395\" or TargetProcessCommandLine contains \"\u0396\" or TargetProcessCommandLine contains \"\u0397\" or TargetProcessCommandLine contains \"\u0399\" or TargetProcessCommandLine contains \"\u039a\" or TargetProcessCommandLine contains \"\u039c\" or TargetProcessCommandLine contains \"\u039d\" or TargetProcessCommandLine contains \"\u039f\" or TargetProcessCommandLine contains \"\u03a1\" or TargetProcessCommandLine contains \"\u03a4\" or TargetProcessCommandLine contains \"\u03a5\" or TargetProcessCommandLine contains \"\u03a7\") or (TargetProcessCommandLine contains \"\u0430\" or TargetProcessCommandLine contains \"\u0435\" or TargetProcessCommandLine contains \"\u043e\" or TargetProcessCommandLine contains \"\u0440\" or TargetProcessCommandLine contains \"\u0441\" or TargetProcessCommandLine contains \"\u0445\" or TargetProcessCommandLine contains \"\u0455\" or TargetProcessCommandLine contains \"\u0456\" or TargetProcessCommandLine contains \"\u04cf\" or TargetProcessCommandLine contains \"\u0458\" or TargetProcessCommandLine contains \"\u04bb\" or TargetProcessCommandLine contains \"\u0501\" or TargetProcessCommandLine contains \"\u051b\" or TargetProcessCommandLine contains \"\u051d\" or TargetProcessCommandLine contains \"\u03bf\"))|extend RuleId=\"32e280f1-8ad4-46ef-9e80-910657611fbc\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_homoglyph_cyrillic_lookalikes.yml\"|extend RuleTitle=\"Potential Homoglyph Attack Using Lookalike Characters\"|extend RuleDescription=\"Detects the presence of unicode characters which are homoglyphs, or identical in appearance, to ASCII letter characters.\\nThis is used as an obfuscation and masquerading techniques. Only \\\"perfect\\\" homoglyphs are included; these are characters that\\nare indistinguishable from ASCII characters and thus may make excellent candidates for homoglyph attack characters.\\n\";\nlet q8=_Im_ProcessCreate\n| where (TargetProcessName =~ \"hxtsr.exe\" and (not((TargetProcessCurrentDirectory startswith \"C:\\\\program files\\\\windowsapps\\\\microsoft.windowscommunicationsapps_\" and TargetProcessCurrentDirectory endswith \"\\\\hxtsr.exe\"))))|extend RuleId=\"4e762605-34a8-406d-b72e-c1a089313320\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hxtsr_masquerading.yml\"|extend RuleTitle=\"Fake Instance Of Hxtsr.exe\"|extend RuleDescription=\"HxTsr.exe is a Microsoft compressed executable file called Microsoft Outlook Communications.\\nHxTsr.exe is part of Outlook apps, because it resides in a hidden \\\"WindowsApps\\\" subfolder of \\\"C:\\\\Program Files\\\".\\nIts path includes a version number, e.g., \\\"C:\\\\Program Files\\\\WindowsApps\\\\microsoft.windowscommunicationsapps_17.7466.41167.0_x64__8wekyb3d8bbwe\\\\HxTsr.exe\\\".\\nAny instances of hxtsr.exe not in this folder may be malware camouflaging itself as HxTsr.exe\\n\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"iCACLS.EXE\" or TargetProcessName endswith \"\\\\icacls.exe\") and (TargetProcessCommandLine contains \"C:\\\\Users\\\\\" and TargetProcessCommandLine contains \"/deny\" and TargetProcessCommandLine contains \"S-1-1-0:\"))|extend RuleId=\"4ae81040-fc1c-4249-bfa3-938d260214d9\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_icacls_deny.yml\"|extend RuleTitle=\"Use Icacls to Hide File to Everyone\"|extend RuleDescription=\"Detect use of icacls to deny access for everyone in Users folder sometimes used to hide malicious files\";\nlet q10=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\appcmd.exe\" or TargetProcessFilename =~ \"appcmd.exe\") and ((TargetProcessCommandLine contains \"install\" and TargetProcessCommandLine contains \"module\") and (TargetProcessCommandLine contains \"/name:\" or TargetProcessCommandLine contains \"-name:\"))) and (not(ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\inetsrv\\\\iissetup.exe\")))|extend RuleId=\"9465ddf4-f9e4-4ebd-8d98-702df3a93239\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_iis_appcmd_susp_module_install.yml\"|extend RuleTitle=\"IIS Native-Code Module Command Line Installation\"|extend RuleDescription=\"Detects suspicious IIS native-code module installations via command line\";\nlet q11=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\appcmd.exe\" or TargetProcessFilename =~ \"appcmd.exe\") and (TargetProcessCommandLine contains \"set\" and TargetProcessCommandLine contains \"config\" and TargetProcessCommandLine contains \"section:system.webServer/rewrite/globalRules\" and TargetProcessCommandLine contains \"commit:\"))|extend RuleId=\"7c8af9b2-dcae-41a2-a9db-b28c288b5f08\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_iis_appcmd_susp_rewrite_rule.yml\"|extend RuleTitle=\"Suspicious IIS URL GlobalRules Rewrite Via AppCmd\"|extend RuleDescription=\"Detects usage of \\\"appcmd\\\" to create new global URL rewrite rules. This behaviour has been observed being used by threat actors to add new rules so they can access their webshells.\";\nlet q12=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"InfDefaultInstall.exe \" and TargetProcessCommandLine contains \".inf\")|extend RuleId=\"ce7cf472-6fcc-490a-9481-3786840b5d9b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_infdefaultinstall_execute_sct_scripts.yml\"|extend RuleTitle=\"InfDefaultInstall.exe .inf Execution\"|extend RuleDescription=\"Executes SCT script using scrobj.dll from a command in entered into a specially prepared INF file.\";\nlet q13=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\InstallUtil.exe\" and TargetProcessName contains \"Microsoft.NET\\\\Framework\" and (TargetProcessCommandLine contains \"/logfile= \" and TargetProcessCommandLine contains \"/LogToConsole=false\"))|extend RuleId=\"d042284c-a296-4988-9be5-f424fadcc28c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_instalutil_no_log_execution.yml\"|extend RuleTitle=\"Suspicious Execution of InstallUtil Without Log\"|extend RuleDescription=\"Uses the .NET InstallUtil.exe application in order to execute image without log\";\nlet q14=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"transport=dt_socket,address=\" and (TargetProcessCommandLine contains \"jre1.\" or TargetProcessCommandLine contains \"jdk1.\")) and (not((TargetProcessCommandLine contains \"address=127.0.0.1\" or TargetProcessCommandLine contains \"address=localhost\"))))|extend RuleId=\"8f88e3f6-2a49-48f5-a5c4-2f7eedf78710\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_java_remote_debugging.yml\"|extend RuleTitle=\"Java Running with Remote Debugging\"|extend RuleDescription=\"Detects a JAVA process running with remote debugging allowing more than just localhost to connect\";\nlet q15=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\java.exe\" and (TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\")) and (not((ActingProcessName contains \"build\" and TargetProcessCommandLine contains \"build\"))))|extend RuleId=\"dff1e1cc-d3fd-47c8-bfc2-aeb878a754c0\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_java_susp_child_process_2.yml\"|extend RuleTitle=\"Shells Spawned by Java\"|extend RuleDescription=\"Detects shell spawned from Java host process, which could be a sign of exploitation (e.g. log4j exploitation)\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["PrivilegeEscalation", "Discovery", "InitialAccess", "Execution", "LateralMovement", "Persistence", "DefenseEvasion"],
                "techniques": ["T1027", "T1218", "T1203", "T1036", "T1021", "T1202", "T1564", "T1134", "T1505", "T1059"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000105",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}