{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000108')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000108')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation low 08",
                "description": "Sigma Windows Process Creation low 08",
                "severity": "low",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") or (TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\")) and (TargetProcessCommandLine contains \" use \" and TargetProcessCommandLine contains \"*:*\\\\*\" and TargetProcessCommandLine contains \"*/USER:* *\")) and (not(TargetProcessCommandLine endswith \" \")))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000107\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_use_password_plaintext.yml\";\nlet q1=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\Adobe Creative Cloud Experience\\\\libs\\\\node.exe\" and (not(TargetProcessCommandLine contains \"Adobe Creative Cloud Experience\\\\js\")))|extend RuleId=\"df1f26d3-bea7-4700-9ea2-ad3e990cf90e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_node_adobe_creative_cloud_abuse.yml\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessName contains \"\\\\nslookup.exe\" or TargetProcessFilename =~ \"\\\\nslookup.exe\") and ((ActingProcessName endswith \"\\\\powershell.exe\" or ActingProcessName endswith \"\\\\pwsh.exe\") and (TargetProcessCommandLine contains \" -q=txt \" or TargetProcessCommandLine contains \" -querytype=txt \")))|extend RuleId=\"1b3b01c7-84e9-4072-86e5-fc285a41ff23\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_nslookup_poweshell_download.yml\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\ntdsutil.exe\" or TargetProcessFilename =~ \"ntdsutil.exe\") and ((TargetProcessCommandLine contains \"snapshot\" and TargetProcessCommandLine contains \"mount \") or (TargetProcessCommandLine contains \"ac\" and TargetProcessCommandLine contains \" i\" and TargetProcessCommandLine contains \" ntds\")))|extend RuleId=\"a58353df-af43-4753-bad0-cd83ef35eef5\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_ntdsutil_susp_usage.yml\";\nlet q4=_Im_ProcessCreate\n| where TargetProcessName endswith \"\\\\ntdsutil.exe\"|extend RuleId=\"2afafd61-6aae-4df4-baed-139fa1f4c345\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_ntdsutil_usage.yml\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\odbcconf.exe\" or TargetProcessFilename =~ \"odbcconf.exe\") and (TargetProcessCommandLine contains \"INSTALLDRIVER \" and TargetProcessCommandLine contains \".dll\"))|extend RuleId=\"3f5491e2-8db8-496b-9e95-1029fce852d4\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_odbcconf_driver_install.yml\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\odbcconf.exe\" or TargetProcessFilename =~ \"odbcconf.exe\") and (TargetProcessCommandLine contains \"REGSVR \" and TargetProcessCommandLine contains \".dll\"))|extend RuleId=\"9f0a8bf3-a65b-440a-8c1e-5cb1547c8e70\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_odbcconf_register_dll_regsvr.yml\";\nlet q7=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\odbcconf.exe\" or TargetProcessFilename =~ \"odbcconf.exe\") and (TargetProcessCommandLine contains \" -f \" or TargetProcessCommandLine contains \" /f \") and TargetProcessCommandLine contains \".rsp\")|extend RuleId=\"5f03babb-12db-4eec-8c82-7b4cb5580868\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_odbcconf_response_file.yml\";\nlet q8=_Im_ProcessCreate\n| where ActingProcessName endswith \"\\\\odbcconf.exe\"|extend RuleId=\"8e3c7994-131e-4ba5-b6ea-804d49113a26\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_odbcconf_uncommon_child_process.yml\";\nlet q9=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\svchost.exe\" and (TargetProcessName endswith \"\\\\winword.exe\" or TargetProcessName endswith \"\\\\excel.exe\" or TargetProcessName endswith \"\\\\powerpnt.exe\" or TargetProcessName endswith \"\\\\msaccess.exe\" or TargetProcessName endswith \"\\\\mspub.exe\" or TargetProcessName endswith \"\\\\eqnedt32.exe\" or TargetProcessName endswith \"\\\\visio.exe\"))|extend RuleId=\"9bdaf1e9-fdef-443b-8081-4341b74a7e28\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_office_svchost_parent.yml\";\nlet q10=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\WINWORD.exe\" or TargetProcessFilename =~ \"WinWord.exe\") and (TargetProcessCommandLine contains \"/l \" and TargetProcessCommandLine contains \".dll\"))|extend RuleId=\"f7375e28-5c14-432f-b8d1-1db26c832df3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_office_winword_dll_load.yml\";\nlet q11=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\OfflineScannerShell.exe\" or TargetProcessFilename =~ \"OfflineScannerShell.exe\") and (not((TargetProcessCurrentDirectory =~ \"C:\\\\Program Files\\\\Windows Defender\\\\Offline\\\\\" or TargetProcessCurrentDirectory =~ \"\" or isnull(TargetProcessCurrentDirectory)))))|extend RuleId=\"02b18447-ea83-4b1b-8805-714a8a34546a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_offlinescannershell_mpclient_sideloading.yml\";\nlet q12=_Im_ProcessCreate\n| where (TargetProcessFileDescription =~ \"PDQ Deploy Console\" or TargetProcessFileProduct =~ \"PDQ Deploy\" or TargetProcessFileCompany =~ \"PDQ.com\" or TargetProcessFilename =~ \"PDQDeployConsole.exe\")|extend RuleId=\"d679950c-abb7-43a6-80fb-2a480c4fc450\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pdqdeploy_execution.yml\";\nlet q13=_Im_ProcessCreate\n| where (ActingProcessName contains \"PDQDeployRunner-\" and ((TargetProcessName endswith \"\\\\wscript.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\wmic.exe\" or TargetProcessName endswith \"\\\\msiexec.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\csc.exe\" or TargetProcessName endswith \"\\\\dllhost.exe\" or TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessName endswith \"\\\\scriptrunner.exe\" or TargetProcessName endswith \"\\\\bash.exe\" or TargetProcessName endswith \"\\\\wsl.exe\") or (TargetProcessName contains \"C:\\\\Users\\\\Public\\\\\" or TargetProcessName contains \"C:\\\\ProgramData\\\\\" or TargetProcessName contains \"C:\\\\Windows\\\\TEMP\\\\\" or TargetProcessName contains \"\\\\AppData\\\\Local\\\\Temp\") or (TargetProcessCommandLine contains \"iex \" or TargetProcessCommandLine contains \"Invoke-\" or TargetProcessCommandLine contains \"DownloadString\" or TargetProcessCommandLine contains \"http\" or TargetProcessCommandLine contains \" -enc \" or TargetProcessCommandLine contains \" -encodedcommand \" or TargetProcessCommandLine contains \"FromBase64String\" or TargetProcessCommandLine contains \" -decode \" or TargetProcessCommandLine contains \" -w hidden\")))|extend RuleId=\"12b8e9f5-96b2-41e1-9a42-8c6779a5c184\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pdqdeploy_runner_susp_children.yml\";\nlet q14=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\perl.exe\" or TargetProcessFilename =~ \"perl.exe\") and TargetProcessCommandLine contains \" -e\")|extend RuleId=\"f426547a-e0f7-441a-b63e-854ac5bdf54d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_perl_inline_command_execution.yml\";\nlet q15=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\php.exe\" or TargetProcessFilename =~ \"php.exe\") and TargetProcessCommandLine contains \" -r\")|extend RuleId=\"d81871ef-5738-47ab-9797-7a9c90cd4bfb\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_php_inline_command_execution.yml\";\nlet q16=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\pktmon.exe\" or TargetProcessFilename =~ \"PktMon.exe\")|extend RuleId=\"f956c7c1-0f60-4bc5-b7d7-b39ab3c08908\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pktmon_execution.yml\";\nlet q17=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\powercfg.exe\" or TargetProcessFilename =~ \"PowerCfg.exe\") and ((TargetProcessCommandLine contains \"/setacvalueindex \" and TargetProcessCommandLine contains \"SCHEME_CURRENT\" and TargetProcessCommandLine contains \"SUB_VIDEO\" and TargetProcessCommandLine contains \"VIDEOCONLOCK\") or (TargetProcessCommandLine contains \"-change \" and TargetProcessCommandLine contains \"-standby-timeout-\")))|extend RuleId=\"f8d6a15e-4bc8-4c27-8e5d-2b10f0b73e5b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powercfg_execution.yml\";\nlet q18=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and (TargetProcessCommandLine contains \"Import-Module \" or TargetProcessCommandLine contains \"ipmo \") and TargetProcessCommandLine contains \"Microsoft.ActiveDirectory.Management.dll\")|extend RuleId=\"70bc5215-526f-4477-963c-a47a5c9ebd12\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_active_directory_module_dll_import.yml\";\nlet q19=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and TargetProcessCommandLine contains \"Add-WindowsCapability\" and TargetProcessCommandLine contains \"OpenSSH.\")|extend RuleId=\"b36d01a3-ddaf-4804-be18-18a6247adfcd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_add_windows_capability.yml\";\nlet q20=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"if(0){{{0}}}' -f $(0 -as [char]) +\" or TargetProcessCommandLine contains \"#<NULL>\")|extend RuleId=\"92a974db-ab84-457f-9ec0-55db83d7a825\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_amsi_null_bits_bypass.yml\";\nlet q21=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"WindowsAudioDevice-Powershell-Cmdlet\" or TargetProcessCommandLine contains \"Toggle-AudioDevice\" or TargetProcessCommandLine contains \"Get-AudioDevice \" or TargetProcessCommandLine contains \"Set-AudioDevice \" or TargetProcessCommandLine contains \"Write-AudioDevice \")|extend RuleId=\"932fb0d8-692b-4b0f-a26e-5643a50fe7d6\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_audio_capture.yml\";\nlet q22=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"SyncInvoke \"|extend RuleId=\"a0459f02-ac51-4c09-b511-b8c9203fc429\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_cl_invocation.yml\";\nlet q23=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"LoadAssemblyFromPath \" or TargetProcessCommandLine contains \"LoadAssemblyFromNS \")|extend RuleId=\"c57872c7-614f-4d7f-a40d-b78c8df2d30d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_cl_loadassembly.yml\";\nlet q24=_Im_ProcessCreate\n| where (((ActingProcessName endswith \"\\\\powershell.exe\" or ActingProcessName endswith \"\\\\pwsh.exe\") and TargetProcessName endswith \"\\\\powershell.exe\" and TargetProcessCommandLine contains \" -nologo -windowstyle minimized -file \") and (TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\Temp\\\\\"))|extend RuleId=\"1e0e1a81-e79b-44bc-935b-ddb9c8006b3d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_cl_mutexverifiers.yml\";\nlet q25=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and TargetProcessCommandLine contains \"ConvertTo-SecureString\")|extend RuleId=\"74403157-20f5-415d-89a7-c505779585cf\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_cmdline_convertto_securestring.yml\";\nlet q26=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and ((TargetProcessCommandLine contains \"Get-ADComputer \" and TargetProcessCommandLine contains \" -Filter \\*\") and (TargetProcessCommandLine contains \" > \" or TargetProcessCommandLine contains \" | Select \" or TargetProcessCommandLine contains \"Out-File\" or TargetProcessCommandLine contains \"Set-Content\" or TargetProcessCommandLine contains \"Add-Content\")))|extend RuleId=\"435e10e4-992a-4281-96f3-38b11106adde\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_computer_discovery_get_adcomputer.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19, q20, q21, q22, q23, q24, q25, q26;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Collection", "DefenseEvasion", "Impact", "Persistence", "InitialAccess", "PrivilegeEscalation", "Execution", "Reconnaissance", "Discovery", "LateralMovement", "CredentialAccess"],
                "techniques": ["T1216", "T1562", "T1059", "T1202", "T1127", "T1040", "T1218", "T1003", "T1027", "T1021", "T1033", "T1078", "T1072", "T1123"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000108",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}