{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000245')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000245')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 45",
                "description": "Sigma Windows Process Creation medium 45",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \"wmic\" and TargetProcessCommandLine contains \"product where \" and TargetProcessCommandLine contains \"call\" and TargetProcessCommandLine contains \"uninstall\" and TargetProcessCommandLine contains \"/nointeractive\") or ((TargetProcessCommandLine contains \"wmic\" and TargetProcessCommandLine contains \"caption like \") and (TargetProcessCommandLine contains \"call delete\" or TargetProcessCommandLine contains \"call terminate\")) or (TargetProcessCommandLine contains \"process \" and TargetProcessCommandLine contains \"where \" and TargetProcessCommandLine contains \"delete\")) and (TargetProcessCommandLine contains \"%carbon%\" or TargetProcessCommandLine contains \"%cylance%\" or TargetProcessCommandLine contains \"%endpoint%\" or TargetProcessCommandLine contains \"%eset%\" or TargetProcessCommandLine contains \"%malware%\" or TargetProcessCommandLine contains \"%Sophos%\" or TargetProcessCommandLine contains \"%symantec%\" or TargetProcessCommandLine contains \"Antivirus\" or TargetProcessCommandLine contains \"AVG \" or TargetProcessCommandLine contains \"Carbon Black\" or TargetProcessCommandLine contains \"CarbonBlack\" or TargetProcessCommandLine contains \"Cb Defense Sensor 64-bit\" or TargetProcessCommandLine contains \"Crowdstrike Sensor\" or TargetProcessCommandLine contains \"Cylance \" or TargetProcessCommandLine contains \"Dell Threat Defense\" or TargetProcessCommandLine contains \"DLP Endpoint\" or TargetProcessCommandLine contains \"Endpoint Detection\" or TargetProcessCommandLine contains \"Endpoint Protection\" or TargetProcessCommandLine contains \"Endpoint Security\" or TargetProcessCommandLine contains \"Endpoint Sensor\" or TargetProcessCommandLine contains \"ESET File Security\" or TargetProcessCommandLine contains \"LogRhythm System Monitor Service\" or TargetProcessCommandLine contains \"Malwarebytes\" or TargetProcessCommandLine contains \"McAfee Agent\" or TargetProcessCommandLine contains \"Microsoft Security Client\" or TargetProcessCommandLine contains \"Sophos Anti-Virus\" or TargetProcessCommandLine contains \"Sophos AutoUpdate\" or TargetProcessCommandLine contains \"Sophos Credential Store\" or TargetProcessCommandLine contains \"Sophos Management Console\" or TargetProcessCommandLine contains \"Sophos Management Database\" or TargetProcessCommandLine contains \"Sophos Management Server\" or TargetProcessCommandLine contains \"Sophos Remote Management System\" or TargetProcessCommandLine contains \"Sophos Update Manager\" or TargetProcessCommandLine contains \"Threat Protection\" or TargetProcessCommandLine contains \"VirusScan\" or TargetProcessCommandLine contains \"Webroot SecureAnywhere\" or TargetProcessCommandLine contains \"Windows Defender\"))|extend RuleId=\"847d5ff3-8a31-4737-a970-aeae8fe21765\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wmic_uninstall_security_products.yml\"|extend RuleTitle=\"Potential Tampering With Security Products Via WMIC\"|extend RuleDescription=\"Detects uninstallation or termination of security products using the WMIC utility\";\nlet q1=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\wbem\\\\WmiPrvSE.exe\" and ((TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\msiexec.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\verclsid.exe\" or TargetProcessName endswith \"\\\\wscript.exe\") or (TargetProcessName endswith \"\\\\cmd.exe\" and (TargetProcessCommandLine contains \"cscript\" or TargetProcessCommandLine contains \"mshta\" or TargetProcessCommandLine contains \"powershell\" or TargetProcessCommandLine contains \"pwsh\" or TargetProcessCommandLine contains \"regsvr32\" or TargetProcessCommandLine contains \"rundll32\" or TargetProcessCommandLine contains \"wscript\"))) and (not((TargetProcessName endswith \"\\\\WerFault.exe\" or TargetProcessName endswith \"\\\\WmiPrvSE.exe\"))))|extend RuleId=\"8a582fe2-0882-4b89-a82a-da6b2dc32937\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wmiprvse_susp_child_processes.yml\"|extend RuleTitle=\"Suspicious WmiPrvSE Child Process\"|extend RuleDescription=\"Detects suspicious and uncommon child processes of WmiPrvSE\";\nlet q2=_Im_ProcessCreate\n| where TargetProcessName =~ \"C:\\\\Windows\\\\System32\\\\wpbbin.exe\"|extend RuleId=\"4abc0ec4-db5a-412f-9632-26659cddf145\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wpbbin_potential_persistence.yml\"|extend RuleTitle=\"UEFI Persistence Via Wpbbin - ProcessCreation\"|extend RuleDescription=\"Detects execution of the binary \\\"wpbbin\\\" which is used as part of the UEFI based persistence method described in the reference section\";\nlet q3=_Im_ProcessCreate\n| where (((TargetProcessFilename =~ \"wscript.exe\" or TargetProcessFilename =~ \"cscript.exe\") or (TargetProcessName endswith \"\\\\wscript.exe\" or TargetProcessName endswith \"\\\\cscript.exe\")) and (TargetProcessCommandLine contains \".csv\" or TargetProcessCommandLine contains \".dat\" or TargetProcessCommandLine contains \".doc\" or TargetProcessCommandLine contains \".gif\" or TargetProcessCommandLine contains \".jpeg\" or TargetProcessCommandLine contains \".jpg\" or TargetProcessCommandLine contains \".png\" or TargetProcessCommandLine contains \".ppt\" or TargetProcessCommandLine contains \".txt\" or TargetProcessCommandLine contains \".xls\" or TargetProcessCommandLine contains \".xml\"))|extend RuleId=\"99b7460d-c9f1-40d7-a316-1f36f61d52ee\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wscript_cscript_uncommon_extension_exec.yml\"|extend RuleTitle=\"Cscript/Wscript Uncommon Script Extension Execution\"|extend RuleDescription=\"Detects Wscript/Cscript executing a file with an uncommon (i.e. non-script) extension\";\nlet q4=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\wuauclt.exe\" or TargetProcessFilename =~ \"wuauclt.exe\") and (TargetProcessCommandLine contains \"/UpdateDeploymentProvider\" and TargetProcessCommandLine contains \"/RunHandlerComServer\" and TargetProcessCommandLine contains \".dll\")) and (not((TargetProcessCommandLine contains \" /ClassId \" or TargetProcessCommandLine contains \" wuaueng.dll \"))))|extend RuleId=\"d7825193-b70a-48a4-b992-8b5b3015cc11\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wuauclt_execution.yml\"|extend RuleTitle=\"Windows Update Client LOLBIN\"|extend RuleDescription=\"Detects code execution via the Windows Update client (wuauclt)\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\Wuauclt.exe\" or TargetProcessFilename =~ \"Wuauclt.exe\") and TargetProcessCommandLine endswith \"\\\\Wuauclt.exe\")|extend RuleId=\"52d097e2-063e-4c9c-8fbb-855c8948d135\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wuauclt_no_cli_flags_execution.yml\"|extend RuleTitle=\"Suspicious Windows Update Agent Empty Cmdline\"|extend RuleDescription=\"Detects suspicious Windows Update Agent activity in which a wuauclt.exe process command line doesn't contain any command line flags\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\wusa.exe\" and TargetProcessCommandLine contains \"/extract:\") and (TargetProcessCommandLine contains \"C:\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \"\\\\Desktop\\\\\" or TargetProcessCommandLine contains \"\\\\Downloads\\\\\" or TargetProcessCommandLine contains \"\\\\Appdata\\\\Local\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\PerfLogs\\\\\"))|extend RuleId=\"c74c0390-3e20-41fd-a69a-128f0275a5ea\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wusa_cab_files_extraction_from_susp_paths.yml\"|extend RuleTitle=\"Wusa Extracting Cab Files From Suspicious Paths\"|extend RuleDescription=\"Detects usage of the \\\"wusa.exe\\\" (Windows Update Standalone Installer) utility to extract cab using the \\\"/extract\\\" argument from suspicious paths\";\nunion q0, q1, q2, q3, q4, q5, q6;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "CommandAndControl", "Execution", "Persistence"],
                "techniques": ["T1059", "T1542", "T1204", "T1105", "T1218", "T1562", "T1047", "T1036"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000245",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}