{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000000')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000000')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation low 00",
                "description": "Sigma Windows Process Creation informational 00",
                "severity": "informational",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\attrib.exe\" or TargetProcessFilename =~ \"ATTRIB.EXE\") and TargetProcessCommandLine contains \" +s \")|extend RuleId=\"bb19e94c-59ae-4c15-8c12-c563d23fe52b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_attrib_system.yml\";\nlet q1=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\clip.exe\" or TargetProcessFilename =~ \"clip.exe\")|extend RuleId=\"ddeff553-5233-4ae9-bbab-d64d2bd634be\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_clip_execution.yml\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessFilename =~ \"Cmd.Exe\") and TargetProcessCommandLine contains \"assoc\")|extend RuleId=\"3d3aa6cd-6272-44d6-8afc-7e88dfef7061\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmd_assoc_execution.yml\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessFilename =~ \"Cmd.Exe\") and (TargetProcessCommandLine contains \"del \" or TargetProcessCommandLine contains \"erase \") and (TargetProcessCommandLine contains \" /f\" or TargetProcessCommandLine contains \" /s\" or TargetProcessCommandLine contains \" /q\"))|extend RuleId=\"379fa130-190e-4c3f-b7bc-6c8e834485f3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmd_del_execution.yml\";\nlet q4=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"dir \" and TargetProcessCommandLine contains \" /s\" and TargetProcessCommandLine contains \" /b\")|extend RuleId=\"7c9340a9-e2ee-4e43-94c5-c54ebbea1006\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmd_dir_execution.yml\";\nlet q5=_Im_ProcessCreate\n| where (((TargetProcessFilename =~ \"Cmd.Exe\" or TargetProcessName endswith \"\\\\cmd.exe\") and TargetProcessCommandLine contains \">\") and (not((TargetProcessCommandLine contains \"C:\\\\Program Files (x86)\\\\Internet Download Manager\\\\IDMMsgHost.exe\" or TargetProcessCommandLine contains \"chrome-extension://\" or TargetProcessCommandLine contains \"\\\\.\\\\pipe\\\\chrome.nativeMessaging\"))))|extend RuleId=\"4f4eaa9f-5ad4-410c-a4be-bc6132b0175a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmd_redirect.yml\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessFilename =~ \"Cmd.Exe\") and TargetProcessCommandLine contains \"rmdir\" and (TargetProcessCommandLine contains \"/s\" or TargetProcessCommandLine contains \"/q\"))|extend RuleId=\"41ca393d-538c-408a-ac27-cf1e038be80c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmd_rmdir_execution.yml\";\nlet q7=_Im_ProcessCreate\n| where (TargetProcessFilename =~ \"DirLister.exe\" or TargetProcessName endswith \"\\\\dirlister.exe\")|extend RuleId=\"b4dc61f5-6cce-468e-a608-b48b469feaa2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_dirlister_execution.yml\";\nlet q8=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\explorer.exe\" and ActingProcessName endswith \"\\\\cmd.exe\" and TargetProcessCommandLine contains \"explorer.exe\")|extend RuleId=\"9eb271b9-24ae-4cd4-9465-19cfc1047f3e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_explorer_lolbin_execution.yml\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\fsutil.exe\" or TargetProcessFilename =~ \"fsutil.exe\") and TargetProcessCommandLine contains \"drives\")|extend RuleId=\"63de06b9-a385-40b5-8b32-73f2b9ef84b6\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_fsutil_drive_enumeration.yml\";\nlet q10=_Im_ProcessCreate\n| where TargetProcessName endswith \"\\\\HOSTNAME.EXE\"|extend RuleId=\"7be5fb68-f9ef-476d-8b51-0256ebece19e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hostname_execution.yml\";\nlet q11=_Im_ProcessCreate\n| where ActingProcessName endswith \"\\\\pcwrun.exe\"|extend RuleId=\"b97cd4b1-30b8-4a9d-bd72-6293928d52bc\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_pcwrun.yml\";\nlet q12=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\mstsc.exe\" or TargetProcessFilename =~ \"mstsc.exe\") and (TargetProcessCommandLine endswith \".rdp\" or TargetProcessCommandLine endswith \".rdp\\\"\")) and (not((ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\lxss\\\\wslhost.exe\" and TargetProcessCommandLine contains \"C:\\\\ProgramData\\\\Microsoft\\\\WSL\\\\wslg.rdp\"))))|extend RuleId=\"5fdce3ac-e7f9-4ecd-a3aa-a4d78ebbf0af\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_mstsc_run_local_rdp_file.yml\";\nlet q13=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\netsh.exe\" or TargetProcessFilename =~ \"netsh.exe\") and ((TargetProcessCommandLine contains \"netsh \" and TargetProcessCommandLine contains \"show \" and TargetProcessCommandLine contains \"firewall \") and (TargetProcessCommandLine contains \"config \" or TargetProcessCommandLine contains \"state \" or TargetProcessCommandLine contains \"rule \" or TargetProcessCommandLine contains \"name=all\")))|extend RuleId=\"0e4164da-94bc-450d-a7be-a4b176179f1f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_netsh_fw_rules_discovery.yml\";\nlet q14=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") or (TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\")) and ((TargetProcessCommandLine endswith \" use\" or TargetProcessCommandLine endswith \" sessions\") or (TargetProcessCommandLine contains \" use \" or TargetProcessCommandLine contains \" sessions \")))|extend RuleId=\"1c67a717-32ba-409b-a45d-0fb704a73a81\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_network_connections_discovery.yml\";\nlet q15=_Im_ProcessCreate\n| where ((((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") or (TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\")) and TargetProcessCommandLine contains \"view\") and (not(TargetProcessCommandLine contains \"\\\\\\\\\")))|extend RuleId=\"62510e69-616b-4078-b371-847da438cc03\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_share_and_sessions_enum.yml\";\nlet q16=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") or (TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\")) and (TargetProcessCommandLine contains \"share\" and TargetProcessCommandLine contains \"/delete\"))|extend RuleId=\"cb7c4a03-2871-43c0-9bbb-18bbdb079896\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_share_unmount.yml\";\nlet q17=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") or (TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\")) and TargetProcessCommandLine contains \" start \")|extend RuleId=\"2a072a96-a086-49fa-bcb5-15cc5a619093\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_start_service.yml\";\nlet q18=_Im_ProcessCreate\n| where (((TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\") or (TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\")) and TargetProcessCommandLine contains \" stop \")|extend RuleId=\"88872991-7445-4a22-90b2-a3adadb0e827\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_stop_service.yml\";\nlet q19=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") or (TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\")) and (TargetProcessCommandLine contains \" group\" or TargetProcessCommandLine contains \" localgroup\" or TargetProcessCommandLine contains \" user\" or TargetProcessCommandLine contains \" view\" or TargetProcessCommandLine contains \" share\" or TargetProcessCommandLine contains \" accounts\" or TargetProcessCommandLine contains \" stop \" or TargetProcessCommandLine contains \" start\"))|extend RuleId=\"183e7ea8-ac4b-4c23-9aec-b3dac4e401ac\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_susp_execution.yml\";\nlet q20=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") or (TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\")) and (TargetProcessCommandLine contains \" use \" or TargetProcessCommandLine contains \" \\\\\\\\\"))|extend RuleId=\"f117933c-980c-4f78-b384-e3d838111165\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_use_mount_share.yml\";\nlet q21=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\nltest.exe\" or TargetProcessFilename =~ \"nltestrk.exe\")|extend RuleId=\"903076ff-f442-475a-b667-4f246bcc203b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_nltest_execution.yml\";\nlet q22=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"New-Service\" and TargetProcessCommandLine contains \"-BinaryPathName\")|extend RuleId=\"c02e96b7-c63a-4c47-bd83-4a9f74afcfb2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_create_service.yml\";\nlet q23=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and (((TargetProcessCommandLine contains \"ToInt\" or TargetProcessCommandLine contains \"ToDecimal\" or TargetProcessCommandLine contains \"ToByte\" or TargetProcessCommandLine contains \"ToUint\" or TargetProcessCommandLine contains \"ToSingle\" or TargetProcessCommandLine contains \"ToSByte\") and (TargetProcessCommandLine contains \"ToChar\" or TargetProcessCommandLine contains \"ToString\" or TargetProcessCommandLine contains \"String\")) or ((TargetProcessCommandLine contains \"char\" and TargetProcessCommandLine contains \"join\") or (TargetProcessCommandLine contains \"split\" and TargetProcessCommandLine contains \"join\"))))|extend RuleId=\"cdf05894-89e7-4ead-b2b0-0a5f97a90f2f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_encoding_patterns.yml\";\nlet q24=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and (not(((ActingProcessName endswith \":\\\\Windows\\\\explorer.exe\" or ActingProcessName endswith \":\\\\Windows\\\\System32\\\\CompatTelRunner.exe\" or ActingProcessName endswith \":\\\\Windows\\\\SysWOW64\\\\explorer.exe\") or ActingProcessName =~ \":\\\\$WINDOWS.~BT\\\\Sources\\\\SetupHost.exe\"))) and (not(((ActingProcessName endswith \"\\\\AppData\\\\Local\\\\Programs\\\\Microsoft VS Code\\\\Code.exe\" and ActingProcessCommandLine contains \" --ms-enable-electron-run-as-node \") or (ActingProcessName contains \":\\\\Program Files\\\\WindowsApps\\\\Microsoft.WindowsTerminal_\" and ActingProcessName endswith \"\\\\WindowsTerminal.exe\")))))|extend RuleId=\"f4bbd493-b796-416e-bbf2-121235348529\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_non_interactive_execution.yml\";\nlet q25=_Im_ProcessCreate\n| where (((TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\") or (TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\")) and TargetProcessCommandLine contains \"Stop-Service \")|extend RuleId=\"c49c5062-0966-4170-9efd-9968c913a6cf\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_stop_service.yml\";\nlet q26=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\python.exe\" and TargetProcessCommandLine contains \"adidnsdump\")|extend RuleId=\"26d3f0a2-f514-4a3f-a8a7-e7e48a8d9160\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_python_adidnsdump.yml\";\nlet q27=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\rar.exe\" and TargetProcessCommandLine contains \" a \")|extend RuleId=\"6f3e2987-db24-4c78-a860-b4f4095a7095\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rar_compress_data.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19, q20, q21, q22, q23, q24, q25, q26, q27;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["PrivilegeEscalation", "LateralMovement", "Impact", "Discovery", "CommandAndControl", "DefenseEvasion", "Collection", "Persistence", "Execution"],
                "techniques": ["T1018", "T1083", "T1087", "T1070", "T1115", "T1482", "T1007", "T1560", "T1217", "T1218", "T1543", "T1564", "T1546", "T1059", "T1120", "T1027", "T1049", "T1219", "T1016", "T1135", "T1021", "T1082", "T1201", "T1569", "T1069", "T1489"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000000",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}