{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-4c76-45a9-804d-dc3f355f1001')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-4c76-45a9-804d-dc3f355f1001')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 001",
                "description": "Sigma Windows Process Creation medium 001",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessFilename =~ \"CertUtil.exe\") and (TargetProcessCommandLine contains \"urlcache \" or TargetProcessCommandLine contains \"verifyctl \") and TargetProcessCommandLine contains \"http\")|extend RuleId=\"19b08b1c-861d-4e75-a1ef-ea0c1baf202b\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessFilename =~ \"CertUtil.exe\") and (TargetProcessCommandLine contains \"-encode\" or TargetProcessCommandLine contains \"/encode\"))|extend RuleId=\"e62a9f0c-ca1e-46b2-85d5-a6da77f86d1a\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessFilename =~ \"CertUtil.exe\") and (TargetProcessCommandLine contains \"-exportPFX \" or TargetProcessCommandLine contains \"/exportPFX \"))|extend RuleId=\"3ffd6f51-e6c1-47b7-94b4-c1e61d4117c5\";\nlet q3=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\cmd.exe\" and (ActingProcessCommandLine contains \" /c \" or ActingProcessCommandLine contains \" /r \" or ActingProcessCommandLine contains \" /k \") and TargetProcessName endswith \"\\\\chcp.com\" and (TargetProcessCommandLine endswith \"chcp\" or TargetProcessCommandLine endswith \"chcp \" or TargetProcessCommandLine endswith \"chcp  \"))|extend RuleId=\"7090adee-82e2-4269-bd59-80691e7c6338\";\nlet q4=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\chcp.com\" and (TargetProcessCommandLine endswith \" 936\" or TargetProcessCommandLine endswith \" 1258\"))|extend RuleId=\"c7942406-33dd-4377-a564-0f62db0593a3\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"CIPHER.EXE\" or TargetProcessName endswith \"\\\\cipher.exe\") and TargetProcessCommandLine contains \" /w:\")|extend RuleId=\"4b046706-5789-4673-b111-66f25fe99534\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \" tunnel \" and TargetProcessCommandLine contains \"cleanup \") and (TargetProcessCommandLine contains \" --config \" or TargetProcessCommandLine contains \" --connector-id \"))|extend RuleId=\"7050bba1-1aed-454e-8f73-3f46f09ce56a\";\nlet q7=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \" tunnel \" and TargetProcessCommandLine contains \" run \") and (TargetProcessCommandLine contains \" --config \" or TargetProcessCommandLine contains \" --credentials-contents \" or TargetProcessCommandLine contains \" --credentials-file \" or TargetProcessCommandLine contains \" --token \"))|extend RuleId=\"9a019ffc-3580-4c9d-8d87-079f7e8d3fd4\";\nlet q8=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\cmdkey.exe\" or TargetProcessFilename =~ \"cmdkey.exe\") and (TargetProcessCommandLine contains \" /g\" and TargetProcessCommandLine contains \" /u\" and TargetProcessCommandLine contains \" /p\"))|extend RuleId=\"b1ec66c6-f4d1-4b5c-96dd-af28ccae7727\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessFilename =~ \"Cmd.Exe\") and (TargetProcessCommandLine contains \"del \" or TargetProcessCommandLine contains \"erase \") and (TargetProcessCommandLine contains \"\\\\*.au3\" or TargetProcessCommandLine contains \"\\\\*.dll\" or TargetProcessCommandLine contains \"\\\\*.exe\" or TargetProcessCommandLine contains \"\\\\*.js\"))|extend RuleId=\"204b17ae-4007-471b-917b-b917b315c5db\";\nlet q10=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"^^\" or TargetProcessCommandLine contains \"^|^\" or TargetProcessCommandLine contains \",;,\" or TargetProcessCommandLine contains \";;;;\" or TargetProcessCommandLine contains \";; ;;\" or TargetProcessCommandLine contains \"(,(,\" or TargetProcessCommandLine contains \"%COMSPEC:~\" or TargetProcessCommandLine contains \" c^m^d\" or TargetProcessCommandLine contains \"^c^m^d\" or TargetProcessCommandLine contains \" c^md\" or TargetProcessCommandLine contains \" cm^d\" or TargetProcessCommandLine contains \"^cm^d\" or TargetProcessCommandLine contains \" s^et \" or TargetProcessCommandLine contains \" s^e^t \" or TargetProcessCommandLine contains \" se^t \")|extend RuleId=\"a77c1610-fc73-4019-8e29-0f51efc04a51\";\nlet q11=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\cmd.exe\" and (TargetProcessCommandLine contains \"http\" and TargetProcessCommandLine contains \"://\" and TargetProcessCommandLine contains \"%AppData%\"))|extend RuleId=\"1ac8666b-046f-4201-8aba-1951aaec03a3\";\nlet q12=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessFilename =~ \"Cmd.Exe\") and ((TargetProcessCommandLine contains \" -n \" or TargetProcessCommandLine contains \" /n \") and (TargetProcessCommandLine contains \"ping\" and TargetProcessCommandLine contains \"copy \" and TargetProcessCommandLine contains \" /y \")))|extend RuleId=\"ded2b07a-d12f-4284-9b76-653e37b6c8b0\";\nlet q13=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessFilename =~ \"Cmd.Exe\") and ((TargetProcessCommandLine contains \"> \\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \"> %APPDATA%\\\\\" or TargetProcessCommandLine contains \"> %TEMP%\\\\\" or TargetProcessCommandLine contains \"> %TMP%\\\\\" or TargetProcessCommandLine contains \"> %USERPROFILE%\\\\\" or TargetProcessCommandLine contains \"> C:\\\\Temp\\\\\" or TargetProcessCommandLine contains \"> C:\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \"> C:\\\\Windows\\\\Temp\\\\\" or TargetProcessCommandLine contains \">\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \">%APPDATA%\\\\\" or TargetProcessCommandLine contains \">%TEMP%\\\\\" or TargetProcessCommandLine contains \">%TMP%\\\\\" or TargetProcessCommandLine contains \">%USERPROFILE%\\\\\" or TargetProcessCommandLine contains \">C:\\\\Temp\\\\\" or TargetProcessCommandLine contains \">C:\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \">C:\\\\Windows\\\\Temp\\\\\") or ((TargetProcessCommandLine contains \" >\" or TargetProcessCommandLine contains \"\\\">\" or TargetProcessCommandLine contains \"'>\") and (TargetProcessCommandLine contains \"C:\\\\Users\\\\\" and TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\\"))))|extend RuleId=\"8e0bb260-d4b2-4fff-bb8d-3f82118e6892\";\nlet q14=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"Cmd.Exe\" or TargetProcessName endswith \"\\\\cmd.exe\") and TargetProcessCommandLine contains \"<\")|extend RuleId=\"241e802a-b65e-484f-88cd-c2dc10f9206d\";\nlet q15=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\cmd.exe\" and (ActingProcessName endswith \"\\\\csrss.exe\" or ActingProcessName endswith \"\\\\ctfmon.exe\" or ActingProcessName endswith \"\\\\dllhost.exe\" or ActingProcessName endswith \"\\\\epad.exe\" or ActingProcessName endswith \"\\\\FlashPlayerUpdateService.exe\" or ActingProcessName endswith \"\\\\GoogleUpdate.exe\" or ActingProcessName endswith \"\\\\jucheck.exe\" or ActingProcessName endswith \"\\\\jusched.exe\" or ActingProcessName endswith \"\\\\LogonUI.exe\" or ActingProcessName endswith \"\\\\lsass.exe\" or ActingProcessName endswith \"\\\\regsvr32.exe\" or ActingProcessName endswith \"\\\\SearchIndexer.exe\" or ActingProcessName endswith \"\\\\SearchProtocolHost.exe\" or ActingProcessName endswith \"\\\\SIHClient.exe\" or ActingProcessName endswith \"\\\\sihost.exe\" or ActingProcessName endswith \"\\\\slui.exe\" or ActingProcessName endswith \"\\\\spoolsv.exe\" or ActingProcessName endswith \"\\\\sppsvc.exe\" or ActingProcessName endswith \"\\\\taskhostw.exe\" or ActingProcessName endswith \"\\\\unsecapp.exe\" or ActingProcessName endswith \"\\\\WerFault.exe\" or ActingProcessName endswith \"\\\\wergmgr.exe\" or ActingProcessName endswith \"\\\\wlanext.exe\" or ActingProcessName endswith \"\\\\WUDFHost.exe\"))|extend RuleId=\"4b991083-3d0e-44ce-8fc4-b254025d8d4b\";\nlet q16=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\conhost.exe\" and (not((Provider_Name =~ \"SystemTraceProvider-Process\" or (Provider_Name =~ \"Microsoft-Windows-Kernel-Process\" and TargetProcessName endswith \"\\\\git.exe\" and (ActingProcessCommandLine contains \" show --textconv \" or ActingProcessCommandLine contains \" cat-file -s \")) or (ActingProcessCommandLine contains \"C:\\\\WINDOWS\\\\system32\\\\conhost.exe 0x4\" and (TargetProcessCommandLine contains \" show --textconv \" or TargetProcessCommandLine contains \" cat-file -s \")) or (Provider_Name =~ \"Microsoft-Windows-Kernel-Process\" and (ActingProcessCommandLine contains \" cat-file -s \" or ActingProcessCommandLine contains \"show --textconv\") and TargetProcessName =~ \"C:\\\\Windows\\\\System32\\\\conhost.exe\") or ((ActingProcessCommandLine =~ \"\\\\??\\\\C:\\\\WINDOWS\\\\system32\\\\conhost.exe 0x4\" or ActingProcessCommandLine =~ \"\\\\??\\\\C:\\\\WINDOWS\\\\system32\\\\conhost.exe 0xffffffff -ForceV1\") and TargetProcessName =~ \"C:\\\\Windows\\\\System32\\\\conhost.exe\") or ((ActingProcessCommandLine =~ \"\\\\??\\\\C:\\\\WINDOWS\\\\system32\\\\conhost.exe 0xffffffff -ForceV1'\" or ActingProcessCommandLine =~ \"\\\\??\\\\C:\\\\WINDOWS\\\\system32\\\\conhost.exe 0x4'\") and TargetProcessName =~ \"C:\\\\Program Files\\\\Git\\\\mingw64\\\\bin\\\\git.exe\")))))|extend RuleId=\"7dc2dedd-7603-461a-bc13-15803d132355\";\nlet q17=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\conhost.exe\" and (ActingProcessName endswith \"\\\\explorer.exe\" or ActingProcessName endswith \"\\\\lsass.exe\" or ActingProcessName endswith \"\\\\regsvr32.exe\" or ActingProcessName endswith \"\\\\rundll32.exe\" or ActingProcessName endswith \"\\\\services.exe\" or ActingProcessName endswith \"\\\\smss.exe\" or ActingProcessName endswith \"\\\\spoolsv.exe\" or ActingProcessName endswith \"\\\\svchost.exe\" or ActingProcessName endswith \"\\\\userinit.exe\" or ActingProcessName endswith \"\\\\wininit.exe\" or ActingProcessName endswith \"\\\\winlogon.exe\")) and (not((ActingProcessCommandLine contains \"-k apphost -s AppHostSvc\" or ActingProcessCommandLine contains \"-k imgsvc\" or ActingProcessCommandLine contains \"-k localService -p -s RemoteRegistry\" or ActingProcessCommandLine contains \"-k LocalSystemNetworkRestricted -p -s NgcSvc\" or ActingProcessCommandLine contains \"-k NetSvcs -p -s NcaSvc\" or ActingProcessCommandLine contains \"-k netsvcs -p -s NetSetupSvc\" or ActingProcessCommandLine contains \"-k netsvcs -p -s wlidsvc\" or ActingProcessCommandLine contains \"-k NetworkService -p -s DoSvc\" or ActingProcessCommandLine contains \"-k wsappx -p -s AppXSvc\" or ActingProcessCommandLine contains \"-k wsappx -p -s ClipSVC\"))) and (not((ActingProcessCommandLine contains \"C:\\\\Program Files (x86)\\\\Dropbox\\\\Client\\\\\" or ActingProcessCommandLine contains \"C:\\\\Program Files\\\\Dropbox\\\\Client\\\\\"))))|extend RuleId=\"cbb9e3d1-2386-4e59-912e-62f1484f7a89\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Impact", "Discovery", "CredentialAccess", "DefenseEvasion", "Execution", "CommandAndControl"],
                "techniques": ["T1102", "T1218", "T1614", "T1070", "T1485", "T1003", "T1105", "T1059", "T1036", "T1090", "T1027", "T1572", "T1202"],
                "alertRuleTemplateName": "5163A000-4c76-45a9-804d-dc3f355f1001",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}