{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000230')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000230')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 30",
                "description": "Sigma Windows Process Creation medium 30",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessFilename =~ \"RUNDLL32.EXE\") and (not((isnull(TargetProcessCommandLine) or (TargetProcessCommandLine contains \".dll\" or TargetProcessCommandLine =~ \"\") or TargetProcessCommandLine startswith \"C:\\\\Windows\\\\system32\\\\rundll32.exe C:\\\\Windows\\\\system32\\\\inetcpl.cpl,ClearMyTracksByProcess\" or (ActingProcessName endswith \":\\\\Program Files\\\\Internet Explorer\\\\iexplore.exe\" and TargetProcessCommandLine contains \".cpl\") or (ActingProcessName endswith \":\\\\Windows\\\\SysWOW64\\\\msiexec.exe\" and ActingProcessCommandLine startswith \"C:\\\\Windows\\\\syswow64\\\\MsiExec.exe -Embedding\") or (ActingProcessName endswith \":\\\\Windows\\\\System32\\\\msiexec.exe\" and ActingProcessCommandLine startswith \"C:\\\\Windows\\\\system32\\\\MsiExec.exe -Embedding\") or (ActingProcessName endswith \":\\\\Windows\\\\System32\\\\cmd.exe\" and ActingProcessCommandLine contains \" C:\\\\Program Files\\\\SplunkUniversalForwarder\\\\\") or TargetProcessCommandLine contains \" -localserver \" or (ActingProcessCommandLine startswith \"C:\\\\Windows\\\\system32\\\\rundll32.exe\\\" \\\"C:\\\\Program Files\\\\McAfee\\\\MSC\\\\mcmscins.dll\\\",DllUninstallFunction \" or TargetProcessCommandLine startswith \"C:\\\\Windows\\\\system32\\\\rundll32.exe\\\" /uninstall /longpath \\\"C:\\\\Program Files\\\\McAfee\\\\MSC\\\\mscrem.inf\") or (ActingProcessName startswith \"C:\\\\Users\\\\\" and ActingProcessName contains \"\\\\AppData\\\\Local\\\\Microsoft\\\\EdgeUpdate\\\\Install\\\\{\" and ActingProcessName endswith \"\\\\setup.exe\") or ((TargetProcessCommandLine contains \"C:\\\\Windows\\\\Installer\\\\MSI\" and TargetProcessCommandLine contains \".tmp\" and TargetProcessCommandLine contains \"zzzzInvokeManagedCustomActionOutOfProc\") and (TargetProcessCommandLine contains \"Avira.OE.Setup\" or TargetProcessCommandLine contains \"FindOldJetBrainsProduct\"))))))|extend RuleId=\"c3a99af4-35a9-4668-879e-c09aeb4f2bdf\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_executable_invalid_extension.yml\"|extend RuleTitle=\"Rundll32 Execution Without DLL File\"|extend RuleDescription=\"\"Detects the execution of rundll32 with a command line that doesn't contain a .dll file\"\";\nlet q1=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"rundll32.exe\" and TargetProcessCommandLine contains \"Execute\" and TargetProcessCommandLine contains \"RegRead\" and TargetProcessCommandLine contains \"window.close\")|extend RuleId=\"1cc50f3f-1fc8-4acf-b2e9-6f172e1fdebd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_inline_vbs.yml\"|extend RuleTitle=\"Suspicious Rundll32 Invoking Inline VBScript\"|extend RuleDescription=\"\"Detects suspicious process related to rundll32 based on command line that invokes inline VBScript as seen being used by UNC2452\"\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"rundll32\" and TargetProcessCommandLine contains \"javascript\" and TargetProcessCommandLine contains \"..\\\\..\\\\mshtml,RunHTMLApplication\") or TargetProcessCommandLine contains \";document.write();GetObject(\\\"script\")|extend RuleId=\"9f06447a-a33a-4cbe-a94f-a3f43184a7a3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_js_runhtmlapplication.yml\"|extend RuleTitle=\"Rundll32 JS RunHTMLApplication Pattern\"|extend RuleDescription=\"\"Detects suspicious command line patterns used when rundll32 is used to run JavaScript code\"\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessFilename =~ \"RUNDLL32.EXE\") and (TargetProcessCommandLine contains \"keymgr\" and TargetProcessCommandLine contains \"KRShowKeyMgr\"))|extend RuleId=\"a4694263-59a8-4608-a3a0-6f8d3a51664c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_keymgr.yml\"|extend RuleTitle=\"Suspicious Key Manager Access\"|extend RuleDescription=\"\"Detects the invocation of the Stored User Names and Passwords dialogue (Key Manager)\"\";\nlet q4=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"\\\\..\\\\\" and TargetProcessCommandLine contains \"mshtml\" and TargetProcessCommandLine contains \"RunHTMLApplication\")|extend RuleId=\"4782eb5a-a513-4523-a0ac-f3082b26ac5c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_mshtml_runhtmlapplication.yml\"|extend RuleTitle=\"Mshtml DLL RunHTMLApplication Abuse\"|extend RuleDescription=\"\"Detects suspicious command line using the \\\"mshtml.dll\\\" RunHTMLApplication export to run arbitrary code via different protocol handlers (vbscript, javascript, file, htpp...)\"\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessCommandLine endswith \"\\\\rundll32.exe\" or TargetProcessCommandLine endswith \"\\\\rundll32.exe\\\"\" or TargetProcessCommandLine endswith \"\\\\rundll32\") and (not((ActingProcessName contains \"\\\\AppData\\\\Local\\\\\" or ActingProcessName contains \"\\\\Microsoft\\\\Edge\\\\\"))))|extend RuleId=\"1775e15e-b61b-4d14-a1a3-80981298085a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_no_params.yml\"|extend RuleTitle=\"Rundll32 Execution Without CommandLine Parameters\"|extend RuleDescription=\"\"Detects suspicious start of rundll32.exe without any parameters as found in CobaltStrike beacon activity\"\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessFilename =~ \"RUNDLL32.EXE\") and ((TargetProcessCommandLine contains \"C:\\\\windows\\\\system32\\\\davclnt.dll,DavSetCookie\" and TargetProcessCommandLine contains \"http\") and (TargetProcessCommandLine contains \"spoolss\" or TargetProcessCommandLine contains \"srvsvc\" or TargetProcessCommandLine contains \"/print/pipe/\")))|extend RuleId=\"bb76d96b-821c-47cf-944b-7ce377864492\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_ntlmrelay.yml\"|extend RuleTitle=\"Suspicious NTLM Authentication on the Printer Spooler Service\"|extend RuleDescription=\"\"Detects a privilege elevation attempt by coercing NTLM authentication on the Printer Spooler service\"\";\nlet q7=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessFilename =~ \"RUNDLL32.EXE\" or TargetProcessCommandLine contains \"rundll32\") and ((TargetProcessCommandLine contains \"comsvcs\" and TargetProcessCommandLine contains \"full\") and (TargetProcessCommandLine contains \"#-\" or TargetProcessCommandLine contains \"#+\" or TargetProcessCommandLine contains \"#24\" or TargetProcessCommandLine contains \"24 \" or TargetProcessCommandLine contains \"MiniDump\"))) or ((TargetProcessCommandLine contains \"24\" and TargetProcessCommandLine contains \"comsvcs\" and TargetProcessCommandLine contains \"full\") and (TargetProcessCommandLine contains \" #\" or TargetProcessCommandLine contains \",#\" or TargetProcessCommandLine contains \", #\")))|extend RuleId=\"646ea171-dded-4578-8a4d-65e9822892e3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_process_dump_via_comsvcs.yml\"|extend RuleTitle=\"Process Memory Dump Via Comsvcs.DLL\"|extend RuleDescription=\"\"Detects a process memory dump via \\\"comsvcs.dll\\\" using rundll32, covering multiple different techniques (ordinal, minidump function, etc.)\"\";\nlet q8=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessFilename =~ \"RUNDLL32.EXE\") and ((TargetProcessCommandLine contains \"-sta \" or TargetProcessCommandLine contains \"-localserver \") and (TargetProcessCommandLine contains \"{\" and TargetProcessCommandLine contains \"}\")))|extend RuleId=\"f1edd233-30b5-4823-9e6a-c4171b24d316\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_registered_com_objects.yml\"|extend RuleTitle=\"Rundll32 Registered COM Objects\"|extend RuleDescription=\"\"load malicious registered COM objects\"\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessFilename =~ \"RUNDLL32.EXE\") and ((TargetProcessCommandLine contains \"shell32.dll\" and TargetProcessCommandLine contains \"Control_RunDLL\") and (TargetProcessCommandLine contains \"%AppData%\" or TargetProcessCommandLine contains \"%LocalAppData%\" or TargetProcessCommandLine contains \"%Temp%\" or TargetProcessCommandLine contains \"%tmp%\" or TargetProcessCommandLine contains \"\\\\AppData\\\\\" or TargetProcessCommandLine contains \"\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\Users\\\\Public\\\\\")))|extend RuleId=\"32b96012-7892-429e-b26c-ac2bf46066ff\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_shell32_susp_execution.yml\"|extend RuleTitle=\"Shell32 DLL Execution in Suspicious Directory\"|extend RuleDescription=\"\"Detects shell32.dll executing a DLL in a suspicious directory\"\";\nlet q10=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\rundll32.exe\" and TargetProcessName endswith \"\\\\explorer.exe\") and (not(ActingProcessCommandLine contains \"\\\\shell32.dll,Control_RunDLL\")))|extend RuleId=\"caa06de8-fdef-4c91-826a-7f9e163eef4b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_spawn_explorer.yml\"|extend RuleTitle=\"RunDLL32 Spawning Explorer\"|extend RuleDescription=\"\"Detects RunDLL32.exe spawning explorer.exe as child, which is very uncommon, often observes Gamarue spawning the explorer.exe process in an unusual way\"\";\nlet q11=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\System32\\\\control.exe\" and (TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessFilename =~ \"RUNDLL32.EXE\")) and (not(TargetProcessCommandLine contains \"Shell32.dll\")))|extend RuleId=\"d7eb979b-c2b5-4a6f-a3a7-c87ce6763819\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_susp_control_dll_load.yml\"|extend RuleTitle=\"Suspicious Control Panel DLL Load\"|extend RuleDescription=\"\"Detects suspicious Rundll32 execution from control.exe as used by Equation Group and Exploit Kits\"\";\nlet q12=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessFilename =~ \"RUNDLL32.exe\") and (TargetProcessCommandLine contains \".bmp\" or TargetProcessCommandLine contains \".cr2\" or TargetProcessCommandLine contains \".eps\" or TargetProcessCommandLine contains \".gif\" or TargetProcessCommandLine contains \".ico\" or TargetProcessCommandLine contains \".jpeg\" or TargetProcessCommandLine contains \".jpg\" or TargetProcessCommandLine contains \".nef\" or TargetProcessCommandLine contains \".orf\" or TargetProcessCommandLine contains \".png\" or TargetProcessCommandLine contains \".raw\" or TargetProcessCommandLine contains \".sr2\" or TargetProcessCommandLine contains \".tif\" or TargetProcessCommandLine contains \".tiff\"))|extend RuleId=\"4aa6040b-3f28-44e3-a769-9208e5feb5ec\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_susp_execution_with_image_extension.yml\"|extend RuleTitle=\"Suspicious Rundll32 Execution With Image Extension\"|extend RuleDescription=\"\"Detects the execution of Rundll32.exe with DLL files masquerading as image files\"\";\nlet q13=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"ShellExec_RunDLL\" and (TargetProcessCommandLine contains \"regsvr32\" or TargetProcessCommandLine contains \"msiexec\" or TargetProcessCommandLine contains \"\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \"odbcconf\" or TargetProcessCommandLine contains \"\\\\Desktop\\\\\" or TargetProcessCommandLine contains \"\\\\Temp\\\\\" or TargetProcessCommandLine contains \"Invoke-\" or TargetProcessCommandLine contains \"iex\" or TargetProcessCommandLine contains \"comspec\"))|extend RuleId=\"d87bd452-6da1-456e-8155-7dc988157b7d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_susp_shellexec_execution.yml\"|extend RuleTitle=\"Suspicious Usage Of ShellExec_RunDLL\"|extend RuleDescription=\"\"Detects suspicious usage of the ShellExec_RunDLL function to launch other commands as seen in the the raspberry-robin attack\"\";\nlet q14=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \"rundll32\" and TargetProcessCommandLine contains \"apphelp.dll\") and (TargetProcessCommandLine contains \"ShimFlushCache\" or TargetProcessCommandLine contains \"#250\")) or ((TargetProcessCommandLine contains \"rundll32\" and TargetProcessCommandLine contains \"kernel32.dll\") and (TargetProcessCommandLine contains \"BaseFlushAppcompatCache\" or TargetProcessCommandLine contains \"#46\")))|extend RuleId=\"b0524451-19af-4efa-a46f-562a977f792e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_susp_shimcache_flush.yml\"|extend RuleTitle=\"ShimCache Flush\"|extend RuleDescription=\"\"Detects actions that clear the local ShimCache and remove forensic evidence\"\";\nlet q15=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"rundll32.exe\" and (TargetProcessCommandLine contains \".sys,\" or TargetProcessCommandLine contains \".sys \"))|extend RuleId=\"731231b9-0b5d-4219-94dd-abb6959aa7ea\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_sys.yml\"|extend RuleTitle=\"Suspicious Rundll32 Activity Invoking Sys File\"|extend RuleDescription=\"\"Detects suspicious process related to rundll32 based on command line that includes a *.sys file as seen being used by UNC2452\"\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Persistence", "DefenseEvasion", "CredentialAccess", "PrivilegeEscalation", "Execution"],
                "techniques": ["T1055", "T1003", "T1036", "T1555", "T1546", "T1112", "T1202", "T1218", "T1212"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000230",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}