{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000220')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000220')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 20",
                "description": "Sigma Windows Process Creation medium 20",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"--config \" and TargetProcessCommandLine contains \"--no-check-certificate \" and TargetProcessCommandLine contains \" copy \") or ((TargetProcessName endswith \"\\\\rclone.exe\" or TargetProcessFileDescription =~ \"Rsync for cloud storage\") and (TargetProcessCommandLine contains \"pass\" or TargetProcessCommandLine contains \"user\" or TargetProcessCommandLine contains \"copy\" or TargetProcessCommandLine contains \"sync\" or TargetProcessCommandLine contains \"config\" or TargetProcessCommandLine contains \"lsd\" or TargetProcessCommandLine contains \"remote\" or TargetProcessCommandLine contains \"ls\" or TargetProcessCommandLine contains \"mega\" or TargetProcessCommandLine contains \"pcloud\" or TargetProcessCommandLine contains \"ftp\" or TargetProcessCommandLine contains \"ignore-existing\" or TargetProcessCommandLine contains \"auto-confirm\" or TargetProcessCommandLine contains \"transfers\" or TargetProcessCommandLine contains \"multi-thread-streams\" or TargetProcessCommandLine contains \"no-check-certificate \")))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000219\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_rclone_execution.yml\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \" /account=system \" or TargetProcessCommandLine contains \" /account=ti \") and TargetProcessCommandLine contains \"/exec=\")|extend RuleId=\"93199800-b52a-4dec-b762-75212c196542\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_runxcmd.yml\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\Seatbelt.exe\" or TargetProcessFilename =~ \"Seatbelt.exe\" or TargetProcessFileDescription =~ \"Seatbelt\" or (TargetProcessCommandLine contains \" DpapiMasterKeys\" or TargetProcessCommandLine contains \" InterestingProcesses\" or TargetProcessCommandLine contains \" InterestingFiles\" or TargetProcessCommandLine contains \" CertificateThumbprints\" or TargetProcessCommandLine contains \" ChromiumBookmarks\" or TargetProcessCommandLine contains \" ChromiumHistory\" or TargetProcessCommandLine contains \" ChromiumPresence\" or TargetProcessCommandLine contains \" CloudCredentials\" or TargetProcessCommandLine contains \" CredEnum\" or TargetProcessCommandLine contains \" CredGuard\" or TargetProcessCommandLine contains \" FirefoxHistory\" or TargetProcessCommandLine contains \" ProcessCreationEvents\")) or ((TargetProcessCommandLine contains \" -group=misc\" or TargetProcessCommandLine contains \" -group=remote\" or TargetProcessCommandLine contains \" -group=chromium\" or TargetProcessCommandLine contains \" -group=slack\" or TargetProcessCommandLine contains \" -group=system\" or TargetProcessCommandLine contains \" -group=user\" or TargetProcessCommandLine contains \" -group=all\") and TargetProcessCommandLine contains \" -outputfile=\"))|extend RuleId=\"38646daa-e78f-4ace-9de0-55547b2d30da\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_seatbelt.yml\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\wsudo.exe\" or TargetProcessFilename =~ \"wsudo.exe\" or TargetProcessFileDescription =~ \"Windows sudo utility\" or ActingProcessName endswith \"\\\\wsudo-bridge.exe\") or (TargetProcessCommandLine contains \"-u System\" or TargetProcessCommandLine contains \"-uSystem\" or TargetProcessCommandLine contains \"-u TrustedInstaller\" or TargetProcessCommandLine contains \"-uTrustedInstaller\" or TargetProcessCommandLine contains \" --ti \"))|extend RuleId=\"bdeeabc9-ff2a-4a51-be59-bb253aac7891\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_wsudo_susp_execution.yml\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"python.exe\" or TargetProcessName endswith \"python3.exe\" or TargetProcessName endswith \"python2.exe\") and ((TargetProcessCommandLine contains \"import pty\" and TargetProcessCommandLine contains \".spawn(\") or TargetProcessCommandLine contains \"from pty import spawn\"))|extend RuleId=\"480e7e51-e797-47e3-8d72-ebfce65b6d8d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_python_pty_spawn.yml\";\nlet q5=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \" -hp\" and (TargetProcessCommandLine contains \" -m\" or TargetProcessCommandLine contains \" a \"))|extend RuleId=\"faa48cae-6b25-4f00-a094-08947fef582f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rar_compression_with_password.yml\";\nlet q6=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\rar.exe\" or TargetProcessFileDescription =~ \"Command line RAR\") or (TargetProcessCommandLine contains \".exe a \" or TargetProcessCommandLine contains \" a -m\")) and ((TargetProcessCommandLine contains \" -hp\" and TargetProcessCommandLine contains \" -r \") and (TargetProcessCommandLine contains \" C:\\\\\\*.\" or TargetProcessCommandLine contains \" C:\\\\\\\\\\*.\" or TargetProcessCommandLine contains \" C:\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \" %public%\" or TargetProcessCommandLine contains \" C:\\\\Windows\\\\\" or TargetProcessCommandLine contains \" C:\\\\PerfLogs\\\\\" or TargetProcessCommandLine contains \" C:\\\\Temp\" or TargetProcessCommandLine contains \" C:\\\\$Recycle.bin\\\\\")))|extend RuleId=\"afe52666-401e-4a02-b4ff-5d128990b8cb\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rar_susp_greedy_compression.yml\";\nlet q7=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \"fullmemdmp\" or TargetProcessCommandLine contains \"/memdmp\" or TargetProcessCommandLine contains \"-memdmp\") and (TargetProcessCommandLine contains \" -o \" or TargetProcessCommandLine contains \" /o \") and (TargetProcessCommandLine contains \" -p \" or TargetProcessCommandLine contains \" /p \")) or ((TargetProcessName endswith \"\\\\rdrleakdiag.exe\" or TargetProcessFilename =~ \"RdrLeakDiag.exe\") and (TargetProcessCommandLine contains \"fullmemdmp\" or TargetProcessCommandLine contains \"/memdmp\" or TargetProcessCommandLine contains \"-memdmp\")))|extend RuleId=\"edadb1e5-5919-4e4c-8462-a9e643b02c4b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rdrleakdiag_process_dumping.yml\";\nlet q8=_Im_ProcessCreate\n| where ((((TargetProcessName endswith \"\\\\Regsvcs.exe\" or TargetProcessName endswith \"\\\\Regasm.exe\") or (TargetProcessFilename =~ \"RegSvcs.exe\" or TargetProcessFilename =~ \"RegAsm.exe\")) and (TargetProcessCommandLine contains \"\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\Desktop\\\\\" or TargetProcessCommandLine contains \"\\\\Downloads\\\\\" or TargetProcessCommandLine contains \"\\\\PerfLogs\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\Microsoft\\\\Windows\\\\Start Menu\\\\Programs\\\\Startup\\\\\")) or (((TargetProcessName endswith \"\\\\Regsvcs.exe\" or TargetProcessName endswith \"\\\\Regasm.exe\") or (TargetProcessFilename =~ \"RegSvcs.exe\" or TargetProcessFilename =~ \"RegAsm.exe\")) and (not((TargetProcessCommandLine contains \".dll\" or (TargetProcessCommandLine endswith \"\\\\Regasm.exe\\\"\" or TargetProcessCommandLine endswith \"\\\\Regasm.exe\" or TargetProcessCommandLine endswith \"\\\\Regsvcs.exe\\\"\" or TargetProcessCommandLine endswith \"\\\\Regsvcs.exe\"))))))|extend RuleId=\"cc368ed0-2411-45dc-a222-510ace303cb2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_regasm_suspicious_execution.yml\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\regedit.exe\" or TargetProcessFilename =~ \"REGEDIT.EXE\") and (TargetProcessCommandLine contains \" /E \" or TargetProcessCommandLine contains \" -E \") and (TargetProcessCommandLine contains \"hklm\" or TargetProcessCommandLine contains \"hkey_local_machine\") and (TargetProcessCommandLine endswith \"\\\\system\" or TargetProcessCommandLine endswith \"\\\\sam\" or TargetProcessCommandLine endswith \"\\\\security\"))|extend RuleId=\"82880171-b475-4201-b811-e9c826cd5eaa\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_regedit_export_critical_keys.yml\";\nlet q10=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\regedit.exe\" or TargetProcessFilename =~ \"REGEDIT.EXE\") and ((TargetProcessCommandLine contains \" /i \" or TargetProcessCommandLine contains \".reg\") and TargetProcessCommandLine matches regex \":[^ \\\\\\\\]\")) and (not((TargetProcessCommandLine contains \" /e \" or TargetProcessCommandLine contains \" /a \" or TargetProcessCommandLine contains \" /c \" or TargetProcessCommandLine contains \" -e \" or TargetProcessCommandLine contains \" -a \" or TargetProcessCommandLine contains \" -c \"))))|extend RuleId=\"0b80ade5-6997-4b1d-99a1-71701778ea61\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_regedit_import_keys_ads.yml\";\nlet q11=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\regedit.exe\" and (ActingProcessName endswith \"\\\\TrustedInstaller.exe\" or ActingProcessName endswith \"\\\\ProcessHacker.exe\"))|extend RuleId=\"883835a7-df45-43e4-bf1d-4268768afda4\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_regedit_trustedinstaller.yml\";\nlet q12=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\regini.exe\" or TargetProcessFilename =~ \"REGINI.EXE\") and TargetProcessCommandLine matches regex \":[^ \\\\\\\\]\")|extend RuleId=\"77946e79-97f1-45a2-84b4-f37b5c0d8682\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_regini_ads.yml\";\nlet q13=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Internet Settings\\\\ZoneMap\\\\ProtocolDefaults\" and TargetProcessCommandLine contains \"http\" and TargetProcessCommandLine contains \" 0\")|extend RuleId=\"10344bb3-7f65-46c2-b915-2d00d47be5b0\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_registry_ie_security_zone_protocol_defaults_downgrade.yml\";\nlet q14=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"\\\\CurrentVersion\\\\Image File Execution Options\\\\\" and (TargetProcessCommandLine contains \"sethc.exe\" or TargetProcessCommandLine contains \"utilman.exe\" or TargetProcessCommandLine contains \"osk.exe\" or TargetProcessCommandLine contains \"magnify.exe\" or TargetProcessCommandLine contains \"narrator.exe\" or TargetProcessCommandLine contains \"displayswitch.exe\" or TargetProcessCommandLine contains \"atbroker.exe\" or TargetProcessCommandLine contains \"HelpPane.exe\"))|extend RuleId=\"ae215552-081e-44c7-805f-be16f975c8a2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_registry_install_reg_debugger_backdoor.yml\";\nlet q15=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"UserInitMprLogonScript\"|extend RuleId=\"21d856f9-9281-4ded-9377-51a1a6e2a432\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_registry_logon_script.yml\";\nlet q16=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"\\\\System\\\\CurrentControlSet\\\\Services\\\\\" and TargetProcessCommandLine contains \"\\\\NetworkProvider\")|extend RuleId=\"baef1ec6-2ca9-47a3-97cc-4cf2bda10b77\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_registry_new_network_provider.yml\";\nlet q17=_Im_ProcessCreate\n| where (TargetProcessIntegrityLevel =~ \"Medium\" and (TargetProcessCommandLine contains \"ControlSet\" and TargetProcessCommandLine contains \"services\") and (TargetProcessCommandLine contains \"\\\\ImagePath\" or TargetProcessCommandLine contains \"\\\\FailureCommand\" or TargetProcessCommandLine contains \"\\\\ServiceDll\"))|extend RuleId=\"0f9c21f1-6a73-4b0e-9809-cb562cb8d981\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_registry_privilege_escalation_via_service_key.yml\";\nlet q18=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"SOFTWARE\\\\Microsoft\\\\Provisioning\\\\Commands\\\\\"|extend RuleId=\"2a4b3e61-9d22-4e4a-b60f-6e8f0cde6f25\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_registry_provlaunch_provisioning_command.yml\";\nlet q19=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"\\\\ShellIds\\\\Microsoft.PowerShell\\\\ExecutionPolicy\" or TargetProcessCommandLine contains \"\\\\Policies\\\\Microsoft\\\\Windows\\\\PowerShell\\\\ExecutionPolicy\") and (TargetProcessCommandLine contains \"Bypass\" or TargetProcessCommandLine contains \"RemoteSigned\" or TargetProcessCommandLine contains \"Unrestricted\"))|extend RuleId=\"cf2e938e-9a3e-4fe8-a347-411642b28a9f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_registry_set_unsecure_powershell_policy.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Collection", "Persistence", "CredentialAccess", "PrivilegeEscalation", "Exfiltration", "Discovery", "DefenseEvasion", "Execution"],
                "techniques": ["T1560", "T1218", "T1087", "T1569", "T1012", "T1574", "T1112", "T1548", "T1546", "T1083", "T1526", "T1059", "T1037", "T1567", "T1003"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000220",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}