{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000110')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000110')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 10",
                "description": "Sigma Windows Process Creation low 10",
                "severity": "low",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (((ActingProcessName endswith \"\\\\wscript.exe\" or ActingProcessName endswith \"\\\\cscript.exe\") and (TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\")) and (not(TargetProcessCurrentDirectory contains \"\\\\Health Service State\\\\\")))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000109\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_script_engine_parent.yml\";\nlet q1=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \" -executionpolicy \" or TargetProcessCommandLine contains \" -ep \" or TargetProcessCommandLine contains \" -exec \") and (TargetProcessCommandLine contains \"Unrestricted\" or TargetProcessCommandLine contains \"bypass\" or TargetProcessCommandLine contains \"RemoteSigned\")) and (not((TargetProcessCommandLine contains \"C:\\\\Program Files\" or TargetProcessCommandLine contains \"C:\\\\ProgramData\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\Code\\\\\"))))|extend RuleId=\"87e3c4e8-a6a8-4ad9-bb4f-46e7ff99a180\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_set_policies_to_unsecure_level.yml\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessFilename =~ \"PowerShell.EXE\") and ((TargetProcessCommandLine contains \"Set-Service\" and TargetProcessCommandLine contains \"-StartupType\") and (TargetProcessCommandLine contains \"Disabled\" or TargetProcessCommandLine contains \"Manual\")))|extend RuleId=\"62b20d44-1546-4e61-afce-8e175eb9473c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_set_service_disabled.yml\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"powershell.exe\" or TargetProcessCommandLine contains \"\\\\powershell\" or TargetProcessCommandLine contains \"\\\\pwsh\" or TargetProcessCommandLine contains \"pwsh.exe\") and ((TargetProcessCommandLine contains \"/c \" and TargetProcessCommandLine contains \"\\\\AppData\\\\\") and (TargetProcessCommandLine contains \"Local\\\\\" or TargetProcessCommandLine contains \"Roaming\\\\\")))|extend RuleId=\"ac175779-025a-4f12-98b0-acdaeb77ea85\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_susp_ps_appdata.yml\";\nlet q4=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and ((TargetProcessCommandLine contains \"Get-ADUser \" and TargetProcessCommandLine contains \" -Filter *\") and (TargetProcessCommandLine contains \" > \" or TargetProcessCommandLine contains \" | Select \" or TargetProcessCommandLine contains \"Out-File\" or TargetProcessCommandLine contains \"Set-Content\" or TargetProcessCommandLine contains \"Add-Content\")))|extend RuleId=\"1114e048-b69c-4f41-bc20-657245ae6e3f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_user_discovery_get_aduser.yml\";\nlet q5=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"X509Enrollment.CBinaryConverter\" or TargetProcessCommandLine contains \"884e2002-217d-11da-b2a4-000e7bbb2b09\")|extend RuleId=\"114de787-4eb2-48cc-abdb-c0b449f93ea4\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_x509enrollment.yml\";\nlet q6=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\") or TargetProcessFileDescription =~ \"Windows PowerShell\" or TargetProcessFileProduct =~ \"PowerShell Core 6\") and TargetProcessCommandLine contains \"bxor\" and (TargetProcessCommandLine contains \"ForEach\" or TargetProcessCommandLine contains \"for(\" or TargetProcessCommandLine contains \"for \" or TargetProcessCommandLine contains \"-join \" or TargetProcessCommandLine contains \"-join'\" or TargetProcessCommandLine contains \"-join\\\"\" or TargetProcessCommandLine contains \"-join`\" or TargetProcessCommandLine contains \"::Join\" or TargetProcessCommandLine contains \"[char]\"))|extend RuleId=\"bb780e0c-16cf-4383-8383-1e5471db6cf9\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_xor_commandline.yml\";\nlet q7=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"Compress-Archive \" and TargetProcessCommandLine contains \" -Path \" and TargetProcessCommandLine contains \" -DestinationPath \" and TargetProcessCommandLine contains \"$env:TEMP\\\\\")|extend RuleId=\"85a8e5ba-bd03-4bfb-bbfa-a4409a8f8b98\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_zip_compress.yml\";\nlet q8=_Im_ProcessCreate\n| where ActingProcessName endswith \"\\\\Microsoft.NodejsTools.PressAnyKey.exe\"|extend RuleId=\"a20391f8-76fb-437b-abc0-dba2df1952c6\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pressanykey_lolbin_execution.yml\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\print.exe\" and TargetProcessCommandLine startswith \"print\" and (TargetProcessCommandLine contains \"/D\" and TargetProcessCommandLine contains \".exe\")) and (not(TargetProcessCommandLine contains \"print.exe\")))|extend RuleId=\"bafac3d6-7de9-4dd9-8874-4a1194b493ed\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_print_remote_file_copy.yml\";\nlet q10=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\provlaunch.exe\" and (not(((TargetProcessName endswith \"\\\\calc.exe\" or TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\notepad.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\wscript.exe\") or (TargetProcessName contains \":\\\\PerfLogs\\\\\" or TargetProcessName contains \":\\\\Temp\\\\\" or TargetProcessName contains \":\\\\Users\\\\Public\\\\\" or TargetProcessName contains \"\\\\AppData\\\\Temp\\\\\" or TargetProcessName contains \"\\\\Windows\\\\System32\\\\Tasks\\\\\" or TargetProcessName contains \"\\\\Windows\\\\Tasks\\\\\" or TargetProcessName contains \"\\\\Windows\\\\Temp\\\\\")))))|extend RuleId=\"7f5d1c9a-3e83-48df-95a7-2b98aae6c13c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_provlaunch_potential_abuse.yml\";\nlet q11=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\Psr.exe\" and TargetProcessCommandLine contains \"/start\")|extend RuleId=\"2158f96f-43c2-43cb-952a-ab4580f32382\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_psr_capture_screenshots.yml\";\nlet q12=_Im_ProcessCreate\n| where (TargetProcessFilename =~ \"AdvancedRun.exe\" or (TargetProcessCommandLine contains \" /EXEFilename \" and TargetProcessCommandLine contains \" /Run\") or (TargetProcessCommandLine contains \" /WindowState 0\" and TargetProcessCommandLine contains \" /RunAs \" and TargetProcessCommandLine contains \" /CommandLine \"))|extend RuleId=\"d2b749ee-4225-417e-b20e-a8d2193cbb84\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_advancedrun.yml\";\nlet q13=_Im_ProcessCreate\n| where ((TargetProcessName contains \"\\\\advanced_ip_scanner\" or TargetProcessFilename contains \"advanced_ip_scanner\" or TargetProcessFileDescription contains \"Advanced IP Scanner\") or (TargetProcessCommandLine contains \"/portable\" and TargetProcessCommandLine contains \"/lng\"))|extend RuleId=\"bef37fa2-f205-4a7b-b484-0759bfd5f86f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_advanced_ip_scanner.yml\";\nlet q14=_Im_ProcessCreate\n| where ((TargetProcessName contains \"\\\\advanced_port_scanner\" or TargetProcessFilename contains \"advanced_port_scanner\" or TargetProcessFileDescription contains \"Advanced Port Scanner\") or (TargetProcessCommandLine contains \"/portable\" and TargetProcessCommandLine contains \"/lng\"))|extend RuleId=\"54773c5f-f1cc-4703-9126-2f797d96a69d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_advanced_port_scanner.yml\";\nlet q15=_Im_ProcessCreate\n| where (TargetProcessFileProduct contains \"Mouse Lock\" or TargetProcessFileCompany contains \"Misc314\" or TargetProcessCommandLine contains \"Mouse Lock_\")|extend RuleId=\"c9192ad9-75e5-43eb-8647-82a0a5b493e3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_mouselock_execution.yml\";\nlet q16=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\NirCmd.exe\" or TargetProcessFilename =~ \"NirCmd.exe\") or (TargetProcessCommandLine contains \" execmd \" or TargetProcessCommandLine contains \".exe script \" or TargetProcessCommandLine contains \".exe shexec \" or TargetProcessCommandLine contains \" runinteractive \")) or ((TargetProcessCommandLine contains \" exec \" or TargetProcessCommandLine contains \" exec2 \") and (TargetProcessCommandLine contains \" show \" or TargetProcessCommandLine contains \" hide \")))|extend RuleId=\"4e2ed651-1906-4a59-a78a-18220fca1b22\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_nircmd.yml\";\nlet q17=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\rcedit-x64.exe\" or TargetProcessName endswith \"\\\\rcedit-x86.exe\") or TargetProcessFileDescription =~ \"Edit resources of exe\" or TargetProcessFileProduct =~ \"rcedit\") and TargetProcessCommandLine contains \"--set-\" and (TargetProcessCommandLine contains \"OriginalFileName\" or TargetProcessCommandLine contains \"CompanyName\" or TargetProcessCommandLine contains \"FileDescription\" or TargetProcessCommandLine contains \"ProductName\" or TargetProcessCommandLine contains \"ProductVersion\" or TargetProcessCommandLine contains \"LegalCopyright\"))|extend RuleId=\"0c92f2e6-f08f-4b73-9216-ecb0ca634689\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_rcedit_execution.yml\";\nlet q18=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\SystemInformer.exe\" or TargetProcessFilename =~ \"SystemInformer.exe\" or TargetProcessFileDescription =~ \"System Informer\" or TargetProcessFileProduct =~ \"System Informer\") or (Hashes contains \"MD5=19426363A37C03C3ED6FEDF57B6696EC\" or Hashes contains \"SHA1=8B12C6DA8FAC0D5E8AB999C31E5EA04AF32D53DC\" or Hashes contains \"SHA256=8EE9D84DE50803545937A63C686822388A3338497CDDB660D5D69CF68B68F287\" or Hashes contains \"IMPHASH=B68908ADAEB5D662F87F2528AF318F12\") or (md5 =~ \"19426363A37C03C3ED6FEDF57B6696EC\" or sha1 =~ \"8B12C6DA8FAC0D5E8AB999C31E5EA04AF32D53DC\" or sha256 =~ \"8EE9D84DE50803545937A63C686822388A3338497CDDB660D5D69CF68B68F287\" or TargetProcessIMPHASH =~ \"B68908ADAEB5D662F87F2528AF318F12\"))|extend RuleId=\"5722dff1-4bdd-4949-86ab-fbaf707e767a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_system_informer.yml\";\nlet q19=_Im_ProcessCreate\n| where (TargetProcessFileDescription =~ \"Web Browser Password Viewer\" or TargetProcessName endswith \"\\\\WebBrowserPassView.exe\")|extend RuleId=\"d0dae994-26c6-4d2d-83b5-b3c8b79ae513\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_webbrowserpassview.yml\";\nlet q20=_Im_ProcessCreate\n| where (((TargetProcessFilename =~ \"python.exe\" or (TargetProcessName endswith \"python.exe\" or TargetProcessName endswith \"python3.exe\" or TargetProcessName endswith \"python2.exe\")) and TargetProcessCommandLine contains \" -c\") and (not(((ActingProcessName startswith \"C:\\\\Program Files\\\\Python\" and ActingProcessName endswith \"\\\\python.exe\" and ActingProcessCommandLine contains \"-E -s -m ensurepip -U --default-pip\") or ActingProcessName endswith \"\\\\AppData\\\\Local\\\\Programs\\\\Microsoft VS Code\\\\Code.exe\"))))|extend RuleId=\"899133d5-4d7c-4a7f-94ee-27355c879d90\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_python_inline_command_execution.yml\";\nlet q21=_Im_ProcessCreate\n| where (TargetProcessName endswith \":\\\\Windows\\\\System32\\\\query.exe\" and (TargetProcessCommandLine contains \"session >\" or TargetProcessCommandLine contains \"process >\"))|extend RuleId=\"53ef0cef-fa24-4f25-a34a-6c72dfa2e6e2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_query_session_exfil.yml\";\nlet q22=_Im_ProcessCreate\n| where TargetProcessName endswith \"rasdial.exe\"|extend RuleId=\"6bba49bf-7f8c-47d6-a1bb-6b4dece4640e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rasdial_execution.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19, q20, q21, q22;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["PrivilegeEscalation", "CredentialAccess", "Discovery", "Persistence", "Execution", "Collection", "DefenseEvasion"],
                "techniques": ["T1033", "T1543", "T1113", "T1553", "T1036", "T1562", "T1555", "T1134", "T1074", "T1059", "T1027", "T1569", "T1218", "T1564", "T1056", "T1135", "T1082", "T1140", "T1046"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000110",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}