{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000235')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000235')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation high 35",
                "description": "Sigma Windows Process Creation medium 35",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\wgetexe\" or TargetProcessFilename =~ \"wgetexe\") and (TargetProcessCommandLine contains \"githubusercontentcom\" or TargetProcessCommandLine contains \"anonfilescom\" or TargetProcessCommandLine contains \"cdndiscordappcom\" or TargetProcessCommandLine contains \"cdndiscordappcom/attachments/\" or TargetProcessCommandLine contains \"ddnsnet\" or TargetProcessCommandLine contains \"dldropboxusercontentcom\" or TargetProcessCommandLine contains \"ghostbinco\" or TargetProcessCommandLine contains \"gofileio\" or TargetProcessCommandLine contains \"hastebincom\" or TargetProcessCommandLine contains \"mediafirecom\" or TargetProcessCommandLine contains \"meganz\" or TargetProcessCommandLine contains \"pasteee\" or TargetProcessCommandLine contains \"pastebincom\" or TargetProcessCommandLine contains \"pastebinpl\" or TargetProcessCommandLine contains \"pastetextnet\" or TargetProcessCommandLine contains \"privatlabcom\" or TargetProcessCommandLine contains \"privatlabnet\" or TargetProcessCommandLine contains \"sendexploitin\" or TargetProcessCommandLine contains \"sendspacecom\" or TargetProcessCommandLine contains \"storagegoogleapiscom\" or TargetProcessCommandLine contains \"storjshareio\" or TargetProcessCommandLine contains \"tempsh\" or TargetProcessCommandLine contains \"transfersh\" or TargetProcessCommandLine contains \"ufileio\") and TargetProcessCommandLine contains \"http\" and (TargetProcessCommandLine matches regex \"\\\\s-O\\\\s\" or TargetProcessCommandLine contains \"--output-document\") and (TargetProcessCommandLine endswith \"ps1\" or TargetProcessCommandLine endswith \"ps1'\" or TargetProcessCommandLine endswith \"ps1\\\"\" or TargetProcessCommandLine endswith \"dat\" or TargetProcessCommandLine endswith \"dat'\" or TargetProcessCommandLine endswith \"dat\\\"\" or TargetProcessCommandLine endswith \"msi\" or TargetProcessCommandLine endswith \"msi'\" or TargetProcessCommandLine endswith \"msi\\\"\" or TargetProcessCommandLine endswith \"bat\" or TargetProcessCommandLine endswith \"bat'\" or TargetProcessCommandLine endswith \"bat\\\"\" or TargetProcessCommandLine endswith \"exe\" or TargetProcessCommandLine endswith \"exe'\" or TargetProcessCommandLine endswith \"exe\\\"\" or TargetProcessCommandLine endswith \"vbs\" or TargetProcessCommandLine endswith \"vbs'\" or TargetProcessCommandLine endswith \"vbs\\\"\" or TargetProcessCommandLine endswith \"vbe\" or TargetProcessCommandLine endswith \"vbe'\" or TargetProcessCommandLine endswith \"vbe\\\"\" or TargetProcessCommandLine endswith \"hta\" or TargetProcessCommandLine endswith \"hta'\" or TargetProcessCommandLine endswith \"hta\\\"\" or TargetProcessCommandLine endswith \"dll\" or TargetProcessCommandLine endswith \"dll'\" or TargetProcessCommandLine endswith \"dll\\\"\" or TargetProcessCommandLine endswith \"psm1\" or TargetProcessCommandLine endswith \"psm1'\" or TargetProcessCommandLine endswith \"psm1\\\"\"))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000234\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wget_download_susp_file_sharing_domains.yml\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"whoamiexe\" or TargetProcessName endswith \"\\\\whoamiexe\") and (TargetUsername contains \"AUTHORI\" or TargetUsername contains \"AUTORI\" or TargetUsername contains \"TrustedInstaller\"))|extend RuleId=\"79ce34ca-af29-4d0e-b832-fc1b377020db\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_whoami_execution_from_high_priv_process.yml\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\whoamiexe\" or TargetProcessFilename =~ \"whoamiexe\") and (not(((ActingProcessName endswith \"\\\\cmdexe\" or ActingProcessName endswith \"\\\\powershellexe\" or ActingProcessName endswith \"\\\\pwshexe\" or ActingProcessName endswith \"\\\\powershell_iseexe\") or ActingProcessName =~ \"C:\\\\Program Files\\\\Microsoft Monitoring Agent\\\\Agent\\\\MonitoringHostexe\" or isnull(ActingProcessName) or ActingProcessName =~ \"\"))))|extend RuleId=\"8de1cbe8-d6f5-496d-8237-5f44a721c7a0\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_whoami_parent_anomaly.yml\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\whoamiexe\" or TargetProcessFilename =~ \"whoamiexe\") and (TargetProcessCommandLine contains \" /priv\" or TargetProcessCommandLine contains \" -priv\"))|extend RuleId=\"97a80ec7-0e2f-4d05-9ef4-65760e634f6b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_whoami_priv_discovery.yml\";\nlet q4=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\whoamiexe\" or TargetProcessFilename =~ \"whoamiexe\") and (TargetProcessCommandLine contains \" -all\" or TargetProcessCommandLine contains \" /all\" or TargetProcessCommandLine contains \" /FO CSV\" or TargetProcessCommandLine contains \" -FO CSV\")) or (TargetProcessCommandLine contains \"whoami\" and TargetProcessCommandLine contains \">\"))|extend RuleId=\"c30fb093-1109-4dc8-88a8-b30d11c95a5d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_whoami_susp_flags.yml\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\wingetexe\" or TargetProcessFilename =~ \"wingetexe\") and (TargetProcessCommandLine contains \"source \" and TargetProcessCommandLine contains \"add \" and TargetProcessCommandLine contains \"http://\"))|extend RuleId=\"81a0ecb5-0a41-4ba1-b2ba-c944eb92bfa2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_winget_add_insecure_custom_source.yml\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\wingetexe\" or TargetProcessFilename =~ \"wingetexe\") and (TargetProcessCommandLine contains \"source \" and TargetProcessCommandLine contains \"add \") and TargetProcessCommandLine matches regex \"://\\\\d{1,3}\\\\.\\\\d{1,3}\\\\.\\\\d{1,3}\\\\.\\\\d{1,3}\")|extend RuleId=\"c15a46a0-07d4-4c87-b4b6-89207835a83b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_winget_add_susp_custom_source.yml\";\nlet q7=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\wsmprovhostexe\" and (TargetProcessName endswith \"\\\\cmdexe\" or TargetProcessName endswith \"\\\\shexe\" or TargetProcessName endswith \"\\\\bashexe\" or TargetProcessName endswith \"\\\\powershellexe\" or TargetProcessName endswith \"\\\\pwshexe\" or TargetProcessName endswith \"\\\\wslexe\" or TargetProcessName endswith \"\\\\schtasksexe\" or TargetProcessName endswith \"\\\\certutilexe\" or TargetProcessName endswith \"\\\\whoamiexe\" or TargetProcessName endswith \"\\\\bitsadminexe\"))|extend RuleId=\"5cc2cda8-f261-4d88-a2de-e9e193c86716\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_winrm_susp_child_process.yml\";\nlet q8=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"ActiveScriptEventConsumer\" and TargetProcessCommandLine contains \" CREATE \")|extend RuleId=\"ebef4391-1a81-4761-a40a-1db446c0e625\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wmic_eventconsumer_creation.yml\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"wmicexe\" or TargetProcessName endswith \"\\\\WMICexe\") and TargetProcessCommandLine contains \"/Namespace:\\\\\\\\root\\\\Microsoft\\\\Windows\\\\Defender\")|extend RuleId=\"51cbac1e-eee3-4a90-b1b7-358efb81fa0a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wmic_namespace_defender.yml\";\nlet q10=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\WINWORDEXE\" or ActingProcessName endswith \"\\\\EXCELEXE\" or ActingProcessName endswith \"\\\\POWERPNTexe\" or ActingProcessName endswith \"\\\\MSPUBexe\" or ActingProcessName endswith \"\\\\VISIOexe\" or ActingProcessName endswith \"\\\\MSACCESSEXE\" or ActingProcessName endswith \"\\\\EQNEDT32EXE\" or ActingProcessName endswith \"\\\\ONENOTEEXE\" or ActingProcessName endswith \"\\\\wordpadexe\" or ActingProcessName endswith \"\\\\wordviewexe\") and (TargetProcessName endswith \"\\\\wbem\\\\WMICexe\" or TargetProcessFilename =~ \"wmicexe\") and ((TargetProcessCommandLine contains \"process\" and TargetProcessCommandLine contains \"create\" and TargetProcessCommandLine contains \"call\") and (TargetProcessCommandLine contains \"regsvr32\" or TargetProcessCommandLine contains \"rundll32\" or TargetProcessCommandLine contains \"msiexec\" or TargetProcessCommandLine contains \"mshta\" or TargetProcessCommandLine contains \"verclsid\" or TargetProcessCommandLine contains \"wscript\" or TargetProcessCommandLine contains \"cscript\")))|extend RuleId=\"e1693bc8-7168-4eab-8718-cdcaa68a1738\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wmic_susp_execution_via_office_process.yml\";\nlet q11=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"process \" and TargetProcessCommandLine contains \"call \" and TargetProcessCommandLine contains \"create \") and (TargetProcessCommandLine contains \"rundll32\" or TargetProcessCommandLine contains \"bitsadmin\" or TargetProcessCommandLine contains \"regsvr32\" or TargetProcessCommandLine contains \"cmdexe /c \" or TargetProcessCommandLine contains \"cmdexe /k \" or TargetProcessCommandLine contains \"cmdexe /r \" or TargetProcessCommandLine contains \"cmd /c \" or TargetProcessCommandLine contains \"cmd /k \" or TargetProcessCommandLine contains \"cmd /r \" or TargetProcessCommandLine contains \"powershell\" or TargetProcessCommandLine contains \"pwsh\" or TargetProcessCommandLine contains \"certutil\" or TargetProcessCommandLine contains \"cscript\" or TargetProcessCommandLine contains \"wscript\" or TargetProcessCommandLine contains \"mshta\" or TargetProcessCommandLine contains \"\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\\" or TargetProcessCommandLine contains \"%temp%\" or TargetProcessCommandLine contains \"%tmp%\" or TargetProcessCommandLine contains \"%ProgramData%\" or TargetProcessCommandLine contains \"%appdata%\" or TargetProcessCommandLine contains \"%comspec%\" or TargetProcessCommandLine contains \"%localappdata%\"))|extend RuleId=\"3c89a1e8-0fba-449e-8f1b-8409d6267ec8\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wmic_susp_process_creation.yml\";\nlet q12=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \"wmic\" and TargetProcessCommandLine contains \"product where \" and TargetProcessCommandLine contains \"call\" and TargetProcessCommandLine contains \"uninstall\" and TargetProcessCommandLine contains \"/nointeractive\") or ((TargetProcessCommandLine contains \"wmic\" and TargetProcessCommandLine contains \"caption like \") and (TargetProcessCommandLine contains \"call delete\" or TargetProcessCommandLine contains \"call terminate\")) or (TargetProcessCommandLine contains \"process \" and TargetProcessCommandLine contains \"where \" and TargetProcessCommandLine contains \"delete\")) and (TargetProcessCommandLine contains \"%carbon%\" or TargetProcessCommandLine contains \"%cylance%\" or TargetProcessCommandLine contains \"%endpoint%\" or TargetProcessCommandLine contains \"%eset%\" or TargetProcessCommandLine contains \"%malware%\" or TargetProcessCommandLine contains \"%Sophos%\" or TargetProcessCommandLine contains \"%symantec%\" or TargetProcessCommandLine contains \"Antivirus\" or TargetProcessCommandLine contains \"AVG \" or TargetProcessCommandLine contains \"Carbon Black\" or TargetProcessCommandLine contains \"CarbonBlack\" or TargetProcessCommandLine contains \"Cb Defense Sensor 64-bit\" or TargetProcessCommandLine contains \"Crowdstrike Sensor\" or TargetProcessCommandLine contains \"Cylance \" or TargetProcessCommandLine contains \"Dell Threat Defense\" or TargetProcessCommandLine contains \"DLP Endpoint\" or TargetProcessCommandLine contains \"Endpoint Detection\" or TargetProcessCommandLine contains \"Endpoint Protection\" or TargetProcessCommandLine contains \"Endpoint Security\" or TargetProcessCommandLine contains \"Endpoint Sensor\" or TargetProcessCommandLine contains \"ESET File Security\" or TargetProcessCommandLine contains \"LogRhythm System Monitor Service\" or TargetProcessCommandLine contains \"Malwarebytes\" or TargetProcessCommandLine contains \"McAfee Agent\" or TargetProcessCommandLine contains \"Microsoft Security Client\" or TargetProcessCommandLine contains \"Sophos Anti-Virus\" or TargetProcessCommandLine contains \"Sophos AutoUpdate\" or TargetProcessCommandLine contains \"Sophos Credential Store\" or TargetProcessCommandLine contains \"Sophos Management Console\" or TargetProcessCommandLine contains \"Sophos Management Database\" or TargetProcessCommandLine contains \"Sophos Management Server\" or TargetProcessCommandLine contains \"Sophos Remote Management System\" or TargetProcessCommandLine contains \"Sophos Update Manager\" or TargetProcessCommandLine contains \"Threat Protection\" or TargetProcessCommandLine contains \"VirusScan\" or TargetProcessCommandLine contains \"Webroot SecureAnywhere\" or TargetProcessCommandLine contains \"Windows Defender\"))|extend RuleId=\"847d5ff3-8a31-4737-a970-aeae8fe21765\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wmic_uninstall_security_products.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Persistence", "InitialAccess", "Execution", "DefenseEvasion", "PrivilegeEscalation", "Discovery", "CredentialAccess"],
                "techniques": ["T1562", "T1059", "T1218", "T1047", "T1204", "T1033", "T1190", "T1546"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000235",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}