{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-4c76-45a9-804d-dc3f355f2021')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-4c76-45a9-804d-dc3f355f2021')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation high 021",
                "description": "Sigma Windows Process Creation high 021",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"\\\\CurrentVersion\\\\Image File Execution Options\\\\\" and (TargetProcessCommandLine contains \"sethc.exe\" or TargetProcessCommandLine contains \"utilman.exe\" or TargetProcessCommandLine contains \"osk.exe\" or TargetProcessCommandLine contains \"magnify.exe\" or TargetProcessCommandLine contains \"narrator.exe\" or TargetProcessCommandLine contains \"displayswitch.exe\" or TargetProcessCommandLine contains \"atbroker.exe\" or TargetProcessCommandLine contains \"HelpPane.exe\"))|extend RuleId=\"ae215552-081e-44c7-805f-be16f975c8a2\";\nlet q1=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"UserInitMprLogonScript\"|extend RuleId=\"21d856f9-9281-4ded-9377-51a1a6e2a432\";\nlet q2=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"\\\\System\\\\CurrentControlSet\\\\Services\\\\\" and TargetProcessCommandLine contains \"\\\\NetworkProvider\")|extend RuleId=\"baef1ec6-2ca9-47a3-97cc-4cf2bda10b77\";\nlet q3=_Im_ProcessCreate\n| where (TargetProcessIntegrityLevel =~ \"Medium\" and (TargetProcessCommandLine contains \"ControlSet\" and TargetProcessCommandLine contains \"services\") and (TargetProcessCommandLine contains \"\\\\ImagePath\" or TargetProcessCommandLine contains \"\\\\FailureCommand\" or TargetProcessCommandLine contains \"\\\\ServiceDll\"))|extend RuleId=\"0f9c21f1-6a73-4b0e-9809-cb562cb8d981\";\nlet q4=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"SOFTWARE\\\\Microsoft\\\\Provisioning\\\\Commands\\\\\"|extend RuleId=\"2a4b3e61-9d22-4e4a-b60f-6e8f0cde6f25\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"\\\\ShellIds\\\\Microsoft.PowerShell\\\\ExecutionPolicy\" or TargetProcessCommandLine contains \"\\\\Policies\\\\Microsoft\\\\Windows\\\\PowerShell\\\\ExecutionPolicy\") and (TargetProcessCommandLine contains \"Bypass\" or TargetProcessCommandLine contains \"RemoteSigned\" or TargetProcessCommandLine contains \"Unrestricted\"))|extend RuleId=\"cf2e938e-9a3e-4fe8-a347-411642b28a9f\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessFilename =~ \"REGSVR32.EXE\") and (TargetProcessCommandLine contains \" /i:http://1\" or TargetProcessCommandLine contains \" /i:http://2\" or TargetProcessCommandLine contains \" /i:http://3\" or TargetProcessCommandLine contains \" /i:http://4\" or TargetProcessCommandLine contains \" /i:http://5\" or TargetProcessCommandLine contains \" /i:http://6\" or TargetProcessCommandLine contains \" /i:http://7\" or TargetProcessCommandLine contains \" /i:http://8\" or TargetProcessCommandLine contains \" /i:http://9\" or TargetProcessCommandLine contains \" /i:https://1\" or TargetProcessCommandLine contains \" /i:https://2\" or TargetProcessCommandLine contains \" /i:https://3\" or TargetProcessCommandLine contains \" /i:https://4\" or TargetProcessCommandLine contains \" /i:https://5\" or TargetProcessCommandLine contains \" /i:https://6\" or TargetProcessCommandLine contains \" /i:https://7\" or TargetProcessCommandLine contains \" /i:https://8\" or TargetProcessCommandLine contains \" /i:https://9\" or TargetProcessCommandLine contains \" -i:http://1\" or TargetProcessCommandLine contains \" -i:http://2\" or TargetProcessCommandLine contains \" -i:http://3\" or TargetProcessCommandLine contains \" -i:http://4\" or TargetProcessCommandLine contains \" -i:http://5\" or TargetProcessCommandLine contains \" -i:http://6\" or TargetProcessCommandLine contains \" -i:http://7\" or TargetProcessCommandLine contains \" -i:http://8\" or TargetProcessCommandLine contains \" -i:http://9\" or TargetProcessCommandLine contains \" -i:https://1\" or TargetProcessCommandLine contains \" -i:https://2\" or TargetProcessCommandLine contains \" -i:https://3\" or TargetProcessCommandLine contains \" -i:https://4\" or TargetProcessCommandLine contains \" -i:https://5\" or TargetProcessCommandLine contains \" -i:https://6\" or TargetProcessCommandLine contains \" -i:https://7\" or TargetProcessCommandLine contains \" -i:https://8\" or TargetProcessCommandLine contains \" -i:https://9\"))|extend RuleId=\"2dd2c217-bf68-437a-b57c-fe9fd01d5de8\";\nlet q7=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessFilename =~ \"\\\\REGSVR32.EXE\") and TargetProcessCommandLine contains \" \\\\\\\\\")|extend RuleId=\"88a87a10-384b-4ad7-8871-2f9bf9259ce5\";\nlet q8=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\regsvr32.exe\" and (TargetProcessName endswith \"\\\\calc.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\explorer.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\" or TargetProcessName endswith \"\\\\nltest.exe\" or TargetProcessName endswith \"\\\\notepad.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\reg.exe\" or TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessName endswith \"\\\\werfault.exe\" or TargetProcessName endswith \"\\\\wscript.exe\")) and (not((TargetProcessName endswith \"\\\\werfault.exe\" and TargetProcessCommandLine contains \" -u -p \"))))|extend RuleId=\"6f0947a4-1c5e-4e0d-8ac7-53159b8f23ca\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessFilename =~ \"REGSVR32.EXE\") and ((TargetProcessCommandLine contains \":\\\\PerfLogs\\\\\" or TargetProcessCommandLine contains \":\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\Registration\\\\CRMLog\" or TargetProcessCommandLine contains \"\\\\Windows\\\\System32\\\\com\\\\dmp\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\System32\\\\FxsTmp\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\System32\\\\Microsoft\\\\Crypto\\\\RSA\\\\MachineKeys\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\color\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\System32\\\\spool\\\\PRINTERS\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\System32\\\\spool\\\\SERVERS\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\System32\\\\Tasks_Migrated\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\System32\\\\Tasks\\\\Microsoft\\\\Windows\\\\SyncCenter\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\SysWOW64\\\\com\\\\dmp\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\SysWOW64\\\\FxsTmp\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\SysWOW64\\\\Tasks\\\\Microsoft\\\\Windows\\\\PLA\\\\System\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\SysWOW64\\\\Tasks\\\\Microsoft\\\\Windows\\\\SyncCenter\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\Tasks\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\Tracing\\\\\") or ((TargetProcessCommandLine contains \" \\\"C:\\\\\" or TargetProcessCommandLine contains \" C:\\\\\" or TargetProcessCommandLine contains \" 'C:\\\\\" or TargetProcessCommandLine contains \"D:\\\\\") and (not((TargetProcessCommandLine contains \"C:\\\\Program Files (x86)\\\\\" or TargetProcessCommandLine contains \"C:\\\\Program Files\\\\\" or TargetProcessCommandLine contains \"C:\\\\ProgramData\\\\\" or TargetProcessCommandLine contains \"C:\\\\Users\\\\\" or TargetProcessCommandLine contains \" C:\\\\Windows\\\\\" or TargetProcessCommandLine contains \" \\\"C:\\\\Windows\\\\\" or TargetProcessCommandLine contains \" 'C:\\\\Windows\\\\\"))))) and (not((TargetProcessCommandLine =~ \"\" or isnull(TargetProcessCommandLine)))))|extend RuleId=\"327ff235-94eb-4f06-b9de-aaee571324be\";\nlet q10=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessFilename =~ \"REGSVR32.EXE\") and (TargetProcessCommandLine endswith \".bin\" or TargetProcessCommandLine endswith \".bmp\" or TargetProcessCommandLine endswith \".cr2\" or TargetProcessCommandLine endswith \".dat\" or TargetProcessCommandLine endswith \".eps\" or TargetProcessCommandLine endswith \".gif\" or TargetProcessCommandLine endswith \".ico\" or TargetProcessCommandLine endswith \".jpeg\" or TargetProcessCommandLine endswith \".jpg\" or TargetProcessCommandLine endswith \".nef\" or TargetProcessCommandLine endswith \".orf\" or TargetProcessCommandLine endswith \".png\" or TargetProcessCommandLine endswith \".raw\" or TargetProcessCommandLine endswith \".sr2\" or TargetProcessCommandLine endswith \".temp\" or TargetProcessCommandLine endswith \".tif\" or TargetProcessCommandLine endswith \".tiff\" or TargetProcessCommandLine endswith \".tmp\" or TargetProcessCommandLine endswith \".rtf\" or TargetProcessCommandLine endswith \".txt\"))|extend RuleId=\"089fc3d2-71e8-4763-a8a5-c97fbb0a403e\";\nlet q11=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"reg.exe\" or TargetProcessFilename =~ \"reg.exe\") and TargetProcessCommandLine contains \"\\\\SYSTEM\\\\CurrentControlSet\\\\Control\\\\SafeBoot\" and (TargetProcessCommandLine contains \" copy \" or TargetProcessCommandLine contains \" add \"))|extend RuleId=\"d7662ff6-9e97-4596-a61d-9839e32dee8d\";\nlet q12=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"REG\" and TargetProcessCommandLine contains \"ADD\" and TargetProcessCommandLine contains \"\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\FVE\" and TargetProcessCommandLine contains \"/v\" and TargetProcessCommandLine contains \"/f\") and (TargetProcessCommandLine contains \"EnableBDEWithNoTPM\" or TargetProcessCommandLine contains \"UseAdvancedStartup\" or TargetProcessCommandLine contains \"UseTPM\" or TargetProcessCommandLine contains \"UseTPMKey\" or TargetProcessCommandLine contains \"UseTPMKeyPIN\" or TargetProcessCommandLine contains \"RecoveryKeyMessageSource\" or TargetProcessCommandLine contains \"UseTPMPIN\" or TargetProcessCommandLine contains \"RecoveryKeyMessage\"))|extend RuleId=\"0e0255bf-2548-47b8-9582-c0955c9283f5\";\nlet q13=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"reg.exe\" or TargetProcessFilename =~ \"reg.exe\") and (TargetProcessCommandLine contains \" delete \" and TargetProcessCommandLine contains \"\\\\SYSTEM\\\\CurrentControlSet\\\\Control\\\\SafeBoot\"))|extend RuleId=\"fc0e89b5-adb0-43c1-b749-c12a10ec37de\";\nlet q14=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"reg.exe\" or TargetProcessFilename =~ \"reg.exe\") and TargetProcessCommandLine contains \" delete \" and TargetProcessCommandLine contains \"\\\\SYSTEM\\\\CurrentControlSet\\\\services\\\\\")|extend RuleId=\"05b2aa93-1210-42c8-8d9a-2fcc13b284f5\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "PrivilegeEscalation", "Impact", "CredentialAccess", "Persistence"],
                "techniques": ["T1218", "T1546", "T1574", "T1562", "T1486", "T1037", "T1003"],
                "alertRuleTemplateName": "5163A000-4c76-45a9-804d-dc3f355f2021",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}