{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000103')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000103')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 03",
                "description": "Sigma Windows Process Creation low 03",
                "severity": "low",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\dsquery\\.exe\" or TargetProcessFilename =~ \"dsquery\\.exe\") and TargetProcessCommandLine contains \"trustedDomain\")|extend RuleId=\"5163A000-5160-5160-5160-5163A0000102\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_dsquery_domain_trust_discovery.yml\";\nlet q1=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\DumpMinitool\\.exe\" or TargetProcessName endswith \"\\\\DumpMinitool\\.x86\\.exe\" or TargetProcessName endswith \"\\\\DumpMinitool\\.arm64\\.exe\") or (TargetProcessFilename =~ \"DumpMinitool\\.exe\" or TargetProcessFilename =~ \"DumpMinitool\\.x86\\.exe\" or TargetProcessFilename =~ \"DumpMinitool\\.arm64\\.exe\")) and (TargetProcessCommandLine contains \" Full\" or TargetProcessCommandLine contains \" Mini\" or TargetProcessCommandLine contains \" WithHeap\"))|extend RuleId=\"dee0a7a3-f200-4112-a99b-952196d81e42\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_dumpminitool_execution.yml\";\nlet q2=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"esentutl\" and TargetProcessCommandLine contains \" /p\")|extend RuleId=\"7df1713a-1a5b-4a4b-a071-dc83b144a101\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_esentutl_params.yml\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\esentutl\\.exe\" or TargetProcessFilename =~ \"esentutl\\.exe\") and (TargetProcessCommandLine contains \"/r\" or TargetProcessCommandLine contains \"-r\") and TargetProcessCommandLine contains \"\\\\Windows\\\\WebCache\")|extend RuleId=\"6a69f62d-ce75-4b57-8dce-6351eb55b362\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_esentutl_webcache.yml\";\nlet q4=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\plink\\.exe\" or TargetProcessName endswith \"\\\\socat\\.exe\" or TargetProcessName endswith \"\\\\stunnel\\.exe\" or TargetProcessName endswith \"\\\\httptunnel\\.exe\")|extend RuleId=\"c75309a3-59f8-4a8d-9c2c-4c927ad50555\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_exfiltration_and_tunneling_tools_execution.yml\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\expand\\.exe\" and (TargetProcessCommandLine contains \"\\.cab\" or TargetProcessCommandLine contains \"/F:\" or TargetProcessCommandLine contains \"-F:\" or TargetProcessCommandLine contains \"C:\\\\ProgramData\\\\\" or TargetProcessCommandLine contains \"C:\\\\Public\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\Temp\\\\\")) and (not((ActingProcessName =~ \"C:\\\\Program Files (x86)\\\\Dell\\\\UpdateService\\\\ServiceShell\\.exe\" and TargetProcessCommandLine contains \"C:\\\\ProgramData\\\\Dell\\\\UpdateService\\\\Temp\\\\\"))))|extend RuleId=\"9f107a84-532c-41af-b005-8d12a607639f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_expand_cabinet_files.yml\";\nlet q6=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"/factory,{75dff2b7-6936-4c06-a8bb-676a7b00b24b}\" or (TargetProcessCommandLine contains \"explorer\\.exe\" and TargetProcessCommandLine contains \" /root,\"))|extend RuleId=\"949f1ffb-6e85-4f00-ae1e-c3c5b190d605\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_explorer_break_process_tree.yml\";\nlet q7=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\findstr\\.exe\" or TargetProcessFilename =~ \"FINDSTR\\.EXE\") and TargetProcessCommandLine endswith \"\\.lnk\")|extend RuleId=\"33339be3-148b-4e16-af56-ad16ec6c7e7b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_findstr_lnk.yml\";\nlet q8=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\findstr\\.exe\" or TargetProcessFilename =~ \"FINDSTR\\.EXE\") and (TargetProcessCommandLine contains \"\\\"Everyone\\\"\" or TargetProcessCommandLine contains \"'Everyone'\" or TargetProcessCommandLine contains \"\\\"BUILTIN\\\\\\\"\" or TargetProcessCommandLine contains \"'BUILTIN\\\\'\")) or (TargetProcessCommandLine contains \"icacls \" and TargetProcessCommandLine contains \"findstr \" and TargetProcessCommandLine contains \"Everyone\"))|extend RuleId=\"47e4bab7-c626-47dc-967b-255608c9a920\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_findstr_recon_everyone.yml\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\findstr\\.exe\" or TargetProcessFilename =~ \"FINDSTR\\.EXE\") and (ActingProcessCommandLine contains \"ipconfig \" or ActingProcessCommandLine contains \"tasklist\"))|extend RuleId=\"ccb5742c-c248-4982-8c5c-5571b9275ad3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_findstr_susp_parent.yml\";\nlet q10=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\fsutil\\.exe\" or TargetProcessFilename =~ \"fsutil\\.exe\") and (TargetProcessCommandLine contains \"behavior \" and TargetProcessCommandLine contains \"set \" and TargetProcessCommandLine contains \"SymlinkEvaluation\"))|extend RuleId=\"c0b2768a-dd06-4671-8339-b16ca8d1f27f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_fsutil_symlinkevaluation.yml\";\nlet q11=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\GfxDownloadWrapper\\.exe\" and (TargetProcessCommandLine contains \"http://\" or TargetProcessCommandLine contains \"https://\")) and (not(TargetProcessCommandLine contains \"https://gameplayapi\\.intel\\.com/\")))|extend RuleId=\"eee00933-a761-4cd0-be70-c42fe91731e7\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_gfxdownloadwrapper_arbitrary_file_download.yml\";\nlet q12=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\git\\.exe\" or TargetProcessName endswith \"\\\\git-remote-https\\.exe\") or TargetProcessFilename =~ \"git\\.exe\") and (TargetProcessCommandLine contains \" clone \" or TargetProcessCommandLine contains \"git-remote-https \") and (TargetProcessCommandLine contains \"exploit\" or TargetProcessCommandLine contains \"Vulns\" or TargetProcessCommandLine contains \"vulnerability\" or TargetProcessCommandLine contains \"RemoteCodeExecution\" or TargetProcessCommandLine contains \"Invoke-\" or TargetProcessCommandLine contains \"CVE-\" or TargetProcessCommandLine contains \"poc-\" or TargetProcessCommandLine contains \"ProofOfConcept\" or TargetProcessCommandLine contains \"proxyshell\" or TargetProcessCommandLine contains \"log4shell\" or TargetProcessCommandLine contains \"eternalblue\" or TargetProcessCommandLine contains \"eternal-blue\" or TargetProcessCommandLine contains \"MS17-\"))|extend RuleId=\"aef9d1f1-7396-4e92-a927-4567c7a495c1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_git_susp_clone.yml\";\nlet q13=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\gpg\\.exe\" or TargetProcessName endswith \"\\\\gpg2\\.exe\") or TargetProcessFileDescription =~ \"GnuPG\u2019s OpenPGP tool\") and (TargetProcessCommandLine contains \" -d \" and TargetProcessCommandLine contains \"passphrase\"))|extend RuleId=\"037dcd71-33a8-4392-bb01-293c94663e5a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_gpg4win_decryption.yml\";\nlet q14=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\gpg\\.exe\" or TargetProcessName endswith \"\\\\gpg2\\.exe\") or TargetProcessFileDescription =~ \"GnuPG\u2019s OpenPGP tool\") and (TargetProcessCommandLine contains \" -c \" and TargetProcessCommandLine contains \"passphrase\"))|extend RuleId=\"550bbb84-ce5d-4e61-84ad-e590f0024dcd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_gpg4win_encryption.yml\";\nlet q15=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\gpresult\\.exe\" and (TargetProcessCommandLine contains \"/z\" or TargetProcessCommandLine contains \"/v\"))|extend RuleId=\"e56d3073-83ff-4021-90fe-c658e0709e72\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_gpresult_execution.yml\";\nlet q16=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\gup\\.exe\" and TargetProcessName endswith \"\\\\explorer\\.exe\") and (not(((TargetProcessName endswith \"\\\\explorer\\.exe\" and TargetProcessCommandLine contains \"\\\\Notepad++\\\\notepad++\\.exe\") or ActingProcessName contains \"\\\\Notepad++\\\\updater\\\\\" or isnull(TargetProcessCommandLine)))))|extend RuleId=\"d65aee4d-2292-4cea-b832-83accd6cfa43\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_gup_arbitrary_binary_execution.yml\";\nlet q17=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"HH\\.exe\" or TargetProcessName endswith \"\\\\hh\\.exe\") and TargetProcessCommandLine contains \"\\.chm\")|extend RuleId=\"68c8acb4-1b60-4890-8e82-3ddf7a6dba84\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hh_chm_execution.yml\";\nlet q18=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\ruby\\.exe\" and (TargetProcessCommandLine contains \"-i \" and TargetProcessCommandLine contains \"-u \" and TargetProcessCommandLine contains \"-p \"))|extend RuleId=\"a197e378-d31b-41c0-9635-cfdf1c1bb423\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_evil_winrm.yml\";\nlet q19=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"impersonate\\.exe\" and (TargetProcessCommandLine contains \" list \" or TargetProcessCommandLine contains \" exec \" or TargetProcessCommandLine contains \" adduser \")) or ((Hashes contains \"MD5=9520714AB576B0ED01D1513691377D01\" or Hashes contains \"SHA256=E81CC96E2118DC4FBFE5BAD1604E0AC7681960143E2101E1A024D52264BB0A8A\" or Hashes contains \"IMPHASH=0A358FFC1697B7A07D0E817AC740DF62\") or (md5 =~ \"9520714AB576B0ED01D1513691377D01\" or sha256 =~ \"E81CC96E2118DC4FBFE5BAD1604E0AC7681960143E2101E1A024D52264BB0A8A\" or TargetProcessIMPHASH =~ \"0A358FFC1697B7A07D0E817AC740DF62\")))|extend RuleId=\"cf0c254b-22f1-4b2b-8221-e137b3c0af94\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_impersonate.yml\";\nlet q20=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"new-object\" and TargetProcessCommandLine contains \"text\\.encoding]::ascii\") and (TargetProcessCommandLine contains \"system\\.io\\.compression\\.deflatestream\" or TargetProcessCommandLine contains \"system\\.io\\.streamreader\" or TargetProcessCommandLine contains \"readtoend(\"))|extend RuleId=\"7eedcc9d-9fdb-4d94-9c54-474e8affc0c7\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_invoke_obfuscation_via_compress.yml\";\nlet q21=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\cmd\\.exe\" and ActingProcessCommandLine endswith \"\\.bat\") and ((TargetProcessName endswith \"\\\\xcopy\\.exe\" and (TargetProcessCommandLine contains \"powershell\\.exe\" and TargetProcessCommandLine contains \"\\.bat\\.exe\")) or (TargetProcessName endswith \"\\\\xcopy\\.exe\" and (TargetProcessCommandLine contains \"pwsh\\.exe\" and TargetProcessCommandLine contains \"\\.bat\\.exe\")) or (TargetProcessName endswith \"\\\\attrib\\.exe\" and (TargetProcessCommandLine contains \"+s\" and TargetProcessCommandLine contains \"+h\" and TargetProcessCommandLine contains \"\\.bat\\.exe\"))))|extend RuleId=\"0a99eb3e-1617-41bd-b095-13dc767f3def\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_jlaive_batch_execution.yml\";\nlet q22=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\SharpLDAPmonitor\\.exe\" or TargetProcessFilename =~ \"SharpLDAPmonitor\\.exe\") or (TargetProcessCommandLine contains \"/user:\" and TargetProcessCommandLine contains \"/pass:\" and TargetProcessCommandLine contains \"/dcip:\"))|extend RuleId=\"9f8fc146-1d1a-4dbf-b8fd-dfae15e08541\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_sharp_ldap_monitor.yml\";\nlet q23=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"/generic:Microsoft_Windows_Shell_ZipFolder:filename=\" and TargetProcessCommandLine contains \"\\.zip\" and TargetProcessCommandLine contains \"/pass:\" and TargetProcessCommandLine contains \"/user:\") or (TargetProcessCommandLine contains \"/delete\" and TargetProcessCommandLine contains \"Microsoft_Windows_Shell_ZipFolder:filename=\" and TargetProcessCommandLine contains \"\\.zip\"))|extend RuleId=\"90dcf730-1b71-4ae7-9ffc-6fcf62bd0132\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_zipexec.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19, q20, q21, q22, q23;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Exfiltration", "Discovery", "PrivilegeEscalation", "Collection", "CredentialAccess", "CommandAndControl", "Execution", "DefenseEvasion", "LateralMovement", "Reconnaissance"],
                "techniques": ["T1572", "T1482", "T1071", "T1134", "T1027", "T1202", "T1552", "T1003", "T1057", "T1593", "T1036", "T1041", "T1218", "T1105", "T1059", "T1615", "T1021", "T1005"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000103",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}