{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000244')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000244')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 44",
                "description": "Sigma Windows Process Creation medium 44",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\wget.exe\" or TargetProcessFilename =~ \"wget.exe\") and (TargetProcessCommandLine contains \".githubusercontent.com\" or TargetProcessCommandLine contains \"anonfiles.com\" or TargetProcessCommandLine contains \"cdn.discordapp.com\" or TargetProcessCommandLine contains \"cdn.discordapp.com/attachments/\" or TargetProcessCommandLine contains \"ddns.net\" or TargetProcessCommandLine contains \"dl.dropboxusercontent.com\" or TargetProcessCommandLine contains \"ghostbin.co\" or TargetProcessCommandLine contains \"glitch.me\" or TargetProcessCommandLine contains \"gofile.io\" or TargetProcessCommandLine contains \"hastebin.com\" or TargetProcessCommandLine contains \"mediafire.com\" or TargetProcessCommandLine contains \"mega.nz\" or TargetProcessCommandLine contains \"onrender.com\" or TargetProcessCommandLine contains \"paste.ee\" or TargetProcessCommandLine contains \"pastebin.com\" or TargetProcessCommandLine contains \"pastebin.pl\" or TargetProcessCommandLine contains \"pastetext.net\" or TargetProcessCommandLine contains \"privatlab.com\" or TargetProcessCommandLine contains \"privatlab.net\" or TargetProcessCommandLine contains \"send.exploit.in\" or TargetProcessCommandLine contains \"sendspace.com\" or TargetProcessCommandLine contains \"storage.googleapis.com\" or TargetProcessCommandLine contains \"storjshare.io\" or TargetProcessCommandLine contains \"supabase.co\" or TargetProcessCommandLine contains \"temp.sh\" or TargetProcessCommandLine contains \"transfer.sh\" or TargetProcessCommandLine contains \"ufile.io\") and TargetProcessCommandLine contains \"http\" and (TargetProcessCommandLine matches regex \"\\\\s-O\\\\s\" or TargetProcessCommandLine contains \"--output-document\") and (TargetProcessCommandLine endswith \".ps1\" or TargetProcessCommandLine endswith \".ps1'\" or TargetProcessCommandLine endswith \".ps1\\\"\" or TargetProcessCommandLine endswith \".dat\" or TargetProcessCommandLine endswith \".dat'\" or TargetProcessCommandLine endswith \".dat\\\"\" or TargetProcessCommandLine endswith \".msi\" or TargetProcessCommandLine endswith \".msi'\" or TargetProcessCommandLine endswith \".msi\\\"\" or TargetProcessCommandLine endswith \".bat\" or TargetProcessCommandLine endswith \".bat'\" or TargetProcessCommandLine endswith \".bat\\\"\" or TargetProcessCommandLine endswith \".exe\" or TargetProcessCommandLine endswith \".exe'\" or TargetProcessCommandLine endswith \".exe\\\"\" or TargetProcessCommandLine endswith \".vbs\" or TargetProcessCommandLine endswith \".vbs'\" or TargetProcessCommandLine endswith \".vbs\\\"\" or TargetProcessCommandLine endswith \".vbe\" or TargetProcessCommandLine endswith \".vbe'\" or TargetProcessCommandLine endswith \".vbe\\\"\" or TargetProcessCommandLine endswith \".hta\" or TargetProcessCommandLine endswith \".hta'\" or TargetProcessCommandLine endswith \".hta\\\"\" or TargetProcessCommandLine endswith \".dll\" or TargetProcessCommandLine endswith \".dll'\" or TargetProcessCommandLine endswith \".dll\\\"\" or TargetProcessCommandLine endswith \".psm1\" or TargetProcessCommandLine endswith \".psm1'\" or TargetProcessCommandLine endswith \".psm1\\\"\"))|extend RuleId=\"a0d7e4d2-bede-4141-8896-bc6e237e977c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wget_download_susp_file_sharing_domains.yml\"|extend RuleTitle=\"Suspicious File Download From File Sharing Domain Via Wget.EXE\"|extend RuleDescription=\"Detects potentially suspicious file downloads from file sharing domains using wget.exe\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\wget.exe\" or TargetProcessFilename =~ \"wget.exe\") and TargetProcessCommandLine matches regex \"://[0-9]{1,3}\\\\.[0-9]{1,3}\\\\.[0-9]{1,3}\\\\.[0-9]{1,3}\" and TargetProcessCommandLine contains \"http\" and (TargetProcessCommandLine matches regex \"\\\\s-O\\\\s\" or TargetProcessCommandLine contains \"--output-document\") and ((TargetProcessCommandLine contains \":\\\\PerfLogs\\\\\" or TargetProcessCommandLine contains \":\\\\Temp\\\\\" or TargetProcessCommandLine contains \":\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\Help\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\Temporary Internet\") or (TargetProcessCommandLine contains \":\\\\Users\\\\\" and TargetProcessCommandLine contains \"\\\\Favorites\\\\\") or (TargetProcessCommandLine contains \":\\\\Users\\\\\" and TargetProcessCommandLine contains \"\\\\Favourites\\\\\") or (TargetProcessCommandLine contains \":\\\\Users\\\\\" and TargetProcessCommandLine contains \"\\\\Contacts\\\\\") or (TargetProcessCommandLine contains \":\\\\Users\\\\\" and TargetProcessCommandLine contains \"\\\\Pictures\\\\\")))|extend RuleId=\"40aa399c-7b02-4715-8e5f-73572b493f33\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wget_download_susp_locations.yml\"|extend RuleTitle=\"Suspicious File Download From IP Via Wget.EXE - Paths\"|extend RuleDescription=\"Detects potentially suspicious file downloads directly from IP addresses and stored in suspicious locations using Wget.exe\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"whoami.exe\" or TargetProcessName endswith \"\\\\whoami.exe\") and (TargetUsername contains \"AUTHORI\" or TargetUsername contains \"AUTORI\" or TargetUsername contains \"TrustedInstaller\"))|extend RuleId=\"79ce34ca-af29-4d0e-b832-fc1b377020db\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_whoami_execution_from_high_priv_process.yml\"|extend RuleTitle=\"Whoami.EXE Execution From Privileged Process\"|extend RuleDescription=\"Detects the execution of \\\"whoami.exe\\\" by privileged accounts that are often abused by threat actors\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\whoami.exe\" or TargetProcessFilename =~ \"whoami.exe\") and (TargetProcessCommandLine contains \" /priv\" or TargetProcessCommandLine contains \" -priv\"))|extend RuleId=\"97a80ec7-0e2f-4d05-9ef4-65760e634f6b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_whoami_priv_discovery.yml\"|extend RuleTitle=\"Security Privileges Enumeration Via Whoami.EXE\"|extend RuleDescription=\"Detects a whoami.exe executed with the /priv command line flag instructing the tool to show all current user privileges. This is often used after a privilege escalation attempt.\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\winget.exe\" or TargetProcessFilename =~ \"winget.exe\") and (TargetProcessCommandLine contains \"source \" and TargetProcessCommandLine contains \"add \" and TargetProcessCommandLine contains \"http://\"))|extend RuleId=\"81a0ecb5-0a41-4ba1-b2ba-c944eb92bfa2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_winget_add_insecure_custom_source.yml\"|extend RuleTitle=\"Add Insecure Download Source To Winget\"|extend RuleDescription=\"Detects usage of winget to add a new insecure (http) download source.\\nWinget will not allow the addition of insecure sources, hence this could indicate potential suspicious activity (or typos)\\n\";\nlet q5=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\wsmprovhost.exe\" and (TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\sh.exe\" or TargetProcessName endswith \"\\\\bash.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\wsl.exe\" or TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessName endswith \"\\\\whoami.exe\" or TargetProcessName endswith \"\\\\bitsadmin.exe\"))|extend RuleId=\"5cc2cda8-f261-4d88-a2de-e9e193c86716\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_winrm_susp_child_process.yml\"|extend RuleTitle=\"Suspicious Processes Spawned by WinRM\"|extend RuleDescription=\"Detects suspicious processes including shells spawnd from WinRM host process\";\nlet q6=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"ActiveScriptEventConsumer\" and TargetProcessCommandLine contains \" CREATE \")|extend RuleId=\"ebef4391-1a81-4761-a40a-1db446c0e625\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wmic_eventconsumer_creation.yml\"|extend RuleTitle=\"New ActiveScriptEventConsumer Created Via Wmic.EXE\"|extend RuleDescription=\"Detects WMIC executions in which an event consumer gets created. This could be used to establish persistence\";\nlet q7=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"wmic.exe\" or TargetProcessName endswith \"\\\\WMIC.exe\") and TargetProcessCommandLine contains \"/Namespace:\\\\\\\\root\\\\Microsoft\\\\Windows\\\\Defender\")|extend RuleId=\"51cbac1e-eee3-4a90-b1b7-358efb81fa0a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wmic_namespace_defender.yml\"|extend RuleTitle=\"Potential Windows Defender Tampering Via Wmic.EXE\"|extend RuleDescription=\"Detects potential tampering with Windows Defender settings such as adding exclusion using wmic\";\nlet q8=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\WINWORD.EXE\" or ActingProcessName endswith \"\\\\EXCEL.EXE\" or ActingProcessName endswith \"\\\\POWERPNT.exe\" or ActingProcessName endswith \"\\\\MSPUB.exe\" or ActingProcessName endswith \"\\\\VISIO.exe\" or ActingProcessName endswith \"\\\\MSACCESS.EXE\" or ActingProcessName endswith \"\\\\EQNEDT32.EXE\" or ActingProcessName endswith \"\\\\ONENOTE.EXE\" or ActingProcessName endswith \"\\\\wordpad.exe\" or ActingProcessName endswith \"\\\\wordview.exe\") and (TargetProcessName endswith \"\\\\wbem\\\\WMIC.exe\" or TargetProcessFilename =~ \"wmic.exe\") and ((TargetProcessCommandLine contains \"process\" and TargetProcessCommandLine contains \"create\" and TargetProcessCommandLine contains \"call\") and (TargetProcessCommandLine contains \"regsvr32\" or TargetProcessCommandLine contains \"rundll32\" or TargetProcessCommandLine contains \"msiexec\" or TargetProcessCommandLine contains \"mshta\" or TargetProcessCommandLine contains \"verclsid\" or TargetProcessCommandLine contains \"wscript\" or TargetProcessCommandLine contains \"cscript\")))|extend RuleId=\"e1693bc8-7168-4eab-8718-cdcaa68a1738\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wmic_susp_execution_via_office_process.yml\"|extend RuleTitle=\"Suspicious WMIC Execution Via Office Process\"|extend RuleDescription=\"Office application called wmic to proxye execution through a LOLBIN process. This is often used to break suspicious parent-child chain (Office app spawns LOLBin).\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"process \" and TargetProcessCommandLine contains \"call \" and TargetProcessCommandLine contains \"create \") and (TargetProcessCommandLine contains \"rundll32\" or TargetProcessCommandLine contains \"bitsadmin\" or TargetProcessCommandLine contains \"regsvr32\" or TargetProcessCommandLine contains \"cmd.exe /c \" or TargetProcessCommandLine contains \"cmd.exe /k \" or TargetProcessCommandLine contains \"cmd.exe /r \" or TargetProcessCommandLine contains \"cmd /c \" or TargetProcessCommandLine contains \"cmd /k \" or TargetProcessCommandLine contains \"cmd /r \" or TargetProcessCommandLine contains \"powershell\" or TargetProcessCommandLine contains \"pwsh\" or TargetProcessCommandLine contains \"certutil\" or TargetProcessCommandLine contains \"cscript\" or TargetProcessCommandLine contains \"wscript\" or TargetProcessCommandLine contains \"mshta\" or TargetProcessCommandLine contains \"\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\\" or TargetProcessCommandLine contains \"%temp%\" or TargetProcessCommandLine contains \"%tmp%\" or TargetProcessCommandLine contains \"%ProgramData%\" or TargetProcessCommandLine contains \"%appdata%\" or TargetProcessCommandLine contains \"%comspec%\" or TargetProcessCommandLine contains \"%localappdata%\"))|extend RuleId=\"3c89a1e8-0fba-449e-8f1b-8409d6267ec8\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wmic_susp_process_creation.yml\"|extend RuleTitle=\"Suspicious Process Created Via Wmic.EXE\"|extend RuleDescription=\"Detects WMIC executing \\\"process call create\\\" with suspicious calls to processes such as \\\"rundll32\\\", \\\"regsrv32\\\", etc.\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "InitialAccess", "CredentialAccess", "Persistence", "PrivilegeEscalation", "Discovery", "Execution"],
                "techniques": ["T1190", "T1033", "T1218", "T1204", "T1059", "T1047", "T1546"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000244",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}