{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000219')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000219')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation high 19",
                "description": "Sigma Windows Process Creation medium 19",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"lockoutduration\" or TargetProcessCommandLine contains \"lockoutthreshold\" or TargetProcessCommandLine contains \"lockoutobservationwindow\" or TargetProcessCommandLine contains \"maxpwdage\" or TargetProcessCommandLine contains \"minpwdage\" or TargetProcessCommandLine contains \"minpwdlength\" or TargetProcessCommandLine contains \"pwdhistorylength\" or TargetProcessCommandLine contains \"pwdproperties\") or TargetProcessCommandLine contains \"-sc admincountdmp\" or TargetProcessCommandLine contains \"-sc exchaddresses\")|extend RuleId=\"5163A000-5160-5160-5160-5163A0000218\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_adfind_enumeration.yml\";\nlet q1=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"domainlist\" or TargetProcessCommandLine contains \"trustdmp\" or TargetProcessCommandLine contains \"dcmodes\" or TargetProcessCommandLine contains \"adinfo\" or TargetProcessCommandLine contains \" dclist \" or TargetProcessCommandLine contains \"computer_pwdnotreqd\" or TargetProcessCommandLine contains \"objectcategory=\" or TargetProcessCommandLine contains \"-subnets -f\" or TargetProcessCommandLine contains \"name=\\\"Domain Admins\\\"\" or TargetProcessCommandLine contains \"-sc u:\" or TargetProcessCommandLine contains \"domainncs\" or TargetProcessCommandLine contains \"dompol\" or TargetProcessCommandLine contains \" oudmp \" or TargetProcessCommandLine contains \"subnetdmp\" or TargetProcessCommandLine contains \"gpodmp\" or TargetProcessCommandLine contains \"fspdmp\" or TargetProcessCommandLine contains \"users_noexpire\" or TargetProcessCommandLine contains \"computers_active\" or TargetProcessCommandLine contains \"computers_pwdnotreqd\")|extend RuleId=\"9a132afa-654e-11eb-ae93-0242ac130002\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_adfind_susp_usage.yml\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"/EXEFilename\" or TargetProcessCommandLine contains \"/CommandLine\") and ((TargetProcessCommandLine contains \" /RunAs 8 \" or TargetProcessCommandLine contains \" /RunAs 4 \" or TargetProcessCommandLine contains \" /RunAs 10 \" or TargetProcessCommandLine contains \" /RunAs 11 \") or (TargetProcessCommandLine endswith \"/RunAs 8\" or TargetProcessCommandLine endswith \"/RunAs 4\" or TargetProcessCommandLine endswith \"/RunAs 10\" or TargetProcessCommandLine endswith \"/RunAs 11\")))|extend RuleId=\"fa00b701-44c6-4679-994d-5a18afa8a707\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_advancedrun_priv_user.yml\";\nlet q3=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\chiselexe\" or ((TargetProcessCommandLine contains \"exe client \" or TargetProcessCommandLine contains \"exe server \") and (TargetProcessCommandLine contains \"-socks5\" or TargetProcessCommandLine contains \"-reverse\" or TargetProcessCommandLine contains \" r:\" or TargetProcessCommandLine contains \":127001:\" or TargetProcessCommandLine contains \"-tls-skip-verify \" or TargetProcessCommandLine contains \":socks\")))|extend RuleId=\"8b0e12da-d3c3-49db-bb4f-256703f380e5\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_chisel.yml\";\nlet q4=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\SepRemovalToolNative_x64exe\" or (TargetProcessName endswith \"\\\\CATCleanexe\" and TargetProcessCommandLine contains \"--uninstall\") or (TargetProcessName endswith \"\\\\NetInstallerexe\" and TargetProcessCommandLine contains \"-r\") or (TargetProcessName endswith \"\\\\WFPUninsexe\" and (TargetProcessCommandLine contains \"/uninstall\" and TargetProcessCommandLine contains \"/enterprise\")))|extend RuleId=\"f44800ac-38ec-471f-936e-3fa7d9c53100\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_cleanwipe.yml\";\nlet q5=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\Crassusexe\" or TargetProcessFilename =~ \"Crassusexe\" or TargetProcessFileDescription contains \"Crassus\")|extend RuleId=\"2c32b543-1058-4808-91c6-5b31b8bed6c5\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_crassus.yml\";\nlet q6=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\csexecexe\" or TargetProcessFileDescription =~ \"csexec\")|extend RuleId=\"d08a2711-ee8b-4323-bdec-b7d85e892b31\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_csexec.yml\";\nlet q7=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\DefenderCheckexe\" or TargetProcessFileDescription =~ \"DefenderCheck\")|extend RuleId=\"f0ca6c24-3225-47d5-b1f5-352bf07ecfa7\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_defendercheck.yml\";\nlet q8=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\ditsnapexe\" or TargetProcessCommandLine contains \"ditsnapexe\")|extend RuleId=\"d3b70aad-097e-409c-9df2-450f80dc476b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_ditsnap.yml\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\frpcexe\" or TargetProcessName endswith \"\\\\frpsexe\") or TargetProcessCommandLine contains \"\\\\frpcini\" or ((Hashes contains \"MD5=7D9C233B8C9E3F0EA290D2B84593C842\" or Hashes contains \"SHA1=06DDC9280E1F1810677935A2477012960905942F\" or Hashes contains \"SHA256=57B0936B8D336D8E981C169466A15A5FD21A7D5A2C7DAF62D5E142EE860E387C\") or md5 =~ \"7d9c233b8c9e3f0ea290d2b84593c842\" or sha1 =~ \"06ddc9280e1f1810677935a2477012960905942f\" or sha256 =~ \"57b0936b8d336d8e981c169466a15a5fd21a7d5a2c7daf62d5e142ee860e387c\"))|extend RuleId=\"32410e29-5f94-4568-b6a3-d91a8adad863\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_frp.yml\";\nlet q10=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\ioxexe\" or (TargetProcessCommandLine contains \"exe fwd -l \" or TargetProcessCommandLine contains \"exe fwd -r \" or TargetProcessCommandLine contains \"exe proxy -l \" or TargetProcessCommandLine contains \"exe proxy -r \") or ((Hashes contains \"MD5=9DB2D314DD3F704A02051EF5EA210993\" or Hashes contains \"SHA1=039130337E28A6623ECF9A0A3DA7D92C5964D8DD\" or Hashes contains \"SHA256=C6CF82919B809967D9D90EA73772A8AA1C1EB3BC59252D977500F64F1A0D6731\") or md5 =~ \"9db2d314dd3f704a02051ef5ea210993\" or sha1 =~ \"039130337e28a6623ecf9a0a3da7d92c5964d8dd\" or sha256 =~ \"c6cf82919b809967d9d90ea73772a8aa1c1eb3bc59252d977500f64f1a0d6731\"))|extend RuleId=\"d7654f02-e04b-4934-9838-65c46f187ebc\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_iox.yml\";\nlet q11=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\ncexe\" or TargetProcessName endswith \"\\\\ncatexe\" or TargetProcessName endswith \"\\\\netcatexe\") or (TargetProcessCommandLine contains \" -lvp \" or TargetProcessCommandLine contains \" -lvnp\" or TargetProcessCommandLine contains \" -l -v -p \" or TargetProcessCommandLine contains \" -lv -p \" or TargetProcessCommandLine contains \" -l --proxy-type http \" or TargetProcessCommandLine contains \" -vnl --exec \" or TargetProcessCommandLine contains \" -vnl -e \" or TargetProcessCommandLine contains \" --lua-exec \" or TargetProcessCommandLine contains \" --sh-exec \"))|extend RuleId=\"e31033fc-33f0-4020-9a16-faf9b31cbf08\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_netcat.yml\";\nlet q12=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \" tcp 139\" or TargetProcessCommandLine contains \" tcp 445\" or TargetProcessCommandLine contains \" tcp 3389\" or TargetProcessCommandLine contains \" tcp 5985\" or TargetProcessCommandLine contains \" tcp 5986\") or (TargetProcessCommandLine contains \" start \" and TargetProcessCommandLine contains \"--all\" and TargetProcessCommandLine contains \"--config\" and TargetProcessCommandLine contains \"yml\") or (TargetProcessName endswith \"ngrokexe\" and (TargetProcessCommandLine contains \" tcp \" or TargetProcessCommandLine contains \" http \" or TargetProcessCommandLine contains \" authtoken \")) or (TargetProcessCommandLine contains \"exe authtoken \" or TargetProcessCommandLine contains \"exe start --all\"))|extend RuleId=\"ee37eb7c-a4e7-4cd5-8fa4-efa27f1c3f31\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_ngrok.yml\";\nlet q13=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\nimgrabexe\" or (Hashes contains \"MD5=2DD44C3C29D667F5C0EF5F9D7C7FFB8B\" or Hashes contains \"SHA256=F266609E91985F0FE3E31C5E8FAEEEC4FFA5E0322D8B6F15FE69F4C5165B9559\" or Hashes contains \"IMPHASH=C07FDDD21D123EA9B3A08EEF44AAAC45\") or (md5 =~ \"2DD44C3C29D667F5C0EF5F9D7C7FFB8B\" or sha256 =~ \"F266609E91985F0FE3E31C5E8FAEEEC4FFA5E0322D8B6F15FE69F4C5165B9559\" or TargetProcessIMPHASH =~ \"C07FDDD21D123EA9B3A08EEF44AAAC45\"))|extend RuleId=\"74a12f18-505c-4114-8d0b-8448dd5485c6\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_nimgrab.yml\";\nlet q14=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \" runassystem \"|extend RuleId=\"d9047477-0359-48c9-b8c7-792cedcdc9c4\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_nircmd_as_system.yml\";\nlet q15=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\nmapexe\" or TargetProcessName endswith \"\\\\zennmapexe\") or (TargetProcessFilename =~ \"nmapexe\" or TargetProcessFilename =~ \"zennmapexe\"))|extend RuleId=\"f6ecd1cf-19b8-4488-97f6-00f0924991a3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_nmap_zenmap.yml\";\nlet q16=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\npcexe\" or (TargetProcessCommandLine contains \" -server=\" and TargetProcessCommandLine contains \" -vkey=\" and TargetProcessCommandLine contains \" -password=\") or TargetProcessCommandLine contains \" -config=npc\" or ((Hashes contains \"MD5=AE8ACF66BFE3A44148964048B826D005\" or Hashes contains \"SHA1=CEA49E9B9B67F3A13AD0BE1C2655293EA3C18181\" or Hashes contains \"SHA256=5A456283392FFCEEEACA3D3426C306EB470304637520D72FED1CC1FEBBBD6856\") or md5 =~ \"ae8acf66bfe3a44148964048b826d005\" or sha1 =~ \"cea49e9b9b67f3a13ad0be1c2655293ea3c18181\" or sha256 =~ \"5a456283392ffceeeaca3d3426c306eb470304637520d72fed1cc1febbbd6856\"))|extend RuleId=\"68d37776-61db-42f5-bf54-27e87072d17e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_nps.yml\";\nlet q17=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\NSudoexe\" or TargetProcessName endswith \"\\\\NSudoLCexe\" or TargetProcessName endswith \"\\\\NSudoLGexe\") or (TargetProcessFilename =~ \"NSudoexe\" or TargetProcessFilename =~ \"NSudoLCexe\" or TargetProcessFilename =~ \"NSudoLGexe\")) and (TargetProcessCommandLine contains \"-U:S \" or TargetProcessCommandLine contains \"-U:T \" or TargetProcessCommandLine contains \"-U:E \" or TargetProcessCommandLine contains \"-P:E \" or TargetProcessCommandLine contains \"-M:S \" or TargetProcessCommandLine contains \"-M:H \" or TargetProcessCommandLine contains \"-U=S \" or TargetProcessCommandLine contains \"-U=T \" or TargetProcessCommandLine contains \"-U=E \" or TargetProcessCommandLine contains \"-P=E \" or TargetProcessCommandLine contains \"-M=S \" or TargetProcessCommandLine contains \"-M=H \" or TargetProcessCommandLine contains \"-ShowWindowMode:Hide\"))|extend RuleId=\"771d1eb5-9587-4568-95fb-9ec44153a012\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_nsudo.yml\";\nlet q18=_Im_ProcessCreate\n| where ((TargetProcessName contains \"\\\\ProcessHacker_\" or TargetProcessName endswith \"\\\\ProcessHackerexe\" or (TargetProcessFilename =~ \"ProcessHackerexe\" or TargetProcessFilename =~ \"Process Hacker\") or TargetProcessFileDescription =~ \"Process Hacker\" or TargetProcessFileProduct =~ \"Process Hacker\") or (Hashes contains \"MD5=68F9B52895F4D34E74112F3129B3B00D\" or Hashes contains \"MD5=B365AF317AE730A67C936F21432B9C71\" or Hashes contains \"SHA1=A0BDFAC3CE1880B32FF9B696458327CE352E3B1D\" or Hashes contains \"SHA1=C5E2018BF7C0F314FED4FD7FE7E69FA2E648359E\" or Hashes contains \"SHA256=D4A0FE56316A2C45B9BA9AC1005363309A3EDC7ACF9E4DF64D326A0FF273E80F\" or Hashes contains \"SHA256=BD2C2CF0631D881ED382817AFCCE2B093F4E412FFB170A719E2762F250ABFEA4\" or Hashes contains \"IMPHASH=3695333C60DEDECDCAFF1590409AA462\" or Hashes contains \"IMPHASH=04DE0AD9C37EB7BD52043D2ECAC958DF\") or ((md5 =~ \"68f9b52895f4d34e74112f3129b3b00d\" or md5 =~ \"b365af317ae730a67c936f21432b9c71\") or (sha1 =~ \"c5e2018bf7c0f314fed4fd7fe7e69fa2e648359e\" or sha1 =~ \"a0bdfac3ce1880b32ff9b696458327ce352e3b1d\") or (sha256 =~ \"d4a0fe56316a2c45b9ba9ac1005363309a3edc7acf9e4df64d326a0ff273e80f\" or sha256 =~ \"bd2c2cf0631d881ed382817afcce2b093f4e412ffb170a719e2762f250abfea4\") or (TargetProcessIMPHASH =~ \"04de0ad9c37eb7bd52043d2ecac958df\" or TargetProcessIMPHASH =~ \"3695333c60dedecdcaff1590409aa462\")))|extend RuleId=\"811e0002-b13b-4a15-9d00-a613fce66e42\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_process_hacker.yml\";\nlet q19=_Im_ProcessCreate\n| where (TargetProcessFileDescription =~ \"Radmin Viewer\" or TargetProcessFileProduct =~ \"Radmin Viewer\" or TargetProcessFilename =~ \"Radminexe\")|extend RuleId=\"5817e76f-4804-41e6-8f1d-5fa0b3ecae2d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_radmin.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["CommandAndControl", "DefenseEvasion", "Discovery", "Persistence", "Execution", "Reconnaissance", "ResourceDevelopment", "PrivilegeEscalation", "LateralMovement", "CredentialAccess"],
                "techniques": ["T1095", "T1482", "T1072", "T1543", "T1069", "T1587", "T1046", "T1564", "T1003", "T1018", "T1590", "T1622", "T1027", "T1090", "T1562", "T1572", "T1105", "T1134", "T1569", "T1087"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000219",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}