{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000231')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000231')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation high 31",
                "description": "Sigma Windows Process Creation medium 31",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\svchostexe\" or TargetProcessName endswith \"\\\\rundll32exe\" or TargetProcessName endswith \"\\\\servicesexe\" or TargetProcessName endswith \"\\\\powershellexe\" or TargetProcessName endswith \"\\\\powershell_iseexe\" or TargetProcessName endswith \"\\\\pwshexe\" or TargetProcessName endswith \"\\\\regsvr32exe\" or TargetProcessName endswith \"\\\\spoolsvexe\" or TargetProcessName endswith \"\\\\lsassexe\" or TargetProcessName endswith \"\\\\smssexe\" or TargetProcessName endswith \"\\\\csrssexe\" or TargetProcessName endswith \"\\\\conhostexe\" or TargetProcessName endswith \"\\\\wininitexe\" or TargetProcessName endswith \"\\\\lsmexe\" or TargetProcessName endswith \"\\\\winlogonexe\" or TargetProcessName endswith \"\\\\explorerexe\" or TargetProcessName endswith \"\\\\taskhostexe\" or TargetProcessName endswith \"\\\\Taskmgrexe\" or TargetProcessName endswith \"\\\\sihostexe\" or TargetProcessName endswith \"\\\\RuntimeBrokerexe\" or TargetProcessName endswith \"\\\\smartscreenexe\" or TargetProcessName endswith \"\\\\dllhostexe\" or TargetProcessName endswith \"\\\\audiodgexe\" or TargetProcessName endswith \"\\\\wlanextexe\" or TargetProcessName endswith \"\\\\dashostexe\" or TargetProcessName endswith \"\\\\schtasksexe\" or TargetProcessName endswith \"\\\\cscriptexe\" or TargetProcessName endswith \"\\\\wscriptexe\" or TargetProcessName endswith \"\\\\wslexe\" or TargetProcessName endswith \"\\\\bitsadminexe\" or TargetProcessName endswith \"\\\\atbrokerexe\" or TargetProcessName endswith \"\\\\bcdeditexe\" or TargetProcessName endswith \"\\\\certutilexe\" or TargetProcessName endswith \"\\\\certreqexe\" or TargetProcessName endswith \"\\\\cmstpexe\" or TargetProcessName endswith \"\\\\consentexe\" or TargetProcessName endswith \"\\\\defragexe\" or TargetProcessName endswith \"\\\\dismexe\" or TargetProcessName endswith \"\\\\dllhst3gexe\" or TargetProcessName endswith \"\\\\eventvwrexe\" or TargetProcessName endswith \"\\\\msiexecexe\" or TargetProcessName endswith \"\\\\runonceexe\" or TargetProcessName endswith \"\\\\winverexe\" or TargetProcessName endswith \"\\\\logonuiexe\" or TargetProcessName endswith \"\\\\userinitexe\" or TargetProcessName endswith \"\\\\dwmexe\" or TargetProcessName endswith \"\\\\LsaIsoexe\" or TargetProcessName endswith \"\\\\ntoskrnlexe\" or TargetProcessName endswith \"\\\\wsmprovhostexe\" or TargetProcessName endswith \"\\\\dfrguiexe\") and (not((((TargetProcessName startswith \"C:\\\\Windows\\\\System32\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\SysWOW64\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\WinSxS\\\\\") or TargetProcessName contains \"\\\\SystemRoot\\\\System32\\\\\" or (TargetProcessName =~ \"C:\\\\Windows\\\\explorerexe\" or TargetProcessName =~ \"C:\\\\Program Files\\\\PowerShell\\\\7\\\\pwshexe\" or TargetProcessName =~ \"C:\\\\Program Files\\\\PowerShell\\\\7-preview\\\\pwshexe\")) or (TargetProcessName startswith \"C:\\\\Program Files\\\\WindowsApps\\\\MicrosoftCorporationIIWindowsSubsystemForLinux\" and TargetProcessName endswith \"\\\\wslexe\")))))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000230\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_system_exe_anomaly.yml\";\nlet q1=_Im_ProcessCreate\n| where (((TargetProcessIntegrityLevel =~ \"System\" and (TargetUsername contains \"AUTHORI\" or TargetUsername contains \"AUTORI\")) and ((TargetProcessName endswith \"\\\\calcexe\" or TargetProcessName endswith \"\\\\wscriptexe\" or TargetProcessName endswith \"\\\\cscriptexe\" or TargetProcessName endswith \"\\\\hhexe\" or TargetProcessName endswith \"\\\\mshtaexe\" or TargetProcessName endswith \"\\\\forfilesexe\" or TargetProcessName endswith \"\\\\pingexe\") or (TargetProcessCommandLine contains \" -NoP \" or TargetProcessCommandLine contains \" -W Hidden \" or TargetProcessCommandLine contains \" -decode \" or TargetProcessCommandLine contains \" /decode \" or TargetProcessCommandLine contains \" /urlcache \" or TargetProcessCommandLine contains \" -urlcache \" or TargetProcessCommandLine matches regex \"\".* -e.* JAB.*\"\" or TargetProcessCommandLine matches regex \"\".* -e.* SUVYI.*\"\" or TargetProcessCommandLine matches regex \"\".* -e.* SQBFAFgA.*\"\" or TargetProcessCommandLine matches regex \"\".* -e.* aWV4I.*\"\" or TargetProcessCommandLine matches regex \"\".* -e.* IAB.*\"\" or TargetProcessCommandLine matches regex \"\".* -e.* PAA.*\"\" or TargetProcessCommandLine matches regex \"\".* -e.* aQBlAHgA.*\"\" or TargetProcessCommandLine contains \"vssadmin delete shadows\" or TargetProcessCommandLine contains \"reg SAVE HKLM\" or TargetProcessCommandLine contains \" -ma \" or TargetProcessCommandLine contains \"Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\" or TargetProcessCommandLine contains \"downloadstring(\" or TargetProcessCommandLine contains \"downloadfile(\" or TargetProcessCommandLine contains \" /ticket:\" or TargetProcessCommandLine contains \"dpapi::\" or TargetProcessCommandLine contains \"event::clear\" or TargetProcessCommandLine contains \"event::drop\" or TargetProcessCommandLine contains \"id::modify\" or TargetProcessCommandLine contains \"kerberos::\" or TargetProcessCommandLine contains \"lsadump::\" or TargetProcessCommandLine contains \"misc::\" or TargetProcessCommandLine contains \"privilege::\" or TargetProcessCommandLine contains \"rpc::\" or TargetProcessCommandLine contains \"sekurlsa::\" or TargetProcessCommandLine contains \"sid::\" or TargetProcessCommandLine contains \"token::\" or TargetProcessCommandLine contains \"vault::cred\" or TargetProcessCommandLine contains \"vault::list\" or TargetProcessCommandLine contains \" p::d \" or TargetProcessCommandLine contains \";iex(\" or TargetProcessCommandLine contains \"MiniDump\" or TargetProcessCommandLine contains \"net user \"))) and (not((TargetProcessCommandLine =~ \"ping 127001 -n 5\" or (TargetProcessName endswith \"\\\\PINGEXE\" and ActingProcessCommandLine contains \"\\\\DismFoDInstallcmd\") or ActingProcessName startswith \"C:\\\\Packages\\\\Plugins\\\\MicrosoftGuestConfigurationConfigurationforWindows\\\\\" or (ActingProcessName startswith \"C:\\\\Program Files (x86)\\\\Java\\\\\" and ActingProcessName endswith \"\\\\bin\\\\javawsexe\" and TargetProcessName startswith \"C:\\\\Program Files (x86)\\\\Java\\\\\" and TargetProcessName endswith \"\\\\bin\\\\jp2launcherexe\" and TargetProcessCommandLine contains \" -ma \")))))|extend RuleId=\"2617e7ed-adb7-40ba-b0f3-8f9945fe6c09\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_system_user_anomaly.yml\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"echo \" or TargetProcessCommandLine contains \"copy \" or TargetProcessCommandLine contains \"type \" or TargetProcessCommandLine contains \"file createnew\") and (TargetProcessCommandLine contains \" C:\\\\Windows\\\\System32\\\\Tasks\\\\\" or TargetProcessCommandLine contains \" C:\\\\Windows\\\\SysWow64\\\\Tasks\\\\\"))|extend RuleId=\"cc4e02ba-9c06-48e2-b09e-2500cace9ae0\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_task_folder_evasion.yml\";\nlet q3=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"exe whoami\"|extend RuleId=\"e9142d84-fbe0-401d-ac50-3e519fb00c89\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_whoami_as_param.yml\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\controlexe\" and ActingProcessName endswith \"\\\\WorkFoldersexe\") and (not(TargetProcessName =~ \"C:\\\\Windows\\\\System32\\\\controlexe\")))|extend RuleId=\"0bbc6369-43e3-453d-9944-cae58821c173\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_workfolders.yml\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessCommandLine endswith \"svchostexe\" and TargetProcessName endswith \"\\\\svchostexe\") and (not(((ActingProcessName endswith \"\\\\rpcnetexe\" or ActingProcessName endswith \"\\\\rpcnetpexe\") or isnull(TargetProcessCommandLine)))))|extend RuleId=\"16c37b52-b141-42a5-a3ea-bbe098444397\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_svchost_execution_with_no_cli_flags.yml\";\nlet q6=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\svchostexe\" and (not(((ActingProcessName endswith \"\\\\servicesexe\" or ActingProcessName endswith \"\\\\MsMpEngexe\" or ActingProcessName endswith \"\\\\Mrtexe\" or ActingProcessName endswith \"\\\\rpcnetexe\" or ActingProcessName endswith \"\\\\ngenexe\" or ActingProcessName endswith \"\\\\TiWorkerexe\") or isnull(ActingProcessName) or ActingProcessName =~ \"\" or ActingProcessName =~ \"-\"))))|extend RuleId=\"01d2e2a1-5f09-44f7-9fc1-24faa7479b6d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_svchost_susp_parent_process.yml\";\nlet q7=_Im_ProcessCreate\n| where ((ActingProcessCommandLine contains \"\\\\svchostexe\" and ActingProcessCommandLine contains \"termsvcs\") and (not(((TargetProcessName endswith \"\\\\rdpclipexe\" or TargetProcessName endswith \":\\\\Windows\\\\System32\\\\csrssexe\" or TargetProcessName endswith \":\\\\Windows\\\\System32\\\\wininitexe\" or TargetProcessName endswith \":\\\\Windows\\\\System32\\\\winlogonexe\") or isnull(TargetProcessName)))))|extend RuleId=\"1012f107-b8f1-4271-af30-5aed2de89b39\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_svchost_termserv_proc_spawn.yml\";\nlet q8=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\ADExplorerexe\" or TargetProcessFilename =~ \"AdExp\") and TargetProcessCommandLine contains \"snapshot\" and (TargetProcessCommandLine contains \"\\\\Downloads\\\\\" or TargetProcessCommandLine contains \"\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\Temp\\\\\"))|extend RuleId=\"ef61af62-bc74-4f58-b49b-626448227652\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_adexplorer_susp_execution.yml\";\nlet q9=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\livekdexe\" or TargetProcessName endswith \"\\\\livekd64exe\") or TargetProcessFilename =~ \"livekdexe\") and (TargetProcessCommandLine contains \" /m\" and TargetProcessCommandLine contains \" -m\"))|extend RuleId=\"c7746f1c-47d3-43d6-8c45-cd1e54b6b0a2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_livekd_kernel_memory_dump.yml\";\nlet q10=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"copy procdump\" or TargetProcessCommandLine contains \"move procdump\") or ((TargetProcessCommandLine contains \"copy \" and TargetProcessCommandLine contains \"dmp \") and (TargetProcessCommandLine contains \"2dmp\" or TargetProcessCommandLine contains \"lsass\" or TargetProcessCommandLine contains \"outdmp\")) or (TargetProcessCommandLine contains \"copy lsassexe_\" or TargetProcessCommandLine contains \"move lsassexe_\"))|extend RuleId=\"79b06761-465f-4f88-9ef2-150e24d3d737\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_procdump_evasion.yml\";\nlet q11=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \" -ma \" or TargetProcessCommandLine contains \" /ma \") and TargetProcessCommandLine contains \" ls\")|extend RuleId=\"5afee48e-67dd-4e03-a783-f74259dcf998\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_procdump_lsass.yml\";\nlet q12=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \" -s cmd\" or TargetProcessCommandLine contains \" /s cmd\" or TargetProcessCommandLine contains \" -s -i cmd\" or TargetProcessCommandLine contains \" /s /i cmd\" or TargetProcessCommandLine contains \" /s -i cmd\" or TargetProcessCommandLine contains \" -s /i cmd\" or TargetProcessCommandLine contains \" -i -s cmd\" or TargetProcessCommandLine contains \" /i /s cmd\" or TargetProcessCommandLine contains \" -i /s cmd\" or TargetProcessCommandLine contains \" /i -s cmd\" or TargetProcessCommandLine contains \" -s pwsh\" or TargetProcessCommandLine contains \" /s pwsh\" or TargetProcessCommandLine contains \" -s -i pwsh\" or TargetProcessCommandLine contains \" /s /i pwsh\" or TargetProcessCommandLine contains \" /s -i pwsh\" or TargetProcessCommandLine contains \" -s /i pwsh\" or TargetProcessCommandLine contains \" -i -s pwsh\" or TargetProcessCommandLine contains \" /i /s pwsh\" or TargetProcessCommandLine contains \" -i /s pwsh\" or TargetProcessCommandLine contains \" /i -s pwsh\" or TargetProcessCommandLine contains \" -s powershell\" or TargetProcessCommandLine contains \" /s powershell\" or TargetProcessCommandLine contains \" -s -i powershell\" or TargetProcessCommandLine contains \" /s /i powershell\" or TargetProcessCommandLine contains \" /s -i powershell\" or TargetProcessCommandLine contains \" -s /i powershell\" or TargetProcessCommandLine contains \" -i -s powershell\" or TargetProcessCommandLine contains \" /i /s powershell\" or TargetProcessCommandLine contains \" -i /s powershell\" or TargetProcessCommandLine contains \" /i -s powershell\") and (TargetProcessCommandLine contains \"psexec\" or TargetProcessCommandLine contains \"paexec\" or TargetProcessCommandLine contains \"accepteula\"))|extend RuleId=\"8834e2f7-6b4b-4f09-8906-d2276470ee23\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_psexec_paexec_escalate_system.yml\";\nlet q13=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"accepteula\" and TargetProcessCommandLine contains \" -u \" and TargetProcessCommandLine contains \" -p \" and TargetProcessCommandLine contains \" \\\\\\\\\")|extend RuleId=\"ea011323-7045-460b-b2d7-0f7442ea6b38\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_psexec_remote_execution.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "Discovery", "Persistence", "InitialAccess", "Execution", "LateralMovement", "ResourceDevelopment", "PrivilegeEscalation", "CredentialAccess"],
                "techniques": ["T1055", "T1027", "T1218", "T1033", "T1552", "T1587", "T1190", "T1574", "T1036", "T1003", "T1134", "T1210"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000231",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}