{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-4c76-45a9-804d-dc3f355f2024')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-4c76-45a9-804d-dc3f355f2024')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation high 024",
                "description": "Sigma Windows Process Creation high 024",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"rundll32.exe\" and TargetProcessCommandLine contains \"Execute\" and TargetProcessCommandLine contains \"RegRead\" and TargetProcessCommandLine contains \"window.close\")|extend RuleId=\"1cc50f3f-1fc8-4acf-b2e9-6f172e1fdebd\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"rundll32\" and TargetProcessCommandLine contains \"javascript\" and TargetProcessCommandLine contains \"..\\\\..\\\\mshtml,RunHTMLApplication\") or TargetProcessCommandLine contains \";document.write();GetObject(\\\"script\")|extend RuleId=\"9f06447a-a33a-4cbe-a94f-a3f43184a7a3\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessFilename =~ \"RUNDLL32.EXE\") and (TargetProcessCommandLine contains \"keymgr\" and TargetProcessCommandLine contains \"KRShowKeyMgr\"))|extend RuleId=\"a4694263-59a8-4608-a3a0-6f8d3a51664c\";\nlet q3=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"\\\\..\\\\\" and TargetProcessCommandLine contains \"mshtml\" and TargetProcessCommandLine contains \"RunHTMLApplication\")|extend RuleId=\"4782eb5a-a513-4523-a0ac-f3082b26ac5c\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessCommandLine endswith \"\\\\rundll32.exe\" or TargetProcessCommandLine endswith \"\\\\rundll32.exe\\\"\" or TargetProcessCommandLine endswith \"\\\\rundll32\") and (not((ActingProcessName contains \"\\\\AppData\\\\Local\\\\\" or ActingProcessName contains \"\\\\Microsoft\\\\Edge\\\\\"))))|extend RuleId=\"1775e15e-b61b-4d14-a1a3-80981298085a\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessFilename =~ \"RUNDLL32.EXE\") and ((TargetProcessCommandLine contains \"C:\\\\windows\\\\system32\\\\davclnt.dll,DavSetCookie\" and TargetProcessCommandLine contains \"http\") and (TargetProcessCommandLine contains \"spoolss\" or TargetProcessCommandLine contains \"srvsvc\" or TargetProcessCommandLine contains \"/print/pipe/\")))|extend RuleId=\"bb76d96b-821c-47cf-944b-7ce377864492\";\nlet q6=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessFilename =~ \"RUNDLL32.EXE\" or TargetProcessCommandLine contains \"rundll32\") and ((TargetProcessCommandLine contains \"comsvcs\" and TargetProcessCommandLine contains \"full\") and (TargetProcessCommandLine contains \"#-\" or TargetProcessCommandLine contains \"#+\" or TargetProcessCommandLine contains \"#24\" or TargetProcessCommandLine contains \"24 \" or TargetProcessCommandLine contains \"MiniDump\"))) or ((TargetProcessCommandLine contains \"24\" and TargetProcessCommandLine contains \"comsvcs\" and TargetProcessCommandLine contains \"full\") and (TargetProcessCommandLine contains \" #\" or TargetProcessCommandLine contains \",#\" or TargetProcessCommandLine contains \", #\")))|extend RuleId=\"646ea171-dded-4578-8a4d-65e9822892e3\";\nlet q7=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessFilename =~ \"RUNDLL32.EXE\") and ((TargetProcessCommandLine contains \"-sta \" or TargetProcessCommandLine contains \"-localserver \") and (TargetProcessCommandLine contains \"{\" and TargetProcessCommandLine contains \"}\")))|extend RuleId=\"f1edd233-30b5-4823-9e6a-c4171b24d316\";\nlet q8=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessFilename =~ \"RUNDLL32.EXE\") and ((TargetProcessCommandLine contains \"shell32.dll\" and TargetProcessCommandLine contains \"Control_RunDLL\") and (TargetProcessCommandLine contains \"%AppData%\" or TargetProcessCommandLine contains \"%LocalAppData%\" or TargetProcessCommandLine contains \"%Temp%\" or TargetProcessCommandLine contains \"%tmp%\" or TargetProcessCommandLine contains \"\\\\AppData\\\\\" or TargetProcessCommandLine contains \"\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\Users\\\\Public\\\\\")))|extend RuleId=\"32b96012-7892-429e-b26c-ac2bf46066ff\";\nlet q9=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\rundll32.exe\" and TargetProcessName endswith \"\\\\explorer.exe\") and (not(ActingProcessCommandLine contains \"\\\\shell32.dll,Control_RunDLL\")))|extend RuleId=\"caa06de8-fdef-4c91-826a-7f9e163eef4b\";\nlet q10=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\System32\\\\control.exe\" and (TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessFilename =~ \"RUNDLL32.EXE\")) and (not(TargetProcessCommandLine contains \"Shell32.dll\")))|extend RuleId=\"d7eb979b-c2b5-4a6f-a3a7-c87ce6763819\";\nlet q11=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessFilename =~ \"RUNDLL32.exe\") and (TargetProcessCommandLine contains \".bmp\" or TargetProcessCommandLine contains \".cr2\" or TargetProcessCommandLine contains \".eps\" or TargetProcessCommandLine contains \".gif\" or TargetProcessCommandLine contains \".ico\" or TargetProcessCommandLine contains \".jpeg\" or TargetProcessCommandLine contains \".jpg\" or TargetProcessCommandLine contains \".nef\" or TargetProcessCommandLine contains \".orf\" or TargetProcessCommandLine contains \".png\" or TargetProcessCommandLine contains \".raw\" or TargetProcessCommandLine contains \".sr2\" or TargetProcessCommandLine contains \".tif\" or TargetProcessCommandLine contains \".tiff\"))|extend RuleId=\"4aa6040b-3f28-44e3-a769-9208e5feb5ec\";\nlet q12=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"ShellExec_RunDLL\" and (TargetProcessCommandLine contains \"regsvr32\" or TargetProcessCommandLine contains \"msiexec\" or TargetProcessCommandLine contains \"\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \"odbcconf\" or TargetProcessCommandLine contains \"\\\\Desktop\\\\\" or TargetProcessCommandLine contains \"\\\\Temp\\\\\" or TargetProcessCommandLine contains \"Invoke-\" or TargetProcessCommandLine contains \"iex\" or TargetProcessCommandLine contains \"comspec\"))|extend RuleId=\"d87bd452-6da1-456e-8155-7dc988157b7d\";\nlet q13=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \"rundll32\" and TargetProcessCommandLine contains \"apphelp.dll\") and (TargetProcessCommandLine contains \"ShimFlushCache\" or TargetProcessCommandLine contains \"#250\")) or ((TargetProcessCommandLine contains \"rundll32\" and TargetProcessCommandLine contains \"kernel32.dll\") and (TargetProcessCommandLine contains \"BaseFlushAppcompatCache\" or TargetProcessCommandLine contains \"#46\")))|extend RuleId=\"b0524451-19af-4efa-a46f-562a977f792e\";\nlet q14=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"rundll32.exe\" and (TargetProcessCommandLine contains \".sys,\" or TargetProcessCommandLine contains \".sys \"))|extend RuleId=\"731231b9-0b5d-4219-94dd-abb6959aa7ea\";\nlet q15=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessFilename =~ \"RUNDLL32.EXE\" or TargetProcessCommandLine contains \"rundll32\") and TargetProcessCommandLine contains \" \\\\\\\\\")|extend RuleId=\"5cdb711b-5740-4fb2-ba88-f7945027afac\";\nlet q16=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\svchost.exe\" and ActingProcessCommandLine contains \"-s WebClient\" and TargetProcessName endswith \"\\\\rundll32.exe\" and TargetProcessCommandLine contains \"C:\\\\windows\\\\system32\\\\davclnt.dll,DavSetCookie\" and TargetProcessCommandLine matches regex \"://\\\\d{1,3}\\\\.\\\\d{1,3}\\\\.\\\\d{1,3}\\\\.\\\\d{1,3}\") and (not((TargetProcessCommandLine contains \"://10.\" or TargetProcessCommandLine contains \"://192.168.\" or TargetProcessCommandLine contains \"://172.16.\" or TargetProcessCommandLine contains \"://172.17.\" or TargetProcessCommandLine contains \"://172.18.\" or TargetProcessCommandLine contains \"://172.19.\" or TargetProcessCommandLine contains \"://172.20.\" or TargetProcessCommandLine contains \"://172.21.\" or TargetProcessCommandLine contains \"://172.22.\" or TargetProcessCommandLine contains \"://172.23.\" or TargetProcessCommandLine contains \"://172.24.\" or TargetProcessCommandLine contains \"://172.25.\" or TargetProcessCommandLine contains \"://172.26.\" or TargetProcessCommandLine contains \"://172.27.\" or TargetProcessCommandLine contains \"://172.28.\" or TargetProcessCommandLine contains \"://172.29.\" or TargetProcessCommandLine contains \"://172.30.\" or TargetProcessCommandLine contains \"://172.31.\" or TargetProcessCommandLine contains \"://127.\" or TargetProcessCommandLine contains \"://169.254.\"))))|extend RuleId=\"982e9f2d-1a85-4d5b-aea4-31f5e97c6555\";\nlet q17=_Im_ProcessCreate\n| where (TargetProcessCommandLine =~ \"rundll32.exe\" or TargetProcessCommandLine =~ \"rundll32\")|extend RuleId=\"5bb68627-3198-40ca-b458-49f973db8752\";\nlet q18=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\schtasks.exe\" and (TargetProcessCommandLine contains \"/Create\" and TargetProcessCommandLine contains \"/RU\" and TargetProcessCommandLine contains \"/TR\" and TargetProcessCommandLine contains \"C:\\\\Users\\\\\" and TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\\") and (TargetProcessCommandLine contains \"NT AUT\" or TargetProcessCommandLine contains \" SYSTEM \")) and (not(((ActingProcessName contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" and ActingProcessName contains \"TeamViewer_.exe\") and TargetProcessName endswith \"\\\\schtasks.exe\" and TargetProcessCommandLine contains \"/TN TVInstallRestore\"))))|extend RuleId=\"c5c00f49-b3f9-45a6-997e-cfdecc6e1967\";\nlet q19=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\schtasks.exe\" and (TargetProcessCommandLine contains \" /Change \" and TargetProcessCommandLine contains \" /TN \")) and (TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\\" or TargetProcessCommandLine contains \"\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \"\\\\WINDOWS\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\Desktop\\\\\" or TargetProcessCommandLine contains \"\\\\Downloads\\\\\" or TargetProcessCommandLine contains \"\\\\Temporary Internet\" or TargetProcessCommandLine contains \"C:\\\\ProgramData\\\\\" or TargetProcessCommandLine contains \"C:\\\\Perflogs\\\\\" or TargetProcessCommandLine contains \"%ProgramData%\" or TargetProcessCommandLine contains \"%appdata%\" or TargetProcessCommandLine contains \"%comspec%\" or TargetProcessCommandLine contains \"%localappdata%\") and (TargetProcessCommandLine contains \"regsvr32\" or TargetProcessCommandLine contains \"rundll32\" or TargetProcessCommandLine contains \"cmd /c \" or TargetProcessCommandLine contains \"cmd /k \" or TargetProcessCommandLine contains \"cmd /r \" or TargetProcessCommandLine contains \"cmd.exe /c \" or TargetProcessCommandLine contains \"cmd.exe /k \" or TargetProcessCommandLine contains \"cmd.exe /r \" or TargetProcessCommandLine contains \"powershell\" or TargetProcessCommandLine contains \"mshta\" or TargetProcessCommandLine contains \"wscript\" or TargetProcessCommandLine contains \"cscript\" or TargetProcessCommandLine contains \"certutil\" or TargetProcessCommandLine contains \"bitsadmin\" or TargetProcessCommandLine contains \"bash.exe\" or TargetProcessCommandLine contains \"bash \" or TargetProcessCommandLine contains \"scrcons\" or TargetProcessCommandLine contains \"wmic \" or TargetProcessCommandLine contains \"wmic.exe\" or TargetProcessCommandLine contains \"forfiles\" or TargetProcessCommandLine contains \"scriptrunner\" or TargetProcessCommandLine contains \"hh.exe\" or TargetProcessCommandLine contains \"hh \"))|extend RuleId=\"1c0e41cd-21bb-4433-9acc-4a2cd6367b9b\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["PrivilegeEscalation", "LateralMovement", "DefenseEvasion", "Exfiltration", "CredentialAccess", "Persistence", "Execution"],
                "techniques": ["T1218", "T1048", "T1053", "T1570", "T1003", "T1555", "T1059", "T1036", "T1546", "T1021", "T1055", "T1212", "T1569", "T1202", "T1112"],
                "alertRuleTemplateName": "5163A000-4c76-45a9-804d-dc3f355f2024",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}