{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000213')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000213')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 13",
                "description": "Sigma Windows Process Creation medium 13",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"QWRkLU1wUHJlZmVyZW5jZS\"\n| where TargetProcessCommandLine contains \"FkZC1NcFByZWZlcmVuY2Ug\"\n| where TargetProcessCommandLine contains \"BZGQtTXBQcmVmZXJlbmNlI\"\n| where TargetProcessCommandLine contains \"U2V0LU1wUHJlZmVyZW5jZS\"\n| where TargetProcessCommandLine contains \"NldC1NcFByZWZlcmVuY2Ug\"\n| where TargetProcessCommandLine contains \"TZXQtTXBQcmVmZXJlbmNlI\"\n| where TargetProcessCommandLine contains \"YWRkLW1wcHJlZmVyZW5jZS\"\n| where TargetProcessCommandLine contains \"FkZC1tcHByZWZlcmVuY2Ug\"\n| where TargetProcessCommandLine contains \"hZGQtbXBwcmVmZXJlbmNlI\"\n| where TargetProcessCommandLine contains \"c2V0LW1wcHJlZmVyZW5jZS\"\n| where TargetProcessCommandLine contains \"NldC1tcHByZWZlcmVuY2Ug\"\n| where TargetProcessCommandLine contains \"zZXQtbXBwcmVmZXJlbmNlI\"\n| where (( or  or  or ) or (TargetProcessCommandLine contains \"QQBkAGQALQBNAHAAUAByAGUAZgBlAHIAZQBuAGMAZQAgA\" or TargetProcessCommandLine contains \"EAZABkAC0ATQBwAFAAcgBlAGYAZQByAGUAbgBjAGUAIA\" or TargetProcessCommandLine contains \"BAGQAZAAtAE0AcABQAHIAZQBmAGUAcgBlAG4AYwBlACAA\" or TargetProcessCommandLine contains \"UwBlAHQALQBNAHAAUAByAGUAZgBlAHIAZQBuAGMAZQAgA\" or TargetProcessCommandLine contains \"MAZQB0AC0ATQBwAFAAcgBlAGYAZQByAGUAbgBjAGUAIA\" or TargetProcessCommandLine contains \"TAGUAdAAtAE0AcABQAHIAZQBmAGUAcgBlAG4AYwBlACAA\" or TargetProcessCommandLine contains \"YQBkAGQALQBtAHAAcAByAGUAZgBlAHIAZQBuAGMAZQAgA\" or TargetProcessCommandLine contains \"EAZABkAC0AbQBwAHAAcgBlAGYAZQByAGUAbgBjAGUAIA\" or TargetProcessCommandLine contains \"hAGQAZAAtAG0AcABwAHIAZQBmAGUAcgBlAG4AYwBlACAA\" or TargetProcessCommandLine contains \"cwBlAHQALQBtAHAAcAByAGUAZgBlAHIAZQBuAGMAZQAgA\" or TargetProcessCommandLine contains \"MAZQB0AC0AbQBwAHAAcgBlAGYAZQByAGUAbgBjAGUAIA\" or TargetProcessCommandLine contains \"zAGUAdAAtAG0AcABwAHIAZQBmAGUAcgBlAG4AYwBlACAA\"))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000212\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_base64_mppreference.yml\";\nlet q1=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"WwBSAGUAZgBsAGUAYwB0AGkAbwBuAC4AQQBzAHMAZQBtAGIAbAB5AF0AOgA6AEwAbwBhAGQAKA\" or TargetProcessCommandLine contains \"sAUgBlAGYAbABlAGMAdABpAG8AbgAuAEEAcwBzAGUAbQBiAGwAeQBdADoAOgBMAG8AYQBkACgA\" or TargetProcessCommandLine contains \"bAFIAZQBmAGwAZQBjAHQAaQBvAG4ALgBBAHMAcwBlAG0AYgBsAHkAXQA6ADoATABvAGEAZAAoA\" or TargetProcessCommandLine contains \"AFsAcgBlAGYAbABlAGMAdABpAG8AbgAuAGEAcwBzAGUAbQBiAGwAeQBdADoAOgAoACIATABvAGEAZAAiAC\" or TargetProcessCommandLine contains \"BbAHIAZQBmAGwAZQBjAHQAaQBvAG4ALgBhAHMAcwBlAG0AYgBsAHkAXQA6ADoAKAAiAEwAbwBhAGQAIgAp\" or TargetProcessCommandLine contains \"AWwByAGUAZgBsAGUAYwB0AGkAbwBuAC4AYQBzAHMAZQBtAGIAbAB5AF0AOgA6ACgAIgBMAG8AYQBkACIAK\" or TargetProcessCommandLine contains \"WwBSAGUAZgBsAGUAYwB0AGkAbwBuAC4AQQBzAHMAZQBtAGIAbAB5AF0AOgA6ACgAIgBMAG8AYQBkACIAKQ\" or TargetProcessCommandLine contains \"sAUgBlAGYAbABlAGMAdABpAG8AbgAuAEEAcwBzAGUAbQBiAGwAeQBdADoAOgAoACIATABvAGEAZAAiACkA\" or TargetProcessCommandLine contains \"bAFIAZQBmAGwAZQBjAHQAaQBvAG4ALgBBAHMAcwBlAG0AYgBsAHkAXQA6ADoAKAAiAEwAbwBhAGQAIgApA\" or TargetProcessCommandLine contains \"WwByAGUAZgBsAGUAYwB0AGkAbwBuAC4AYQBzAHMAZQBtAGIAbAB5AF0AOgA6AEwAbwBhAGQAKA\" or TargetProcessCommandLine contains \"sAcgBlAGYAbABlAGMAdABpAG8AbgAuAGEAcwBzAGUAbQBiAGwAeQBdADoAOgBMAG8AYQBkACgA\" or TargetProcessCommandLine contains \"bAHIAZQBmAGwAZQBjAHQAaQBvAG4ALgBhAHMAcwBlAG0AYgBsAHkAXQA6ADoATABvAGEAZAAoA\")|extend RuleId=\"62b7ccc9-23b4-471e-aa15-6da3663c4d59\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_base64_reflection_assembly_load.yml\";\nlet q2=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"OgA6ACgAIgBMACIAKwAiAG8AYQBkACIAKQ\" or TargetProcessCommandLine contains \"oAOgAoACIATAAiACsAIgBvAGEAZAAiACkA\" or TargetProcessCommandLine contains \"6ADoAKAAiAEwAIgArACIAbwBhAGQAIgApA\" or TargetProcessCommandLine contains \"OgA6ACgAIgBMAG8AIgArACIAYQBkACIAKQ\" or TargetProcessCommandLine contains \"oAOgAoACIATABvACIAKwAiAGEAZAAiACkA\" or TargetProcessCommandLine contains \"6ADoAKAAiAEwAbwAiACsAIgBhAGQAIgApA\" or TargetProcessCommandLine contains \"OgA6ACgAIgBMAG8AYQAiACsAIgBkACIAKQ\" or TargetProcessCommandLine contains \"oAOgAoACIATABvAGEAIgArACIAZAAiACkA\" or TargetProcessCommandLine contains \"6ADoAKAAiAEwAbwBhACIAKwAiAGQAIgApA\" or TargetProcessCommandLine contains \"OgA6ACgAJwBMACcAKwAnAG8AYQBkACcAKQ\" or TargetProcessCommandLine contains \"oAOgAoACcATAAnACsAJwBvAGEAZAAnACkA\" or TargetProcessCommandLine contains \"6ADoAKAAnAEwAJwArACcAbwBhAGQAJwApA\" or TargetProcessCommandLine contains \"OgA6ACgAJwBMAG8AJwArACcAYQBkACcAKQ\" or TargetProcessCommandLine contains \"oAOgAoACcATABvACcAKwAnAGEAZAAnACkA\" or TargetProcessCommandLine contains \"6ADoAKAAnAEwAbwAnACsAJwBhAGQAJwApA\" or TargetProcessCommandLine contains \"OgA6ACgAJwBMAG8AYQAnACsAJwBkACcAKQ\" or TargetProcessCommandLine contains \"oAOgAoACcATABvAGEAJwArACcAZAAnACkA\" or TargetProcessCommandLine contains \"6ADoAKAAnAEwAbwBhACcAKwAnAGQAJwApA\")|extend RuleId=\"9c0295ce-d60d-40bd-bd74-84673b7592b1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_base64_reflection_assembly_load_obfusc.yml\";\nlet q3=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and ((TargetProcessCommandLine contains \"VwBpAG4AMwAyAF8AUwBoAGEAZABvAHcAYwBvAHAAeQ\" or TargetProcessCommandLine contains \"cAaQBuADMAMgBfAFMAaABhAGQAbwB3AGMAbwBwAHkA\" or TargetProcessCommandLine contains \"XAGkAbgAzADIAXwBTAGgAYQBkAG8AdwBjAG8AcAB5A\" or TargetProcessCommandLine contains \"V2luMzJfU2hhZG93Y29we\" or TargetProcessCommandLine contains \"dpbjMyX1NoYWRvd2NvcH\" or TargetProcessCommandLine contains \"XaW4zMl9TaGFkb3djb3B5\") or (TargetProcessCommandLine contains \"VwBpAG4AMwAyAF8AUwBjAGgAZQBkAHUAbABlAGQASgBvAGIA\" or TargetProcessCommandLine contains \"cAaQBuADMAMgBfAFMAYwBoAGUAZAB1AGwAZQBkAEoAbwBiA\" or TargetProcessCommandLine contains \"XAGkAbgAzADIAXwBTAGMAaABlAGQAdQBsAGUAZABKAG8AYg\" or TargetProcessCommandLine contains \"V2luMzJfU2NoZWR1bGVkSm9i\" or TargetProcessCommandLine contains \"dpbjMyX1NjaGVkdWxlZEpvY\" or TargetProcessCommandLine contains \"XaW4zMl9TY2hlZHVsZWRKb2\") or (TargetProcessCommandLine contains \"VwBpAG4AMwAyAF8AUAByAG8AYwBlAHMAcw\" or TargetProcessCommandLine contains \"cAaQBuADMAMgBfAFAAcgBvAGMAZQBzAHMA\" or TargetProcessCommandLine contains \"XAGkAbgAzADIAXwBQAHIAbwBjAGUAcwBzA\" or TargetProcessCommandLine contains \"V2luMzJfUHJvY2Vzc\" or TargetProcessCommandLine contains \"dpbjMyX1Byb2Nlc3\" or TargetProcessCommandLine contains \"XaW4zMl9Qcm9jZXNz\") or (TargetProcessCommandLine contains \"VwBpAG4AMwAyAF8AVQBzAGUAcgBBAGMAYwBvAHUAbgB0A\" or TargetProcessCommandLine contains \"cAaQBuADMAMgBfAFUAcwBlAHIAQQBjAGMAbwB1AG4AdA\" or TargetProcessCommandLine contains \"XAGkAbgAzADIAXwBVAHMAZQByAEEAYwBjAG8AdQBuAHQA\" or TargetProcessCommandLine contains \"V2luMzJfVXNlckFjY291bn\" or TargetProcessCommandLine contains \"dpbjMyX1VzZXJBY2NvdW50\" or TargetProcessCommandLine contains \"XaW4zMl9Vc2VyQWNjb3Vud\") or (TargetProcessCommandLine contains \"VwBpAG4AMwAyAF8ATABvAGcAZwBlAGQATwBuAFUAcwBlAHIA\" or TargetProcessCommandLine contains \"cAaQBuADMAMgBfAEwAbwBnAGcAZQBkAE8AbgBVAHMAZQByA\" or TargetProcessCommandLine contains \"XAGkAbgAzADIAXwBMAG8AZwBnAGUAZABPAG4AVQBzAGUAcg\" or TargetProcessCommandLine contains \"V2luMzJfTG9nZ2VkT25Vc2Vy\" or TargetProcessCommandLine contains \"dpbjMyX0xvZ2dlZE9uVXNlc\" or TargetProcessCommandLine contains \"XaW4zMl9Mb2dnZWRPblVzZX\")))|extend RuleId=\"1816994b-42e1-4fb1-afd2-134d88184f71\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_base64_wmi_classes.yml\";\nlet q4=_Im_ProcessCreate\n| where ((((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and (TargetProcessCommandLine contains \"hctac\" or TargetProcessCommandLine contains \"kaerb\" or TargetProcessCommandLine contains \"dnammoc\" or TargetProcessCommandLine contains \"ekovn\" or TargetProcessCommandLine contains \"eliFd\" or TargetProcessCommandLine contains \"rahc\" or TargetProcessCommandLine contains \"etirw\" or TargetProcessCommandLine contains \"golon\" or TargetProcessCommandLine contains \"tninon\" or TargetProcessCommandLine contains \"eddih\" or TargetProcessCommandLine contains \"tpircS\" or TargetProcessCommandLine contains \"ssecorp\" or TargetProcessCommandLine contains \"llehsrewop\" or TargetProcessCommandLine contains \"esnopser\" or TargetProcessCommandLine contains \"daolnwod\" or TargetProcessCommandLine contains \"tneilCbeW\" or TargetProcessCommandLine contains \"tneilc\" or TargetProcessCommandLine contains \"ptth\" or TargetProcessCommandLine contains \"elifotevas\" or TargetProcessCommandLine contains \"46esab\" or TargetProcessCommandLine contains \"htaPpmeTteG\" or TargetProcessCommandLine contains \"tcejbO\" or TargetProcessCommandLine contains \"maerts\" or TargetProcessCommandLine contains \"hcaerof\" or TargetProcessCommandLine contains \"retupmoc\")) and (not((TargetProcessCommandLine contains \" -EncodedCommand \" or TargetProcessCommandLine contains \" -enc \"))))|extend RuleId=\"b6b49cd1-34d6-4ead-b1bf-176e9edba9a4\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_cmdline_reversed_strings.yml\";\nlet q5=_Im_ProcessCreate\n| where ((((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and (TargetProcessCommandLine matches regex \".*\\\\+.*\\\\+.*\\\\+.*\\\\+.*\\\\+.*\\\\+.*\\\\+.*\\\\+.*\\\\+.*\\\\+.*\\\\+.*\\\\+.*\\\\+.*\\\\+.*\" or TargetProcessCommandLine matches regex \".*\\\\{.*\\\\{.*\\\\{.*\\\\{.*\\\\{.*\\\\{.*\\\\{.*\\\\{.*\\\\{.*\\\\{.*\" or TargetProcessCommandLine matches regex \".*\\\\^.*\\\\^.*\\\\^.*\\\\^.*\\\\^.*\" or TargetProcessCommandLine matches regex \".*`.*`.*`.*`.*`.*\")) and (not((ActingProcessName =~ \"C:\\\\Program Files\\\\Amazon\\\\SSM\\\\ssm-document-worker.exe\" or (TargetProcessCommandLine contains \"new EventSource(\\\"Microsoft.Windows.Sense.Client.Management\\\"\" or TargetProcessCommandLine contains \"public static extern bool InstallELAMCertificateInfo(SafeFileHandle handle);\")))))|extend RuleId=\"d7bcd677-645d-4691-a8d4-7a5602b780d1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_cmdline_special_characters.yml\";\nlet q6=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") and (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and (TargetProcessCommandLine contains \"Get-ChildItem \" or TargetProcessCommandLine contains \"dir \" or TargetProcessCommandLine contains \"gci \" or TargetProcessCommandLine contains \"ls \") and (TargetProcessCommandLine contains \"Get-Content \" or TargetProcessCommandLine contains \"gc \" or TargetProcessCommandLine contains \"cat \" or TargetProcessCommandLine contains \"type \") and (TargetProcessCommandLine contains \" ^| \" and TargetProcessCommandLine contains \"\\*.lnk\" and TargetProcessCommandLine contains \"-Recurse\" and TargetProcessCommandLine contains \"-Skip \"))|extend RuleId=\"434c08ba-8406-4d15-8b24-782cb071a691\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_decrypt_pattern.yml\";\nunion q0, q1, q2, q3, q4, q5, q6;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "Execution"],
                "techniques": ["T1059", "T1620", "T1027", "T1562"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000213",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}