{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000112')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000112')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation low 12",
                "description": "Sigma Windows Process Creation low 12",
                "severity": "low",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\perl.exe\" or TargetProcessFilename =~ \"perl.exe\") and TargetProcessCommandLine contains \" -e\")|extend RuleId=\"f426547a-e0f7-441a-b63e-854ac5bdf54d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_perl_inline_command_execution.yml\"|extend RuleTitle=\"Perl Inline Command Execution\"|extend RuleDescription=\"\"Detects execution of perl using the \\\"-e\\\"/\\\"-E\\\" flags. This is could be used as a way to launch a reverse shell or execute live perl code.\"\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\php.exe\" or TargetProcessFilename =~ \"php.exe\") and TargetProcessCommandLine contains \" -r\")|extend RuleId=\"d81871ef-5738-47ab-9797-7a9c90cd4bfb\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_php_inline_command_execution.yml\"|extend RuleTitle=\"Php Inline Command Execution\"|extend RuleDescription=\"\"Detects execution of php using the \\\"-r\\\" flag. This is could be used as a way to launch a reverse shell or execute live php code.\"\";\nlet q2=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\pktmon.exe\" or TargetProcessFilename =~ \"PktMon.exe\")|extend RuleId=\"f956c7c1-0f60-4bc5-b7d7-b39ab3c08908\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pktmon_execution.yml\"|extend RuleTitle=\"PktMon.EXE Execution\"|extend RuleDescription=\"\"Detects execution of PktMon, a tool that captures network packets.\"\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\powercfg.exe\" or TargetProcessFilename =~ \"PowerCfg.exe\") and ((TargetProcessCommandLine contains \"/setacvalueindex \" and TargetProcessCommandLine contains \"SCHEME_CURRENT\" and TargetProcessCommandLine contains \"SUB_VIDEO\" and TargetProcessCommandLine contains \"VIDEOCONLOCK\") or (TargetProcessCommandLine contains \"-change \" and TargetProcessCommandLine contains \"-standby-timeout-\")))|extend RuleId=\"f8d6a15e-4bc8-4c27-8e5d-2b10f0b73e5b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powercfg_execution.yml\"|extend RuleTitle=\"Suspicious Powercfg Execution To Change Lock Screen Timeout\"|extend RuleDescription=\"\"Detects suspicious execution of 'Powercfg.exe' to change lock screen timeout\"\";\nlet q4=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and (TargetProcessCommandLine contains \"Import-Module \" or TargetProcessCommandLine contains \"ipmo \") and TargetProcessCommandLine contains \"Microsoft.ActiveDirectory.Management.dll\")|extend RuleId=\"70bc5215-526f-4477-963c-a47a5c9ebd12\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_active_directory_module_dll_import.yml\"|extend RuleTitle=\"Potential Active Directory Enumeration Using AD Module - ProcCreation\"|extend RuleDescription=\"\"Detects usage of the \\\"Import-Module\\\" cmdlet to load the \\\"Microsoft.ActiveDirectory.Management.dl\\\" DLL. Which is often used by attackers to perform AD enumeration.\"\";\nlet q5=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and TargetProcessCommandLine contains \"Add-WindowsCapability\" and TargetProcessCommandLine contains \"OpenSSH.\")|extend RuleId=\"b36d01a3-ddaf-4804-be18-18a6247adfcd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_add_windows_capability.yml\"|extend RuleTitle=\"Add Windows Capability Via PowerShell Cmdlet\"|extend RuleDescription=\"\"Detects usage of the \\\"Add-WindowsCapability\\\" cmdlet to add Windows capabilities. Notable capabilities could be \\\"OpenSSH\\\" and others.\"\";\nlet q6=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"if(0){{{0}}}' -f $(0 -as [char]) +\" or TargetProcessCommandLine contains \"#<NULL>\")|extend RuleId=\"92a974db-ab84-457f-9ec0-55db83d7a825\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_amsi_null_bits_bypass.yml\"|extend RuleTitle=\"Potential AMSI Bypass Using NULL Bits\"|extend RuleDescription=\"\"Detects usage of special strings/null bits in order to potentially bypass AMSI functionalities\"\";\nlet q7=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"WindowsAudioDevice-Powershell-Cmdlet\" or TargetProcessCommandLine contains \"Toggle-AudioDevice\" or TargetProcessCommandLine contains \"Get-AudioDevice \" or TargetProcessCommandLine contains \"Set-AudioDevice \" or TargetProcessCommandLine contains \"Write-AudioDevice \")|extend RuleId=\"932fb0d8-692b-4b0f-a26e-5643a50fe7d6\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_audio_capture.yml\"|extend RuleTitle=\"Audio Capture via PowerShell\"|extend RuleDescription=\"\"Detects audio capture via PowerShell Cmdlet.\"\";\nlet q8=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"SyncInvoke \"|extend RuleId=\"a0459f02-ac51-4c09-b511-b8c9203fc429\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_cl_invocation.yml\"|extend RuleTitle=\"Potential Process Execution Proxy Via CL_Invocation.ps1\"|extend RuleDescription=\"\"Detects calls to \\\"SyncInvoke\\\" that is part of the \\\"CL_Invocation.ps1\\\" script to proxy execution using \\\"System.Diagnostics.Process\\\"\"\";\nlet q9=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"LoadAssemblyFromPath \" or TargetProcessCommandLine contains \"LoadAssemblyFromNS \")|extend RuleId=\"c57872c7-614f-4d7f-a40d-b78c8df2d30d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_cl_loadassembly.yml\"|extend RuleTitle=\"Assembly Loading Via CL_LoadAssembly.ps1\"|extend RuleDescription=\"\"Detects calls to \\\"LoadAssemblyFromPath\\\" or \\\"LoadAssemblyFromNS\\\" that are part of the \\\"CL_LoadAssembly.ps1\\\" script. This can be abused to load different assemblies and bypass App locker controls.\"\";\nlet q10=_Im_ProcessCreate\n| where (((ActingProcessName endswith \"\\\\powershell.exe\" or ActingProcessName endswith \"\\\\pwsh.exe\") and TargetProcessName endswith \"\\\\powershell.exe\" and TargetProcessCommandLine contains \" -nologo -windowstyle minimized -file \") and (TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\Temp\\\\\"))|extend RuleId=\"1e0e1a81-e79b-44bc-935b-ddb9c8006b3d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_cl_mutexverifiers.yml\"|extend RuleTitle=\"Potential Script Proxy Execution Via CL_Mutexverifiers.ps1\"|extend RuleDescription=\"\"Detects the use of the Microsoft signed script \\\"CL_mutexverifiers\\\" to proxy the execution of additional PowerShell script commands\"\";\nlet q11=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and TargetProcessCommandLine contains \"ConvertTo-SecureString\")|extend RuleId=\"74403157-20f5-415d-89a7-c505779585cf\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_cmdline_convertto_securestring.yml\"|extend RuleTitle=\"ConvertTo-SecureString Cmdlet Usage Via CommandLine\"|extend RuleDescription=\"\"Detects usage of the \\\"ConvertTo-SecureString\\\" cmdlet via the commandline. Which is fairly uncommon and could indicate potential suspicious activity\"\";\nlet q12=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and ((TargetProcessCommandLine contains \"Get-ADComputer \" and TargetProcessCommandLine contains \" -Filter \\*\") and (TargetProcessCommandLine contains \" > \" or TargetProcessCommandLine contains \" | Select \" or TargetProcessCommandLine contains \"Out-File\" or TargetProcessCommandLine contains \"Set-Content\" or TargetProcessCommandLine contains \"Add-Content\")))|extend RuleId=\"435e10e4-992a-4281-96f3-38b11106adde\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_computer_discovery_get_adcomputer.yml\"|extend RuleTitle=\"Computer Discovery And Export Via Get-ADComputer Cmdlet\"|extend RuleDescription=\"\"Detects usage of the Get-ADComputer cmdlet to collect computer information and output it to a file\"\";\nlet q13=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"GZipStream\" and TargetProcessCommandLine contains \"::Decompress\")|extend RuleId=\"98767d61-b2e8-4d71-b661-e36783ee24c1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_decode_gzip.yml\"|extend RuleTitle=\"Gzip Archive Decode Via PowerShell\"|extend RuleDescription=\"\"Detects attempts of decoding encoded Gzip archives via PowerShell.\"\";\nlet q14=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"Add-MpPreference \" or TargetProcessCommandLine contains \"Set-MpPreference \") and (TargetProcessCommandLine contains \" -ExclusionPath \" or TargetProcessCommandLine contains \" -ExclusionExtension \" or TargetProcessCommandLine contains \" -ExclusionProcess \" or TargetProcessCommandLine contains \" -ExclusionIpAddress \"))|extend RuleId=\"17769c90-230e-488b-a463-e05c08e9d48f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_defender_exclusion.yml\"|extend RuleTitle=\"Powershell Defender Exclusion\"|extend RuleDescription=\"\"Detects requests to exclude files, folders or processes from Antivirus scanning using PowerShell cmdlets\"\";\nlet q15=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\powershell_ise.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and (TargetProcessCommandLine contains \"Set-NetFirewallProfile \" and TargetProcessCommandLine contains \" -Enabled \" and TargetProcessCommandLine contains \" False\") and (TargetProcessCommandLine contains \" -All \" or TargetProcessCommandLine contains \"Public\" or TargetProcessCommandLine contains \"Domain\" or TargetProcessCommandLine contains \"Private\"))|extend RuleId=\"12f6b752-042d-483e-bf9c-915a6d06ad75\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_disable_firewall.yml\"|extend RuleTitle=\"Windows Firewall Disabled via PowerShell\"|extend RuleDescription=\"\"Detects attempts to disable the Windows Firewall using PowerShell\"\";\nlet q16=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\powershell.exe\" and (TargetProcessCommandLine contains \" -version 2 \" or TargetProcessCommandLine contains \" -versio 2 \" or TargetProcessCommandLine contains \" -versi 2 \" or TargetProcessCommandLine contains \" -vers 2 \" or TargetProcessCommandLine contains \" -ver 2 \" or TargetProcessCommandLine contains \" -ve 2 \" or TargetProcessCommandLine contains \" -v 2 \"))|extend RuleId=\"b3512211-c67e-4707-bedc-66efc7848863\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_downgrade_attack.yml\"|extend RuleTitle=\"Potential PowerShell Downgrade Attack\"|extend RuleDescription=\"\"Detects PowerShell downgrade attack by comparing the host versions with the actually used engine version 2.0\"\";\nlet q17=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"[Type]::GetTypeFromCLSID(\" and (TargetProcessCommandLine contains \"0002DF01-0000-0000-C000-000000000046\" or TargetProcessCommandLine contains \"F6D90F16-9C73-11D3-B32E-00C04F990BB4\" or TargetProcessCommandLine contains \"F5078F35-C551-11D3-89B9-0000F81FE221\" or TargetProcessCommandLine contains \"88d96a0a-f192-11d4-a65f-0040963251e5\" or TargetProcessCommandLine contains \"AFBA6B42-5692-48EA-8141-DC517DCF0EF1\" or TargetProcessCommandLine contains \"AFB40FFD-B609-40A3-9828-F88BBE11E4E3\" or TargetProcessCommandLine contains \"88d96a0b-f192-11d4-a65f-0040963251e5\" or TargetProcessCommandLine contains \"2087c2f4-2cef-4953-a8ab-66779b670495\" or TargetProcessCommandLine contains \"000209FF-0000-0000-C000-000000000046\" or TargetProcessCommandLine contains \"00024500-0000-0000-C000-000000000046\"))|extend RuleId=\"02b64f1b-3f33-4e67-aede-ef3b0a5a8fcf\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_download_com_cradles.yml\"|extend RuleTitle=\"Potential COM Objects Download Cradles Usage - Process Creation\"|extend RuleDescription=\"\"Detects usage of COM objects that can be abused to download files in PowerShell by CLSID\"\";\nlet q18=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \".DownloadString(\" or TargetProcessCommandLine contains \".DownloadFile(\" or TargetProcessCommandLine contains \"Invoke-WebRequest \" or TargetProcessCommandLine contains \"iwr \")|extend RuleId=\"6e897651-f157-4d8f-aaeb-df8151488385\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_download_cradles.yml\"|extend RuleTitle=\"PowerShell Web Download\"|extend RuleDescription=\"\"Detects suspicious ways to download files or content using PowerShell\"\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "Impact", "Discovery", "CommandAndControl", "Collection", "CredentialAccess", "Reconnaissance", "Execution"],
                "techniques": ["T1059", "T1132", "T1040", "T1105", "T1123", "T1033", "T1216", "T1562", "T1027"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000112",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}