{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000223')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000223')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 23",
                "description": "Sigma Windows Process Creation medium 23",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and (TargetProcessCommandLine contains \"TgBlAFQALgB3AEUAQg\" or TargetProcessCommandLine contains \"4AZQBUAC4AdwBFAEIA\" or TargetProcessCommandLine contains \"OAGUAVAAuAHcARQBCA\" or TargetProcessCommandLine contains \"bgBFAHQALgB3AGUAYg\" or TargetProcessCommandLine contains \"4ARQB0AC4AdwBlAGIA\" or TargetProcessCommandLine contains \"uAEUAdAAuAHcAZQBiA\" or TargetProcessCommandLine contains \"TgBFAHQALgB3AGUAYg\" or TargetProcessCommandLine contains \"OAEUAdAAuAHcAZQBiA\" or TargetProcessCommandLine contains \"bgBlAFQALgB3AGUAYg\" or TargetProcessCommandLine contains \"4AZQBUAC4AdwBlAGIA\" or TargetProcessCommandLine contains \"uAGUAVAAuAHcAZQBiA\" or TargetProcessCommandLine contains \"TgBlAFQALgB3AGUAYg\" or TargetProcessCommandLine contains \"OAGUAVAAuAHcAZQBiA\" or TargetProcessCommandLine contains \"bgBFAFQALgB3AGUAYg\" or TargetProcessCommandLine contains \"4ARQBUAC4AdwBlAGIA\" or TargetProcessCommandLine contains \"uAEUAVAAuAHcAZQBiA\" or TargetProcessCommandLine contains \"bgBlAHQALgBXAGUAYg\" or TargetProcessCommandLine contains \"4AZQB0AC4AVwBlAGIA\" or TargetProcessCommandLine contains \"uAGUAdAAuAFcAZQBiA\" or TargetProcessCommandLine contains \"bgBFAHQALgBXAGUAYg\" or TargetProcessCommandLine contains \"4ARQB0AC4AVwBlAGIA\" or TargetProcessCommandLine contains \"uAEUAdAAuAFcAZQBiA\" or TargetProcessCommandLine contains \"TgBFAHQALgBXAGUAYg\" or TargetProcessCommandLine contains \"OAEUAdAAuAFcAZQBiA\" or TargetProcessCommandLine contains \"bgBlAFQALgBXAGUAYg\" or TargetProcessCommandLine contains \"4AZQBUAC4AVwBlAGIA\" or TargetProcessCommandLine contains \"uAGUAVAAuAFcAZQBiA\" or TargetProcessCommandLine contains \"TgBlAFQALgBXAGUAYg\" or TargetProcessCommandLine contains \"OAGUAVAAuAFcAZQBiA\" or TargetProcessCommandLine contains \"bgBFAFQALgBXAGUAYg\" or TargetProcessCommandLine contains \"4ARQBUAC4AVwBlAGIA\" or TargetProcessCommandLine contains \"uAEUAVAAuAFcAZQBiA\" or TargetProcessCommandLine contains \"bgBlAHQALgB3AEUAYg\" or TargetProcessCommandLine contains \"4AZQB0AC4AdwBFAGIA\" or TargetProcessCommandLine contains \"uAGUAdAAuAHcARQBiA\" or TargetProcessCommandLine contains \"TgBlAHQALgB3AEUAYg\" or TargetProcessCommandLine contains \"OAGUAdAAuAHcARQBiA\" or TargetProcessCommandLine contains \"bgBFAHQALgB3AEUAYg\" or TargetProcessCommandLine contains \"4ARQB0AC4AdwBFAGIA\" or TargetProcessCommandLine contains \"uAEUAdAAuAHcARQBiA\" or TargetProcessCommandLine contains \"TgBFAHQALgB3AEUAYg\" or TargetProcessCommandLine contains \"OAEUAdAAuAHcARQBiA\" or TargetProcessCommandLine contains \"bgBlAFQALgB3AEUAYg\" or TargetProcessCommandLine contains \"4AZQBUAC4AdwBFAGIA\" or TargetProcessCommandLine contains \"uAGUAVAAuAHcARQBiA\" or TargetProcessCommandLine contains \"TgBlAFQALgB3AEUAYg\" or TargetProcessCommandLine contains \"OAGUAVAAuAHcARQBiA\" or TargetProcessCommandLine contains \"bgBFAFQALgB3AEUAYg\" or TargetProcessCommandLine contains \"4ARQBUAC4AdwBFAGIA\" or TargetProcessCommandLine contains \"uAEUAVAAuAHcARQBiA\" or TargetProcessCommandLine contains \"TgBFAFQALgB3AEUAYg\" or TargetProcessCommandLine contains \"OAEUAVAAuAHcARQBiA\" or TargetProcessCommandLine contains \"bgBlAHQALgBXAEUAYg\" or TargetProcessCommandLine contains \"4AZQB0AC4AVwBFAGIA\" or TargetProcessCommandLine contains \"uAGUAdAAuAFcARQBiA\" or TargetProcessCommandLine contains \"TgBlAHQALgBXAEUAYg\" or TargetProcessCommandLine contains \"OAGUAdAAuAFcARQBiA\" or TargetProcessCommandLine contains \"bgBFAHQALgBXAEUAYg\" or TargetProcessCommandLine contains \"4ARQB0AC4AVwBFAGIA\" or TargetProcessCommandLine contains \"uAEUAdAAuAFcARQBiA\" or TargetProcessCommandLine contains \"TgBFAHQALgBXAEUAYg\" or TargetProcessCommandLine contains \"OAEUAdAAuAFcARQBiA\" or TargetProcessCommandLine contains \"bgBlAFQALgBXAEUAYg\" or TargetProcessCommandLine contains \"4AZQBUAC4AVwBFAGIA\" or TargetProcessCommandLine contains \"uAGUAVAAuAFcARQBiA\" or TargetProcessCommandLine contains \"TgBlAFQALgBXAEUAYg\" or TargetProcessCommandLine contains \"OAGUAVAAuAFcARQBiA\" or TargetProcessCommandLine contains \"bgBFAFQALgBXAEUAYg\" or TargetProcessCommandLine contains \"4ARQBUAC4AVwBFAGIA\" or TargetProcessCommandLine contains \"uAEUAVAAuAFcARQBiA\" or TargetProcessCommandLine contains \"TgBFAFQALgBXAEUAYg\" or TargetProcessCommandLine contains \"OAEUAVAAuAFcARQBiA\" or TargetProcessCommandLine contains \"bgBlAHQALgB3AGUAQg\" or TargetProcessCommandLine contains \"4AZQB0AC4AdwBlAEIA\" or TargetProcessCommandLine contains \"uAGUAdAAuAHcAZQBCA\" or TargetProcessCommandLine contains \"TgBlAHQALgB3AGUAQg\" or TargetProcessCommandLine contains \"OAGUAdAAuAHcAZQBCA\" or TargetProcessCommandLine contains \"bgBFAHQALgB3AGUAQg\" or TargetProcessCommandLine contains \"4ARQB0AC4AdwBlAEIA\" or TargetProcessCommandLine contains \"uAEUAdAAuAHcAZQBCA\" or TargetProcessCommandLine contains \"TgBFAHQALgB3AGUAQg\" or TargetProcessCommandLine contains \"OAEUAdAAuAHcAZQBCA\" or TargetProcessCommandLine contains \"bgBlAFQALgB3AGUAQg\" or TargetProcessCommandLine contains \"4AZQBUAC4AdwBlAEIA\" or TargetProcessCommandLine contains \"uAGUAVAAuAHcAZQBCA\" or TargetProcessCommandLine contains \"TgBlAFQALgB3AGUAQg\" or TargetProcessCommandLine contains \"OAGUAVAAuAHcAZQBCA\" or TargetProcessCommandLine contains \"bgBFAFQALgB3AGUAQg\" or TargetProcessCommandLine contains \"4ARQBUAC4AdwBlAEIA\" or TargetProcessCommandLine contains \"uAEUAVAAuAHcAZQBCA\" or TargetProcessCommandLine contains \"TgBFAFQALgB3AGUAQg\" or TargetProcessCommandLine contains \"OAEUAVAAuAHcAZQBCA\" or TargetProcessCommandLine contains \"bgBlAHQALgBXAGUAQg\" or TargetProcessCommandLine contains \"4AZQB0AC4AVwBlAEIA\" or TargetProcessCommandLine contains \"uAGUAdAAuAFcAZQBCA\" or TargetProcessCommandLine contains \"TgBlAHQALgBXAGUAQg\" or TargetProcessCommandLine contains \"OAGUAdAAuAFcAZQBCA\" or TargetProcessCommandLine contains \"bgBFAHQALgBXAGUAQg\" or TargetProcessCommandLine contains \"4ARQB0AC4AVwBlAEIA\" or TargetProcessCommandLine contains \"uAEUAdAAuAFcAZQBCA\" or TargetProcessCommandLine contains \"TgBFAHQALgBXAGUAQg\" or TargetProcessCommandLine contains \"OAEUAdAAuAFcAZQBCA\" or TargetProcessCommandLine contains \"bgBlAFQALgBXAGUAQg\" or TargetProcessCommandLine contains \"4AZQBUAC4AVwBlAEIA\" or TargetProcessCommandLine contains \"uAGUAVAAuAFcAZQBCA\" or TargetProcessCommandLine contains \"TgBlAFQALgBXAGUAQg\" or TargetProcessCommandLine contains \"OAGUAVAAuAFcAZQBCA\" or TargetProcessCommandLine contains \"bgBFAFQALgBXAGUAQg\" or TargetProcessCommandLine contains \"4ARQBUAC4AVwBlAEIA\" or TargetProcessCommandLine contains \"uAEUAVAAuAFcAZQBCA\" or TargetProcessCommandLine contains \"TgBFAFQALgBXAGUAQg\" or TargetProcessCommandLine contains \"OAEUAVAAuAFcAZQBCA\" or TargetProcessCommandLine contains \"bgBlAHQALgB3AEUAQg\" or TargetProcessCommandLine contains \"4AZQB0AC4AdwBFAEIA\" or TargetProcessCommandLine contains \"uAGUAdAAuAHcARQBCA\" or TargetProcessCommandLine contains \"TgBlAHQALgB3AEUAQg\" or TargetProcessCommandLine contains \"OAGUAdAAuAHcARQBCA\" or TargetProcessCommandLine contains \"bgBFAHQALgB3AEUAQg\" or TargetProcessCommandLine contains \"4ARQB0AC4AdwBFAEIA\" or TargetProcessCommandLine contains \"uAEUAdAAuAHcARQBCA\" or TargetProcessCommandLine contains \"TgBFAHQALgB3AEUAQg\" or TargetProcessCommandLine contains \"OAEUAdAAuAHcARQBCA\" or TargetProcessCommandLine contains \"bgBlAFQALgB3AEUAQg\" or TargetProcessCommandLine contains \"uAGUAVAAuAHcARQBCA\" or TargetProcessCommandLine contains \"bgBFAFQALgB3AEUAQg\" or TargetProcessCommandLine contains \"4ARQBUAC4AdwBFAEIA\" or TargetProcessCommandLine contains \"uAEUAVAAuAHcARQBCA\" or TargetProcessCommandLine contains \"TgBFAFQALgB3AEUAQg\" or TargetProcessCommandLine contains \"OAEUAVAAuAHcARQBCA\" or TargetProcessCommandLine contains \"TgBlAHQALgBXAEUAQg\" or TargetProcessCommandLine contains \"4AZQB0AC4AVwBFAEIA\" or TargetProcessCommandLine contains \"OAGUAdAAuAFcARQBCA\" or TargetProcessCommandLine contains \"bgBFAHQALgBXAEUAQg\" or TargetProcessCommandLine contains \"4ARQB0AC4AVwBFAEIA\" or TargetProcessCommandLine contains \"uAEUAdAAuAFcARQBCA\" or TargetProcessCommandLine contains \"TgBFAHQALgBXAEUAQg\" or TargetProcessCommandLine contains \"OAEUAdAAuAFcARQBCA\" or TargetProcessCommandLine contains \"bgBlAFQALgBXAEUAQg\" or TargetProcessCommandLine contains \"4AZQBUAC4AVwBFAEIA\" or TargetProcessCommandLine contains \"uAGUAVAAuAFcARQBCA\" or TargetProcessCommandLine contains \"TgBlAFQALgBXAEUAQg\" or TargetProcessCommandLine contains \"OAGUAVAAuAFcARQBCA\" or TargetProcessCommandLine contains \"bgBFAFQALgBXAEUAQg\" or TargetProcessCommandLine contains \"4ARQBUAC4AVwBFAEIA\" or TargetProcessCommandLine contains \"uAEUAVAAuAFcARQBCA\"))|extend RuleId=\"c86133ad-4725-4bd0-8170-210788e0a7ba\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_webclient_casing.yml\"|extend RuleTitle=\"Net WebClient Casing Anomalies\"|extend RuleDescription=\"\"Detects PowerShell command line contents that include a suspicious abnormal casing in the Net.Webclient (e.g. nEt.WEbCliEnT) string as used in obfuscation techniques\"\";\nlet q1=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\provlaunch.exe\" and ((TargetProcessName endswith \"\\\\calc.exe\" or TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\notepad.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\wscript.exe\") or (TargetProcessName contains \":\\\\PerfLogs\\\\\" or TargetProcessName contains \":\\\\Temp\\\\\" or TargetProcessName contains \":\\\\Users\\\\Public\\\\\" or TargetProcessName contains \"\\\\AppData\\\\Temp\\\\\" or TargetProcessName contains \"\\\\Windows\\\\System32\\\\Tasks\\\\\" or TargetProcessName contains \"\\\\Windows\\\\Tasks\\\\\" or TargetProcessName contains \"\\\\Windows\\\\Temp\\\\\")))|extend RuleId=\"f9999590-1f94-4a34-a91e-951e47bedefd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_provlaunch_susp_child_process.yml\"|extend RuleTitle=\"Suspicious Provlaunch.EXE Child Process\"|extend RuleDescription=\"\"Detects suspicious child processes of \\\"provlaunch.exe\\\" which might indicate potential abuse to proxy execution.\"\";\nlet q2=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\3proxy.exe\" or TargetProcessFileDescription =~ \"3proxy - tiny proxy server\" or TargetProcessCommandLine contains \".exe -i127.0.0.1 -p\")|extend RuleId=\"f38a82d2-fba3-4781-b549-525efbec8506\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_3proxy_execution.yml\"|extend RuleTitle=\"PUA - 3Proxy Execution\"|extend RuleDescription=\"\"Detects the use of 3proxy, a tiny free proxy server\"\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"lockoutduration\" or TargetProcessCommandLine contains \"lockoutthreshold\" or TargetProcessCommandLine contains \"lockoutobservationwindow\" or TargetProcessCommandLine contains \"maxpwdage\" or TargetProcessCommandLine contains \"minpwdage\" or TargetProcessCommandLine contains \"minpwdlength\" or TargetProcessCommandLine contains \"pwdhistorylength\" or TargetProcessCommandLine contains \"pwdproperties\") or TargetProcessCommandLine contains \"-sc admincountdmp\" or TargetProcessCommandLine contains \"-sc exchaddresses\")|extend RuleId=\"455b9d50-15a1-4b99-853f-8d37655a4c1b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_adfind_enumeration.yml\"|extend RuleTitle=\"PUA - Suspicious ActiveDirectory Enumeration Via AdFind.EXE\"|extend RuleDescription=\"\"Detects active directory enumeration activity using known AdFind CLI flags\"\";\nlet q4=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"domainlist\" or TargetProcessCommandLine contains \"trustdmp\" or TargetProcessCommandLine contains \"dcmodes\" or TargetProcessCommandLine contains \"adinfo\" or TargetProcessCommandLine contains \" dclist \" or TargetProcessCommandLine contains \"computer_pwdnotreqd\" or TargetProcessCommandLine contains \"objectcategory=\" or TargetProcessCommandLine contains \"-subnets -f\" or TargetProcessCommandLine contains \"name=\\\"Domain Admins\\\"\" or TargetProcessCommandLine contains \"-sc u:\" or TargetProcessCommandLine contains \"domainncs\" or TargetProcessCommandLine contains \"dompol\" or TargetProcessCommandLine contains \" oudmp \" or TargetProcessCommandLine contains \"subnetdmp\" or TargetProcessCommandLine contains \"gpodmp\" or TargetProcessCommandLine contains \"fspdmp\" or TargetProcessCommandLine contains \"users_noexpire\" or TargetProcessCommandLine contains \"computers_active\" or TargetProcessCommandLine contains \"computers_pwdnotreqd\")|extend RuleId=\"9a132afa-654e-11eb-ae93-0242ac130002\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_adfind_susp_usage.yml\"|extend RuleTitle=\"PUA - AdFind Suspicious Execution\"|extend RuleDescription=\"\"Detects AdFind execution with common flags seen used during attacks\"\";\nunion q0, q1, q2, q3, q4;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "Execution", "Discovery", "CommandAndControl"],
                "techniques": ["T1482", "T1059", "T1087", "T1069", "T1572", "T1218", "T1018"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000223",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}