{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A5163A223')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A5163A223')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation high 23",
                "description": "Sigma Windows Process Creation medium 23",
                "severity": "high",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (((TargetProcessFilename =~ \"Excel\\.exe\" or TargetProcessFilename =~ \"MSACCESS\\.EXE\" or TargetProcessFilename =~ \"OneNote\\.exe\" or TargetProcessFilename =~ \"POWERPNT\\.EXE\" or TargetProcessFilename =~ \"WinWord\\.exe\") or (TargetProcessFileDescription =~ \"Microsoft Access\" or TargetProcessFileDescription =~ \"Microsoft Excel\" or TargetProcessFileDescription =~ \"Microsoft OneNote\" or TargetProcessFileDescription =~ \"Microsoft PowerPoint\" or TargetProcessFileDescription =~ \"Microsoft Word\")) and (not((TargetProcessName endswith \"\\\\EXCEL\\.exe\" or TargetProcessName endswith \"\\\\MSACCESS\\.exe\" or TargetProcessName endswith \"\\\\ONENOTE\\.EXE\" or TargetProcessName endswith \"\\\\POWERPNT\\.EXE\" or TargetProcessName endswith \"\\\\WINWORD\\.exe\"))))|extend RuleId=\"5163A000-5160-5160-5160-5163A5163A222\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_office_processes.yml\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessFileDescription =~ \"PAExec Application\" or TargetProcessFilename =~ \"PAExec\\.exe\" or TargetProcessFileProduct contains \"PAExec\" or (TargetProcessIMPHASH =~ \"11D40A7B7876288F919AB819CC2D9802\" or TargetProcessIMPHASH =~ \"6444f8a34e99b8f7d9647de66aabe516\" or TargetProcessIMPHASH =~ \"dfd6aa3f7b2b1035b76b718f1ddc689f\" or TargetProcessIMPHASH =~ \"1a6cca4d5460b1710a12dea39e4a592c\") or (Hashes contains \"IMPHASH=11D40A7B7876288F919AB819CC2D9802\" or Hashes contains \"IMPHASH=6444f8a34e99b8f7d9647de66aabe516\" or Hashes contains \"IMPHASH=dfd6aa3f7b2b1035b76b718f1ddc689f\" or Hashes contains \"IMPHASH=1a6cca4d5460b1710a12dea39e4a592c\")) and (not((TargetProcessName endswith \"\\\\paexec\\.exe\" or TargetProcessName startswith \"C:\\\\Windows\\\\PAExec-\"))))|extend RuleId=\"c4e49831-1496-40cf-8ce1-b53f942b02f9\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_paexec.yml\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"Plink\" or (TargetProcessCommandLine contains \" -l forward\" and TargetProcessCommandLine contains \" -P \" and TargetProcessCommandLine contains \" -R \")) and (not(TargetProcessName endswith \"\\\\plink\\.exe\")))|extend RuleId=\"1c12727d-02bf-45ff-a9f3-d49806a3cf43\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_plink.yml\";\nlet q3=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"DllRegisterServer\" and (not(TargetProcessName endswith \"\\\\rundll32\\.exe\")))|extend RuleId=\"2569ed8c-1147-498a-9b8c-2ad3656b10ed\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_rundll32_dllregisterserver.yml\";\nlet q4=_Im_ProcessCreate\n| where (TargetProcessFileProduct =~ \"Sysinternals DebugView\" and (not((TargetProcessFilename =~ \"Dbgview\\.exe\" and TargetProcessName endswith \"\\\\Dbgview\\.exe\"))))|extend RuleId=\"cd764533-2e07-40d6-a718-cfeec7f2da7f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_sysinternals_debugview.yml\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"procdump\" or ((TargetProcessCommandLine contains \" -ma \" or TargetProcessCommandLine contains \" /ma \") and (TargetProcessCommandLine contains \" -accepteula \" or TargetProcessCommandLine contains \" /accepteula \"))) and (not((TargetProcessName endswith \"\\\\procdump\\.exe\" or TargetProcessName endswith \"\\\\procdump64\\.exe\"))))|extend RuleId=\"4a0b2c7e-7cb2-495d-8b63-5f268e7bfd67\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_sysinternals_procdump.yml\";\nlet q6=_Im_ProcessCreate\n| where (TargetProcessFilename =~ \"psexesvc\\.exe\" and (not(TargetProcessName =~ \"C:\\\\Windows\\\\PSEXESVC\\.exe\")))|extend RuleId=\"51ae86a2-e2e1-4097-ad85-c46cb6851de4\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_sysinternals_psexec_service.yml\";\nlet q7=_Im_ProcessCreate\n| where (TargetProcessFilename =~ \"sdelete\\.exe\" and (not((TargetProcessName endswith \"\\\\sdelete\\.exe\" or TargetProcessName endswith \"\\\\sdelete64\\.exe\"))))|extend RuleId=\"c1d867fe-8d95-4487-aab4-e53f2d339f90\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_sysinternals_sdelete.yml\";\nlet q8=_Im_ProcessCreate\n| where (TargetProcessFilename =~ \"vmnat\\.exe\" and (not(TargetProcessName endswith \"vmnat\\.exe\")))|extend RuleId=\"7b4f794b-590a-4ad4-ba18-7964a2832205\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_vmnat.yml\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\rundll32\\.exe\" or TargetProcessFilename =~ \"RUNDLL32\\.EXE\") and TargetProcessCommandLine matches regex \"[Rr][Uu][Nn][Dd][Ll][Ll]32(\\\\.[Ee][Xx][Ee])? \\\\S+?\\\\w:\\\\S+?:\")|extend RuleId=\"9248c7e1-2bf3-4661-a22c-600a8040b446\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_ads_stored_dll_execution.yml\";\nlet q10=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\rundll32\\.exe\" or TargetProcessFilename =~ \"RUNDLL32\\.EXE\" or TargetProcessCommandLine contains \"rundll32\") and TargetProcessCommandLine contains \"advpack\" and ((TargetProcessCommandLine contains \"#+\" and TargetProcessCommandLine contains \"12\") or TargetProcessCommandLine contains \"#-\"))|extend RuleId=\"a1473adb-5338-4a20-b4c3-126763e2d3d3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_advpack_obfuscated_ordinal_call.yml\";\nlet q11=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\rundll32\\.exe\" or TargetProcessFilename =~ \"RUNDLL32\\.EXE\") and (TargetProcessCommandLine contains \",#\" or TargetProcessCommandLine contains \", #\" or TargetProcessCommandLine contains \"\\.dll #\" or TargetProcessCommandLine contains \"\\.ocx #\")) and (not(((TargetProcessCommandLine contains \"EDGEHTML\\.dll\" and TargetProcessCommandLine contains \"#141\") or ((ActingProcessName contains \"\\\\Msbuild\\\\Current\\\\Bin\\\\\" or ActingProcessName contains \"\\\\VC\\\\Tools\\\\MSVC\\\\\" or ActingProcessName contains \"\\\\Tracker\\.exe\") and (TargetProcessCommandLine contains \"\\\\FileTracker32\\.dll,#1\" or TargetProcessCommandLine contains \"\\\\FileTracker32\\.dll\\\",#1\" or TargetProcessCommandLine contains \"\\\\FileTracker64\\.dll,#1\" or TargetProcessCommandLine contains \"\\\\FileTracker64\\.dll\\\",#1\"))))))|extend RuleId=\"e79a9e79-eb72-4e78-a628-0e7e8f59e89c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_by_ordinal.yml\";\nlet q12=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\rundll32\\.exe\" or TargetProcessFilename =~ \"RUNDLL32\\.EXE\") and (not((isnull(TargetProcessCommandLine) or (TargetProcessCommandLine contains \"\\.dll\" or TargetProcessCommandLine =~ \"\") or TargetProcessCommandLine startswith \"C:\\\\Windows\\\\system32\\\\rundll32\\.exe C:\\\\Windows\\\\system32\\\\inetcpl\\.cpl,ClearMyTracksByProcess\" or (ActingProcessName endswith \":\\\\Program Files\\\\Internet Explorer\\\\iexplore\\.exe\" and TargetProcessCommandLine contains \"\\.cpl\") or (ActingProcessName endswith \":\\\\Windows\\\\SysWOW64\\\\msiexec\\.exe\" and ActingProcessCommandLine startswith \"C:\\\\Windows\\\\syswow64\\\\MsiExec\\.exe -Embedding\") or (ActingProcessName endswith \":\\\\Windows\\\\System32\\\\msiexec\\.exe\" and ActingProcessCommandLine startswith \"C:\\\\Windows\\\\system32\\\\MsiExec\\.exe -Embedding\") or (ActingProcessName endswith \":\\\\Windows\\\\System32\\\\cmd\\.exe\" and ActingProcessCommandLine contains \" C:\\\\Program Files\\\\SplunkUniversalForwarder\\\\\") or TargetProcessCommandLine contains \" -localserver \" or (ActingProcessCommandLine startswith \"C:\\\\Windows\\\\system32\\\\rundll32\\.exe\\\" \\\"C:\\\\Program Files\\\\McAfee\\\\MSC\\\\mcmscins\\.dll\\\",DllUninstallFunction \" or TargetProcessCommandLine startswith \"C:\\\\Windows\\\\system32\\\\rundll32\\.exe\\\" /uninstall /longpath \\\"C:\\\\Program Files\\\\McAfee\\\\MSC\\\\mscrem\\.inf\") or (ActingProcessName startswith \"C:\\\\Users\\\\\" and ActingProcessName contains \"\\\\AppData\\\\Local\\\\Microsoft\\\\EdgeUpdate\\\\Install\\\\{\" and ActingProcessName endswith \"\\\\setup\\.exe\") or ((TargetProcessCommandLine contains \"C:\\\\Windows\\\\Installer\\\\MSI\" and TargetProcessCommandLine contains \"\\.tmp\" and TargetProcessCommandLine contains \"zzzzInvokeManagedCustomActionOutOfProc\") and (TargetProcessCommandLine contains \"Avira\\.OE\\.Setup\" or TargetProcessCommandLine contains \"FindOldJetBrainsProduct\"))))))|extend RuleId=\"c3a99af4-35a9-4668-879e-c09aeb4f2bdf\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_executable_invalid_extension.yml\";\nlet q13=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"rundll32\\.exe\" and TargetProcessCommandLine contains \"Execute\" and TargetProcessCommandLine contains \"RegRead\" and TargetProcessCommandLine contains \"window\\.close\")|extend RuleId=\"1cc50f3f-1fc8-4acf-b2e9-6f172e1fdebd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_inline_vbs.yml\";\nlet q14=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"rundll32\" and TargetProcessCommandLine contains \"javascript\" and TargetProcessCommandLine contains \"\\.\\.\\\\\\.\\.\\\\mshtml,RunHTMLApplication\") or TargetProcessCommandLine contains \";document\\.write();GetObject(\\\"script\")|extend RuleId=\"9f06447a-a33a-4cbe-a94f-a3f43184a7a3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_js_runhtmlapplication.yml\";\nlet q15=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\rundll32\\.exe\" or TargetProcessFilename =~ \"RUNDLL32\\.EXE\") and (TargetProcessCommandLine contains \"keymgr\" and TargetProcessCommandLine contains \"KRShowKeyMgr\"))|extend RuleId=\"a4694263-59a8-4608-a3a0-6f8d3a51664c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_keymgr.yml\";\nlet q16=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"\\\\\\.\\.\\\\\" and TargetProcessCommandLine contains \"mshtml\" and TargetProcessCommandLine contains \"RunHTMLApplication\")|extend RuleId=\"4782eb5a-a513-4523-a0ac-f3082b26ac5c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_mshtml_runhtmlapplication.yml\";\nlet q17=_Im_ProcessCreate\n| where ((TargetProcessCommandLine endswith \"\\\\rundll32\\.exe\" or TargetProcessCommandLine endswith \"\\\\rundll32\\.exe\\\"\" or TargetProcessCommandLine endswith \"\\\\rundll32\") and (not((ActingProcessName contains \"\\\\AppData\\\\Local\\\\\" or ActingProcessName contains \"\\\\Microsoft\\\\Edge\\\\\"))))|extend RuleId=\"1775e15e-b61b-4d14-a1a3-80981298085a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_no_params.yml\";\nlet q18=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\rundll32\\.exe\" or TargetProcessFilename =~ \"RUNDLL32\\.EXE\") and ((TargetProcessCommandLine contains \"C:\\\\windows\\\\system32\\\\davclnt\\.dll,DavSetCookie\" and TargetProcessCommandLine contains \"http\") and (TargetProcessCommandLine contains \"spoolss\" or TargetProcessCommandLine contains \"srvsvc\" or TargetProcessCommandLine contains \"/print/pipe/\")))|extend RuleId=\"bb76d96b-821c-47cf-944b-7ce377864492\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_ntlmrelay.yml\";\nlet q19=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\rundll32\\.exe\" or TargetProcessFilename =~ \"RUNDLL32\\.EXE\" or TargetProcessCommandLine contains \"rundll32\") and ((TargetProcessCommandLine contains \"comsvcs\" and TargetProcessCommandLine contains \"full\") and (TargetProcessCommandLine contains \"#-\" or TargetProcessCommandLine contains \"#+\" or TargetProcessCommandLine contains \"#24\" or TargetProcessCommandLine contains \"24 \" or TargetProcessCommandLine contains \"MiniDump\"))) or ((TargetProcessCommandLine contains \"24\" and TargetProcessCommandLine contains \"comsvcs\" and TargetProcessCommandLine contains \"full\") and (TargetProcessCommandLine contains \" #\" or TargetProcessCommandLine contains \",#\" or TargetProcessCommandLine contains \", #\")))|extend RuleId=\"646ea171-dded-4578-8a4d-65e9822892e3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_process_dump_via_comsvcs.yml\";\nlet q20=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\rundll32\\.exe\" or TargetProcessFilename =~ \"RUNDLL32\\.EXE\") and ((TargetProcessCommandLine contains \"-sta \" or TargetProcessCommandLine contains \"-localserver \") and (TargetProcessCommandLine contains \"{\" and TargetProcessCommandLine contains \"}\")))|extend RuleId=\"f1edd233-30b5-4823-9e6a-c4171b24d316\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_registered_com_objects.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19, q20;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["PrivilegeEscalation", "Impact", "DefenseEvasion", "ResourceDevelopment", "CredentialAccess", "Persistence", "Execution"],
                "techniques": ["T1546", "T1555", "T1202", "T1564", "T1574", "T1212", "T1003", "T1485", "T1218", "T1055", "T1036", "T1588"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A5163A223",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}