{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000104')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000104')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 04",
                "description": "Sigma Windows Process Creation low 04",
                "severity": "low",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"\u0410\" or TargetProcessCommandLine contains \"\u0412\" or TargetProcessCommandLine contains \"\u0415\" or TargetProcessCommandLine contains \"\u041a\" or TargetProcessCommandLine contains \"\u041c\" or TargetProcessCommandLine contains \"\u041d\" or TargetProcessCommandLine contains \"\u041e\" or TargetProcessCommandLine contains \"\u0420\" or TargetProcessCommandLine contains \"\u0421\" or TargetProcessCommandLine contains \"\u0422\" or TargetProcessCommandLine contains \"\u0425\" or TargetProcessCommandLine contains \"\u0405\" or TargetProcessCommandLine contains \"\u0406\" or TargetProcessCommandLine contains \"\u0408\" or TargetProcessCommandLine contains \"\u04ae\" or TargetProcessCommandLine contains \"\u04c0\" or TargetProcessCommandLine contains \"\u050c\" or TargetProcessCommandLine contains \"\u051a\" or TargetProcessCommandLine contains \"\u051c\" or TargetProcessCommandLine contains \"\u0391\" or TargetProcessCommandLine contains \"\u0392\" or TargetProcessCommandLine contains \"\u0395\" or TargetProcessCommandLine contains \"\u0396\" or TargetProcessCommandLine contains \"\u0397\" or TargetProcessCommandLine contains \"\u0399\" or TargetProcessCommandLine contains \"\u039a\" or TargetProcessCommandLine contains \"\u039c\" or TargetProcessCommandLine contains \"\u039d\" or TargetProcessCommandLine contains \"\u039f\" or TargetProcessCommandLine contains \"\u03a1\" or TargetProcessCommandLine contains \"\u03a4\" or TargetProcessCommandLine contains \"\u03a5\" or TargetProcessCommandLine contains \"\u03a7\") or (TargetProcessCommandLine contains \"\u0430\" or TargetProcessCommandLine contains \"\u0435\" or TargetProcessCommandLine contains \"\u043e\" or TargetProcessCommandLine contains \"\u0440\" or TargetProcessCommandLine contains \"\u0441\" or TargetProcessCommandLine contains \"\u0445\" or TargetProcessCommandLine contains \"\u0455\" or TargetProcessCommandLine contains \"\u0456\" or TargetProcessCommandLine contains \"\u04cf\" or TargetProcessCommandLine contains \"\u0458\" or TargetProcessCommandLine contains \"\u04bb\" or TargetProcessCommandLine contains \"\u0501\" or TargetProcessCommandLine contains \"\u051b\" or TargetProcessCommandLine contains \"\u051d\" or TargetProcessCommandLine contains \"\u03bf\"))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000103\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_homoglyph_cyrillic_lookalikes.yml\";\nlet q1=_Im_ProcessCreate\n| where (TargetProcessName =~ \"hxtsr.exe\" and (not((TargetProcessCurrentDirectory startswith \"C:\\\\program files\\\\windowsapps\\\\microsoft.windowscommunicationsapps_\" and TargetProcessCurrentDirectory endswith \"\\\\hxtsr.exe\"))))|extend RuleId=\"4e762605-34a8-406d-b72e-c1a089313320\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hxtsr_masquerading.yml\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"iCACLS.EXE\" or TargetProcessName endswith \"\\\\icacls.exe\") and (TargetProcessCommandLine contains \"C:\\\\Users\\\\\" and TargetProcessCommandLine contains \"/deny\" and TargetProcessCommandLine contains \"S-1-1-0:\"))|extend RuleId=\"4ae81040-fc1c-4249-bfa3-938d260214d9\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_icacls_deny.yml\";\nlet q3=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\appcmd.exe\" or TargetProcessFilename =~ \"appcmd.exe\") and ((TargetProcessCommandLine contains \"install\" and TargetProcessCommandLine contains \"module\") and (TargetProcessCommandLine contains \"/name:\" or TargetProcessCommandLine contains \"-name:\"))) and (not(ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\inetsrv\\\\iissetup.exe\")))|extend RuleId=\"9465ddf4-f9e4-4ebd-8d98-702df3a93239\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_iis_appcmd_susp_module_install.yml\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\appcmd.exe\" or TargetProcessFilename =~ \"appcmd.exe\") and (TargetProcessCommandLine contains \"set\" and TargetProcessCommandLine contains \"config\" and TargetProcessCommandLine contains \"section:system.webServer/rewrite/globalRules\" and TargetProcessCommandLine contains \"commit:\"))|extend RuleId=\"7c8af9b2-dcae-41a2-a9db-b28c288b5f08\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_iis_appcmd_susp_rewrite_rule.yml\";\nlet q5=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"InfDefaultInstall.exe \" and TargetProcessCommandLine contains \".inf\")|extend RuleId=\"ce7cf472-6fcc-490a-9481-3786840b5d9b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_infdefaultinstall_execute_sct_scripts.yml\";\nlet q6=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\InstallUtil.exe\" and TargetProcessName contains \"Microsoft.NET\\\\Framework\" and (TargetProcessCommandLine contains \"/logfile= \" and TargetProcessCommandLine contains \"/LogToConsole=false\"))|extend RuleId=\"d042284c-a296-4988-9be5-f424fadcc28c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_instalutil_no_log_execution.yml\";\nlet q7=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"transport=dt_socket,address=\" and (TargetProcessCommandLine contains \"jre1.\" or TargetProcessCommandLine contains \"jdk1.\")) and (not((TargetProcessCommandLine contains \"address=127.0.0.1\" or TargetProcessCommandLine contains \"address=localhost\"))))|extend RuleId=\"8f88e3f6-2a49-48f5-a5c4-2f7eedf78710\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_java_remote_debugging.yml\";\nlet q8=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\java.exe\" and (TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\")) and (not((ActingProcessName contains \"build\" and TargetProcessCommandLine contains \"build\"))))|extend RuleId=\"dff1e1cc-d3fd-47c8-bfc2-aeb878a754c0\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_java_susp_child_process_2.yml\";\nlet q9=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\java.exe\" or ActingProcessName endswith \"\\\\javaw.exe\") and ActingProcessCommandLine contains \"SysAidServer\")|extend RuleId=\"60bfeac3-0d35-4302-8efb-1dd16f715bc6\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_java_sysaidserver_susp_child_process.yml\";\nlet q10=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\ksetup.exe\" or TargetProcessFilename =~ \"ksetup.exe\") and TargetProcessCommandLine contains \" /setcomputerpassword \")|extend RuleId=\"de16d92c-c446-4d53-8938-10aeef41c8b6\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_ksetup_password_change_computer.yml\";\nlet q11=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\ksetup.exe\" or TargetProcessFilename =~ \"ksetup.exe\") and TargetProcessCommandLine contains \" /ChangePassword \")|extend RuleId=\"c9783e20-4793-4164-ba96-d9ee483992c4\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_ksetup_password_change_user.yml\";\nlet q12=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\ldifde.exe\" or TargetProcessFilename =~ \"ldifde.exe\") and TargetProcessCommandLine contains \"-f\") and (not(TargetProcessCommandLine contains \" -i\")))|extend RuleId=\"4f7a6757-ff79-46db-9687-66501a02d9ec\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_ldifde_export.yml\";\nlet q13=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\ldifde.exe\" or TargetProcessFilename =~ \"ldifde.exe\") and (TargetProcessCommandLine contains \"-i\" and TargetProcessCommandLine contains \"-f\"))|extend RuleId=\"6f535e01-ca1f-40be-ab8d-45b19c0c8b7f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_ldifde_file_load.yml\";\nlet q14=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\lodctr.exe\" and TargetProcessFilename =~ \"LODCTR.EXE\") and (TargetProcessCommandLine contains \" /r\" or TargetProcessCommandLine contains \" -r\"))|extend RuleId=\"cc9d3712-6310-4320-b2df-7cb408274d53\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lodctr_performance_counter_tampering.yml\";\nlet q15=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\appvlp.exe\" and (not((TargetProcessName endswith \"\\\\msoasb.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\"))))|extend RuleId=\"9c7e131a-0f2c-4ae0-9d43-b04f4e266d43\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_appvlp.yml\";\nlet q16=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\cdb.exe\" or TargetProcessFilename =~ \"CDB.Exe\") and (TargetProcessCommandLine contains \" -c \" or TargetProcessCommandLine contains \" -cf \"))|extend RuleId=\"b5c7395f-e501-4a08-94d4-57fe7a9da9d2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_cdb.yml\";\nlet q17=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\xwizard.exe\" and TargetProcessCommandLine matches regex \"\\\\{[a-fA-F0-9]{8}-[a-fA-F0-9]{4}-[a-fA-F0-9]{4}-[a-fA-F0-9]{4}-[a-fA-F0-9]{12}\\\\}\")|extend RuleId=\"53d4bb30-3f36-4e8a-b078-69d36c4a79ff\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_class_exec_xwizard.yml\";\nlet q18=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\cmdl32.exe\" or TargetProcessFilename =~ \"CMDL32.EXE\") and (TargetProcessCommandLine contains \"/vpn \" and TargetProcessCommandLine contains \"/lan \"))|extend RuleId=\"f37aba28-a9e6-4045-882c-d5004043b337\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_cmdl32.yml\";\nlet q19=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"ConfigSecurityPolicy.exe\" or TargetProcessName endswith \"\\\\ConfigSecurityPolicy.exe\" or TargetProcessFilename =~ \"ConfigSecurityPolicy.exe\") and (TargetProcessCommandLine contains \"https://\" or TargetProcessCommandLine contains \"http://\" or TargetProcessCommandLine contains \"ftp://\"))|extend RuleId=\"1f0f6176-6482-4027-b151-00071af39d7e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_configsecuritypolicy.yml\";\nlet q20=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\CustomShellHost.exe\" and (not(TargetProcessName =~ \"C:\\\\Windows\\\\explorer.exe\")))|extend RuleId=\"84b14121-9d14-416e-800b-f3b829c5a14d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_customshellhost.yml\";\nlet q21=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"/in:\" or TargetProcessCommandLine contains \"/out:\" or TargetProcessCommandLine contains \"/uri:\") and (TargetProcessName endswith \"\\\\DataSvcUtil.exe\" or TargetProcessFilename =~ \"DataSvcUtil.exe\"))|extend RuleId=\"e290b10b-1023-4452-a4a9-eb31a9013b3a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_data_exfiltration_by_using_datasvcutil.yml\";\nlet q22=_Im_ProcessCreate\n| where ActingProcessName endswith \"\\\\defaultpack.exe\"|extend RuleId=\"b2309017-4235-44fe-b5af-b15363011957\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_defaultpack.yml\";\nlet q23=_Im_ProcessCreate\n| where TargetProcessName endswith \"\\\\DeviceCredentialDeployment.exe\"|extend RuleId=\"b8b1b304-a60f-4999-9a6e-c547bde03ffd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_device_credential_deployment.yml\";\nlet q24=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"diantz.exe\" and TargetProcessCommandLine contains \".cab\") and TargetProcessCommandLine matches regex \":[^\\\\\\\\]\")|extend RuleId=\"6b369ced-4b1d-48f1-b427-fdc0de0790bd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_diantz_ads.yml\";\nlet q25=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"diantz.exe\" and TargetProcessCommandLine contains \" \\\\\\\\\" and TargetProcessCommandLine contains \".cab\")|extend RuleId=\"185d7418-f250-42d0-b72e-0c8b70661e93\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_diantz_remote_cab.yml\";\nlet q26=_Im_ProcessCreate\n| where TargetProcessName endswith \"\\\\dnx.exe\"|extend RuleId=\"81ebd28b-9607-4478-bf06-974ed9d53ed7\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_dnx.yml\";\nlet q27=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\dotnet.exe\" or TargetProcessFilename =~ \".NET Host\") and (TargetProcessCommandLine endswith \".dll\" or TargetProcessCommandLine endswith \".csproj\"))|extend RuleId=\"d80d5c81-04ba-45b4-84e4-92eba40e0ad3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_dotnet.yml\";\nlet q28=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\dotnet-dump.exe\" or TargetProcessFilename =~ \"dotnet-dump.dll\") and TargetProcessCommandLine contains \"collect\")|extend RuleId=\"53d8d3e1-ca33-4012-adf3-e05a4d652e34\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_dotnet_dump.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19, q20, q21, q22, q23, q24, q25, q26, q27, q28;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["LateralMovement", "PrivilegeEscalation", "CommandAndControl", "Exfiltration", "Persistence", "Execution", "InitialAccess", "DefenseEvasion"],
                "techniques": ["T1564", "T1218", "T1567", "T1210", "T1105", "T1505", "T1036", "T1127", "T1203", "T1202", "T1027", "T1216", "T1106"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000104",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}