{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000229')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000229')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 29",
                "description": "Sigma Windows Process Creation medium 29",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((((TargetProcessCommandLine contains \" tunnel \" and TargetProcessCommandLine contains \"cleanup \") and (TargetProcessCommandLine contains \"-config \" or TargetProcessCommandLine contains \"-connector-id \")) or ((TargetProcessCommandLine contains \" tunnel \" and TargetProcessCommandLine contains \" run \") and (TargetProcessCommandLine contains \"-config \" or TargetProcessCommandLine contains \"-credentials-contents \" or TargetProcessCommandLine contains \"-credentials-file \" or TargetProcessCommandLine contains \"-token \")) or (TargetProcessCommandLine contains \"-url\" and TargetProcessCommandLine contains \"tunnel\") or (TargetProcessIMPHASH=~\"SHA256=2fb6c04c4f95fb8d158af94c137f90ac820716deaf88d8ebec956254e046cb29\" or TargetProcessIMPHASH=~\"SHA256=b3d21940a10fdef5e415ad70331ce257c24fe3bcf7722262302e0421791f87e8\" or TargetProcessIMPHASH=~\"SHA256=1fbd8362b2d2d2e6a5750ae3db69cd1815e6c1d31da48a98b796450971a8e039\" or TargetProcessIMPHASH=~\"SHA256=0409c9b12f9d0eda86e461ed9bdabeefb00172b26322079681a0bdf48e68dc28\" or TargetProcessIMPHASH=~\"SHA256=7cfb411d04bac42ef93d1f0c93c0a481e38c6f4612b97ae89d4702595988edc7\" or TargetProcessIMPHASH=~\"SHA256=5b3c2d846ab162dc6bc595cce3a49de5731afde5d6060be7066d21b013a28373\" or TargetProcessIMPHASH=~\"SHA256=ce95df7f69664c3df19b76028e115931919a71517b776da7b42d353e2ff4a670\" or TargetProcessIMPHASH=~\"SHA256=1293525a19cfe3bc8296b62fbfe19f083632ed644a1c18c10b045a1d3030d81a\" or TargetProcessIMPHASH=~\"SHA256=af2b9161cfcb654b16408cd6b098afe9d1fb61a037d18d7090a119d4c0c8e0f0\" or TargetProcessIMPHASH=~\"SHA256=39ddceb56a15798826a5fc4892fa2b474c444bb4d7a8bf2fa95e41cab10fa7a1\" or TargetProcessIMPHASH=~\"SHA256=ccd11f2328023a0e7929e845d5b6e7bc783fb4650d65faef3ae090239d4bbce2\" or TargetProcessIMPHASH=~\"SHA256=b6e5c5d2567ae8c69cc012ebcae30e6c9b5359d64a58d17ba75ec89f8bce71ac\" or TargetProcessIMPHASH=~\"SHA256=f813484ea441404f18caad96f28138e8aaf0cb256163c09c2ab8a3acab87f69f\" or TargetProcessIMPHASH=~\"SHA256=fc4a0802ab9c7409b892ca00636bec61e2acfc911bccfdeb9978b8ab5a2f828d\" or TargetProcessIMPHASH=~\"SHA256=083150724b49604c8765c1ba19541fa260b133be0acb0647fcd936d81f054499\" or TargetProcessIMPHASH=~\"SHA256=44303d6572956f28a0f2e4b188934fb9874f2584f5c81fa431a463cfbf28083b\" or TargetProcessIMPHASH=~\"SHA256=5d38c46032a58e28ae5f7d174d8761ec3d64d186677f3ec53af5f51afb9bfd2f\" or TargetProcessIMPHASH=~\"SHA256=e1e70fa42059911bc6685fafef957f9a73fc66f214d0704a9b932683a5204032\" or TargetProcessIMPHASH=~\"SHA256=c01356092a365b84f84f0e66870bd1a05ba3feb53cafd973fa5fea2534bee234\" or TargetProcessIMPHASH=~\"SHA256=b3f9c06151e30ee43d39e788a79cd918a314f24e04fe87f3de8272a2057b624f\" or TargetProcessIMPHASH=~\"SHA256=cd81b2792f0739f473c31c9cb7cf2313154bfa28b839975802b90e8790bb5058\" or TargetProcessIMPHASH=~\"SHA256=9ec7e6c8e1bfd883663d8d9d62c9e4f9ae373b731407181e32491b27a7218a2c\" or TargetProcessIMPHASH=~\"SHA256=c2cfd23fdc6c0e1b1ffa0e545cbe556f18d11b362b4a89ba0713f6ab01c4827f\" or TargetProcessIMPHASH=~\"SHA256=53f8adbd76c0eb16f5e43cadde422474d8a06f9c8f959389c1930042ad8beaa5\" or TargetProcessIMPHASH=~\"SHA256=648c8d2f8001c113d2986dd00b7bbd181593d462bef73522cee212c4f71f95b3\" or TargetProcessIMPHASH=~\"SHA256=ae047e2095e46c3f9c518b2be67ec753f4f0aad23b261a361fcb6144dcdb63b4\" or TargetProcessIMPHASH=~\"SHA256=3153d2baa462978dd22ab33d1c2274ecc88c200225d6a3327f98d5b752d08f5c\" or TargetProcessIMPHASH=~\"SHA256=f49cde976e628012c9db73e1c8d76081944ecf2297cdafeb78bb13290da274c4\" or TargetProcessIMPHASH=~\"SHA256=d2513e58bb03ccc83affde685c6ef987924c37ce6707d8e9857e2524b0d7e90f\" or TargetProcessIMPHASH=~\"SHA256=bb67c7623ba92fe64ffd9816b8d5b3b1ea3013960a30bd4cf6e295b3eb5b1bad\" or TargetProcessIMPHASH=~\"SHA256=b34b3c3a91e3165d1481f0b3ec23eab93a1cfba94345a6cbfe5b18ddbd48eac7\" or TargetProcessIMPHASH=~\"SHA256=f7848034e010d55f15e474ca998f96391e320ff29b00cfcc4c5e536529703e75\" or TargetProcessIMPHASH=~\"SHA256=b6fc9493778cbe3bfc062d73f5cc604bc0ff058bc5e5dc6aac87f3a4008b54b6\" or TargetProcessIMPHASH=~\"SHA256=f5c5e962577e2293c4ad10603816dce7cc273585969615fbf4e4bfa9eaff1688\" or TargetProcessIMPHASH=~\"SHA256=d14c52d9220b606f428a8fe9f7c108b0d6f14cf71e7384749e98e6a95962e68f\" or TargetProcessIMPHASH=~\"SHA256=d3a0e1a79158f3985cd49607ebe0cdfcc49cb9af96b8f43aefd0cdfe2f22e663\" or TargetProcessIMPHASH=~\"SHA256=2fbbfc8299537ff80cadf9d0e27c223fe0ccb9052bf9d8763ad717bbfa521c77\" or TargetProcessIMPHASH=~\"SHA256=19074674c6fbdaa573b3081745e5e26144fdf7a086d14e0e220d1814f1f13078\")) and (not((TargetProcessName endswith \"\\\\cloudflared.exe\" or TargetProcessName endswith \"\\\\cloudflared-windows-386.exe\" or TargetProcessName endswith \"\\\\cloudflared-windows-amd64.exe\"))))|extend RuleId=\"e0c69ebd-b54f-4aed-8ae3-e3467843f3f0\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_cloudflared.yml\"|extend RuleTitle=\"Renamed Cloudflared.EXE Execution\"|extend RuleDescription=\"Detects the execution of a renamed \\\"cloudflared\\\" binary.\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"FX_VER_INTERNALNAME_STR\" or ((TargetProcessCommandLine contains \" -u \" and TargetProcessCommandLine contains \" -f \" and TargetProcessCommandLine contains \".dmp\") or (TargetProcessCommandLine contains \" --full \" and TargetProcessCommandLine contains \" --name \" and TargetProcessCommandLine contains \".dmp\"))) and (not(TargetProcessName endswith \"\\\\createdump.exe\")))|extend RuleId=\"1a1ed54a-2ba4-4221-94d5-01dee560d71e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_createdump.yml\"|extend RuleTitle=\"Renamed CreateDump Utility Execution\"|extend RuleDescription=\"Detects uses of a renamed legitimate createdump.exe LOLOBIN utility to dump process memory\";\nlet q2=_Im_ProcessCreate\n| where (TargetProcessIMPHASH=~\"6834B1B94E49701D77CCB3C0895E1AFD\" and (not(TargetProcessName endswith \"\\\\dctask64.exe\")))|extend RuleId=\"340a090b-c4e9-412e-bb36-b4b16fe96f9b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_dctask64.yml\"|extend RuleTitle=\"Renamed ZOHO Dctask64 Execution\"|extend RuleDescription=\"Detects a renamed dctask64.exe used for process injection, command execution, process creation with a signed binary by ZOHO Corporation\";\nlet q3=_Im_ProcessCreate\n| where (TargetProcessFilename =~ \"gpg.exe\" and (not((TargetProcessName endswith \"\\\\gpg.exe\" or TargetProcessName endswith \"\\\\gpg2.exe\"))))|extend RuleId=\"ec0722a3-eb5c-4a56-8ab2-bf6f20708592\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_gpg4win.yml\"|extend RuleTitle=\"Renamed Gpg.EXE Execution\"|extend RuleDescription=\"Detects the execution of a renamed \\\"gpg.exe\\\". Often used by ransomware and loaders to decrypt/encrypt data.\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessFileDescription =~ \"Java Update Scheduler\" or TargetProcessFileDescription =~ \"Java(TM) Update Scheduler\") and (not(TargetProcessName endswith \"\\\\jusched.exe\")))|extend RuleId=\"edd8a48c-1b9f-4ba1-83aa-490338cd1ccb\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_jusched.yml\"|extend RuleTitle=\"Renamed Jusched.EXE Execution\"|extend RuleDescription=\"Detects the execution of a renamed \\\"jusched.exe\\\" as seen used by the cobalt group\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"mavinject32.exe\" or TargetProcessFilename =~ \"mavinject64.exe\") and (not((TargetProcessName endswith \"\\\\mavinject32.exe\" or TargetProcessName endswith \"\\\\mavinject64.exe\"))))|extend RuleId=\"e6474a1b-5390-49cd-ab41-8d88655f7394\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_mavinject.yml\"|extend RuleTitle=\"Renamed Mavinject.EXE Execution\"|extend RuleDescription=\"Detects the execution of a renamed version of the \\\"Mavinject\\\" process. Which can be abused to perform process injection using the \\\"/INJECTRUNNING\\\" flag\";\nlet q6=_Im_ProcessCreate\n| where (TargetProcessFilename =~ \"megasync.exe\" and (not(TargetProcessName endswith \"\\\\megasync.exe\")))|extend RuleId=\"643bdcac-8b82-49f4-9fd9-25a90b929f3b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_megasync.yml\"|extend RuleTitle=\"Renamed MegaSync Execution\"|extend RuleDescription=\"Detects the execution of a renamed MegaSync.exe as seen used by ransomware families like Nefilim, Sodinokibi, Pysa, and Conti.\";\nlet q7=_Im_ProcessCreate\n| where (TargetProcessFilename =~ \"msdt.exe\" and (not(TargetProcessName endswith \"\\\\msdt.exe\")))|extend RuleId=\"bd1c6866-65fc-44b2-be51-5588fcff82b9\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_msdt.yml\"|extend RuleTitle=\"Renamed Msdt.EXE Execution\"|extend RuleDescription=\"Detects the execution of a renamed \\\"Msdt.exe\\\" binary\";\nlet q8=_Im_ProcessCreate\n| where ((TargetProcessFileProduct contains \"NetSupport Remote Control\" or TargetProcessFilename contains \"client32.exe\" or TargetProcessIMPHASH =~ \"a9d50692e95b79723f3e76fcf70d023e\" or TargetProcessIMPHASH=~\"A9D50692E95B79723F3E76FCF70D023E\") and (not(TargetProcessName endswith \"\\\\client32.exe\")))|extend RuleId=\"0afbd410-de03-4078-8491-f132303cb67d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_netsupport_rat.yml\"|extend RuleTitle=\"Renamed NetSupport RAT Execution\"|extend RuleDescription=\"Detects the execution of a renamed \\\"client32.exe\\\" (NetSupport RAT) via Imphash, Product and OriginalFileName strings\";\nlet q9=_Im_ProcessCreate\n| where (TargetProcessFilename =~ \"NirCmd.exe\" and (not((TargetProcessName endswith \"\\\\nircmd.exe\" or TargetProcessName endswith \"\\\\nircmdc.exe\"))))|extend RuleId=\"264982dc-dbad-4dce-b707-1e0d3e0f73d9\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_nircmd.yml\"|extend RuleTitle=\"Renamed NirCmd.EXE Execution\"|extend RuleDescription=\"Detects the execution of a renamed \\\"NirCmd.exe\\\" binary based on the PE metadata fields.\";\nlet q10=_Im_ProcessCreate\n| where (((TargetProcessFilename =~ \"Excel.exe\" or TargetProcessFilename =~ \"MSACCESS.EXE\" or TargetProcessFilename =~ \"MSPUB.EXE\" or TargetProcessFilename =~ \"OneNote.exe\" or TargetProcessFilename =~ \"OneNoteM.exe\" or TargetProcessFilename =~ \"OUTLOOK.EXE\" or TargetProcessFilename =~ \"POWERPNT.EXE\" or TargetProcessFilename =~ \"WinWord.exe\") or (TargetProcessFileDescription =~ \"Microsoft Access\" or TargetProcessFileDescription =~ \"Microsoft Excel\" or TargetProcessFileDescription =~ \"Microsoft OneNote\" or TargetProcessFileDescription =~ \"Microsoft Outlook\" or TargetProcessFileDescription =~ \"Microsoft PowerPoint\" or TargetProcessFileDescription =~ \"Microsoft Publisher\" or TargetProcessFileDescription =~ \"Microsoft Word\" or TargetProcessFileDescription =~ \"Sent to OneNote Tool\")) and (not((TargetProcessName endswith \"\\\\EXCEL.exe\" or TargetProcessName endswith \"\\\\excelcnv.exe\" or TargetProcessName endswith \"\\\\MSACCESS.exe\" or TargetProcessName endswith \"\\\\MSPUB.EXE\" or TargetProcessName endswith \"\\\\ONENOTE.EXE\" or TargetProcessName endswith \"\\\\ONENOTEM.EXE\" or TargetProcessName endswith \"\\\\OUTLOOK.EXE\" or TargetProcessName endswith \"\\\\POWERPNT.EXE\" or TargetProcessName endswith \"\\\\WINWORD.exe\"))))|extend RuleId=\"0b0cd537-fc77-4e6e-a973-e53495c1083d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_office_processes.yml\"|extend RuleTitle=\"Renamed Office Binary Execution\"|extend RuleDescription=\"Detects the execution of a renamed office binary\";\nlet q11=_Im_ProcessCreate\n| where ((TargetProcessFileDescription =~ \"PAExec Application\" or TargetProcessFilename =~ \"PAExec.exe\" or TargetProcessFileProduct contains \"PAExec\" or (TargetProcessIMPHASH =~ \"11D40A7B7876288F919AB819CC2D9802\" or TargetProcessIMPHASH =~ \"6444f8a34e99b8f7d9647de66aabe516\" or TargetProcessIMPHASH =~ \"dfd6aa3f7b2b1035b76b718f1ddc689f\" or TargetProcessIMPHASH =~ \"1a6cca4d5460b1710a12dea39e4a592c\") or (TargetProcessIMPHASH=~\"11D40A7B7876288F919AB819CC2D9802\" or TargetProcessIMPHASH=~\"6444f8a34e99b8f7d9647de66aabe516\" or TargetProcessIMPHASH=~\"dfd6aa3f7b2b1035b76b718f1ddc689f\" or TargetProcessIMPHASH=~\"1a6cca4d5460b1710a12dea39e4a592c\")) and (not((TargetProcessName endswith \"\\\\paexec.exe\" or TargetProcessName startswith \"C:\\\\Windows\\\\PAExec-\"))))|extend RuleId=\"c4e49831-1496-40cf-8ce1-b53f942b02f9\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_paexec.yml\"|extend RuleTitle=\"Renamed PAExec Execution\"|extend RuleDescription=\"Detects execution of renamed version of PAExec. Often used by attackers\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Impact", "CommandAndControl", "CredentialAccess", "DefenseEvasion", "PrivilegeEscalation", "Execution"],
                "techniques": ["T1003", "T1036", "T1090", "T1055", "T1059", "T1202", "T1486", "T1218"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000229",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}