{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000101')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000101')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation low 01",
                "description": "Sigma Windows Process Creation low 01",
                "severity": "low",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\brave.exe\" or TargetProcessName endswith \"\\\\chrome.exe\" or TargetProcessName endswith \"\\\\msedge.exe\" or TargetProcessName endswith \"\\\\opera.exe\" or TargetProcessName endswith \"\\\\vivaldi.exe\") and TargetProcessCommandLine contains \" http\" and (TargetProcessCommandLine contains \".dat\" or TargetProcessCommandLine contains \".dll\" or TargetProcessCommandLine contains \".exe\" or TargetProcessCommandLine contains \".hta\" or TargetProcessCommandLine contains \".ps1\" or TargetProcessCommandLine contains \".txt\" or TargetProcessCommandLine contains \".vbe\" or TargetProcessCommandLine contains \".vbs\" or TargetProcessCommandLine contains \".zip\"))|extend RuleId=\"94771a71-ba41-4b6e-a757-b531372eaab6\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_browsers_inline_file_download.yml\"|extend RuleTitle=\"File Download From Browser Process Via Inline Link\"|extend RuleDescription=\"Detects execution of a browser process with a URL argument pointing to a file with a potentially interesting extension. This can be abused to download arbitrary files or to hide from the user for example by launching the browser in a minimized state.\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\msedge.exe\" or TargetProcessFilename =~ \"msedge.exe\") and (TargetProcessCommandLine contains \".exe http\" or TargetProcessCommandLine contains \"msedge http\"))|extend RuleId=\"94771a71-ba41-4b6e-a757-b531372eaab6\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_browsers_msedge_arbitrary_download.yml\"|extend RuleTitle=\"Potential Arbitrary File Download Via MSEdge.EXE\"|extend RuleDescription=\"Detects usage of the \"msedge.exe\" binary as a LOLBIN to download arbitrary file via the CLI\";\nlet q2=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \" --remote-debugging-\" or (TargetProcessName endswith \"\\\\firefox.exe\" and TargetProcessCommandLine contains \" -start-debugger-server\"))|extend RuleId=\"b3d34dc5-2efd-4ae3-845f-8ec14921f449\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_browsers_remote_debugging.yml\"|extend RuleTitle=\"Browser Started with Remote Debugging\"|extend RuleDescription=\"Detects browsers starting with the remote debugging flags. Which is a technique often used to perform browser injection attacks\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\CertMgr.exe\" or TargetProcessFilename =~ \"CERTMGT.EXE\") and (TargetProcessCommandLine contains \"/add\" and TargetProcessCommandLine contains \"root\"))|extend RuleId=\"ff992eac-6449-4c60-8c1d-91c9722a1d48\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_certmgr_certificate_installation.yml\"|extend RuleTitle=\"New Root Certificate Installed Via CertMgr.EXE\"|extend RuleDescription=\"Detects execution of \"certmgr\" with the \"add\" flag in order to install a new certificate on the system.\nAdversaries may install a root certificate on a compromised system to avoid warnings when connecting to adversary controlled web servers.\n\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\certoc.exe\" or TargetProcessFilename =~ \"CertOC.exe\") and (TargetProcessCommandLine contains \"-GetCACAPS\" and TargetProcessCommandLine contains \"http\"))|extend RuleId=\"70ad0861-d1fe-491c-a45f-fa48148a300d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_certoc_download.yml\"|extend RuleTitle=\"File Download via CertOC.EXE\"|extend RuleDescription=\"Detects when a user downloads a file by using CertOC.exe\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\certoc.exe\" or TargetProcessFilename =~ \"CertOC.exe\") and (TargetProcessCommandLine contains \" -LoadDLL \" or TargetProcessCommandLine contains \" /LoadDLL \"))|extend RuleId=\"242301bc-f92f-4476-8718-78004a6efd9f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_certoc_load_dll.yml\"|extend RuleTitle=\"DLL Loaded via CertOC.EXE\"|extend RuleDescription=\"Detects when a user installs certificates by using CertOC.exe to loads the target DLL file.\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessFilename =~ \"CertUtil.exe\") and (TargetProcessCommandLine contains \"/addstore\" or TargetProcessCommandLine contains \"-addstore\") and TargetProcessCommandLine contains \"root\")|extend RuleId=\"d2125259-ddea-4c1c-9c22-977eb5b29cf0\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_certutil_certificate_installation.yml\"|extend RuleTitle=\"New Root Certificate Installed Via Certutil.EXE\"|extend RuleDescription=\"Detects execution of \"certutil\" with the \"addstore\" flag in order to install a new certificate on the system.\nAdversaries may install a root certificate on a compromised system to avoid warnings when connecting to adversary controlled web servers.\n\";\nlet q7=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessFilename =~ \"CertUtil.exe\") and (TargetProcessCommandLine contains \"-decode \" or TargetProcessCommandLine contains \"/decode \" or TargetProcessCommandLine contains \"-decodehex \" or TargetProcessCommandLine contains \"/decodehex \"))|extend RuleId=\"cc9cbe82-7bc0-4ef5-bc23-bbfb83947be7\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_certutil_decode.yml\"|extend RuleTitle=\"File Decoded From Base64/Hex Via Certutil.EXE\"|extend RuleDescription=\"Detects the execution of certutil with either the \"decode\" or \"decodehex\" flags to decode base64 or hex encoded files. This can be abused by attackers to decode an encoded payload before execution\";\nlet q8=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessFilename =~ \"CertUtil.exe\") and (TargetProcessCommandLine contains \"urlcache \" or TargetProcessCommandLine contains \"verifyctl \") and TargetProcessCommandLine contains \"http\")|extend RuleId=\"19b08b1c-861d-4e75-a1ef-ea0c1baf202b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_certutil_download.yml\"|extend RuleTitle=\"Suspicious Download Via Certutil.EXE\"|extend RuleDescription=\"Detects the execution of certutil with certain flags that allow the utility to download files.\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessFilename =~ \"CertUtil.exe\") and (TargetProcessCommandLine contains \"-encode\" or TargetProcessCommandLine contains \"/encode\"))|extend RuleId=\"e62a9f0c-ca1e-46b2-85d5-a6da77f86d1a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_certutil_encode.yml\"|extend RuleTitle=\"File Encoded To Base64 Via Certutil.EXE\"|extend RuleDescription=\"Detects the execution of certutil with the \"encode\" flag to encode a file to base64. This can be abused by threat actors and attackers for data exfiltration\";\nlet q10=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessFilename =~ \"CertUtil.exe\") and (TargetProcessCommandLine contains \"-exportPFX \" or TargetProcessCommandLine contains \"/exportPFX \"))|extend RuleId=\"3ffd6f51-e6c1-47b7-94b4-c1e61d4117c5\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_certutil_export_pfx.yml\"|extend RuleTitle=\"Certificate Exported Via Certutil.EXE\"|extend RuleDescription=\"Detects the execution of the certutil with the \"exportPFX\" flag which allows the utility to export certificates.\";\nlet q11=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\cmd.exe\" and (ActingProcessCommandLine contains \" /c \" or ActingProcessCommandLine contains \" /r \" or ActingProcessCommandLine contains \" /k \") and TargetProcessName endswith \"\\\\chcp.com\" and (TargetProcessCommandLine endswith \"chcp\" or TargetProcessCommandLine endswith \"chcp \" or TargetProcessCommandLine endswith \"chcp  \"))|extend RuleId=\"7090adee-82e2-4269-bd59-80691e7c6338\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_chcp_codepage_lookup.yml\"|extend RuleTitle=\"Console CodePage Lookup Via CHCP\"|extend RuleDescription=\"Detects use of chcp to look up the system locale value as part of host discovery\";\nlet q12=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\chcp.com\" and (TargetProcessCommandLine endswith \" 936\" or TargetProcessCommandLine endswith \" 1258\"))|extend RuleId=\"c7942406-33dd-4377-a564-0f62db0593a3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_chcp_codepage_switch.yml\"|extend RuleTitle=\"Suspicious CodePage Switch Via CHCP\"|extend RuleDescription=\"Detects a code page switch in command line or batch scripts to a rare language\";\nlet q13=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"CIPHER.EXE\" or TargetProcessName endswith \"\\\\cipher.exe\") and TargetProcessCommandLine contains \" /w:\")|extend RuleId=\"4b046706-5789-4673-b111-66f25fe99534\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cipher_overwrite_deleted_data.yml\"|extend RuleTitle=\"Deleted Data Overwritten Via Cipher.EXE\"|extend RuleDescription=\"Detects usage of the \"cipher\" built-in utility in order to overwrite deleted data from disk.\nAdversaries may destroy data and files on specific systems or in large numbers on a network to interrupt availability to systems, services, and network resources.\nData destruction is likely to render stored data irrecoverable by forensic techniques through overwriting files or data on local and remote drives\n\";\nlet q14=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \" tunnel \" and TargetProcessCommandLine contains \"cleanup \") and (TargetProcessCommandLine contains \" --config \" or TargetProcessCommandLine contains \" --connector-id \"))|extend RuleId=\"7050bba1-1aed-454e-8f73-3f46f09ce56a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cloudflared_tunnel_cleanup.yml\"|extend RuleTitle=\"Cloudflared Tunnel Connections Cleanup\"|extend RuleDescription=\"Detects execution of the \"cloudflared\" tool with the tunnel \"cleanup\" flag in order to cleanup tunnel connections.\";\nlet q15=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \" tunnel \" and TargetProcessCommandLine contains \" run \") and (TargetProcessCommandLine contains \" --config \" or TargetProcessCommandLine contains \" --credentials-contents \" or TargetProcessCommandLine contains \" --credentials-file \" or TargetProcessCommandLine contains \" --token \"))|extend RuleId=\"9a019ffc-3580-4c9d-8d87-079f7e8d3fd4\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cloudflared_tunnel_run.yml\"|extend RuleTitle=\"Cloudflared Tunnel Execution\"|extend RuleDescription=\"Detects execution of the \"cloudflared\" tool to connect back to a tunnel. This was seen used by threat actors to maintain persistence and remote access to compromised networks.\";\nlet q16=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\cmdkey.exe\" or TargetProcessFilename =~ \"cmdkey.exe\") and (TargetProcessCommandLine contains \" /g\" and TargetProcessCommandLine contains \" /u\" and TargetProcessCommandLine contains \" /p\"))|extend RuleId=\"b1ec66c6-f4d1-4b5c-96dd-af28ccae7727\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmdkey_adding_generic_creds.yml\"|extend RuleTitle=\"New Generic Credentials Added Via Cmdkey.EXE\"|extend RuleDescription=\"Detects usage of cmdkey to add generic credentials. As an example, this has to be used before connecting to an RDP session via command line interface.\";\nlet q17=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessFilename =~ \"Cmd.Exe\") and (TargetProcessCommandLine contains \"del \" or TargetProcessCommandLine contains \"erase \") and (TargetProcessCommandLine contains \"\\\\\\*.au3\" or TargetProcessCommandLine contains \"\\\\\\*.dll\" or TargetProcessCommandLine contains \"\\\\\\*.exe\" or TargetProcessCommandLine contains \"\\\\\\*.js\"))|extend RuleId=\"204b17ae-4007-471b-917b-b917b315c5db\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmd_del_greedy_deletion.yml\"|extend RuleTitle=\"Greedy File Deletion Using Del\"|extend RuleDescription=\"Detects execution of the \"del\" builtin command to remove files using greedy/wildcard expression. This is often used by malware to delete content of folders that perhaps contains the initial malware infection or to delete evidence.\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "CommandAndControl", "Impact", "Collection", "CredentialAccess", "Discovery"],
                "techniques": ["T1485", "T1036", "T1553", "T1027", "T1003", "T1185", "T1105", "T1218", "T1102", "T1070", "T1572", "T1614", "T1090"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000101",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}