{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000115')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000115')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation low 15",
                "description": "Sigma Windows Process Creation low 15",
                "severity": "low",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \"copy-item\" or TargetProcessCommandLine contains \"copy \" or TargetProcessCommandLine contains \"cpi \" or TargetProcessCommandLine contains \" cp \" or TargetProcessCommandLine contains \"move \" or TargetProcessCommandLine contains \"move-item\" or TargetProcessCommandLine contains \" mi \" or TargetProcessCommandLine contains \" mv \") or (TargetProcessName endswith \"\\\\xcopy.exe\" or TargetProcessName endswith \"\\\\robocopy.exe\") or (TargetProcessFilename =~ \"XCOPY.EXE\" or TargetProcessFilename =~ \"robocopy.exe\")) and (TargetProcessCommandLine contains \"\\\\Amigo\\\\User Data\" or TargetProcessCommandLine contains \"\\\\BraveSoftware\\\\Brave-Browser\\\\User Data\" or TargetProcessCommandLine contains \"\\\\CentBrowser\\\\User Data\" or TargetProcessCommandLine contains \"\\\\Chromium\\\\User Data\" or TargetProcessCommandLine contains \"\\\\CocCoc\\\\Browser\\\\User Data\" or TargetProcessCommandLine contains \"\\\\Comodo\\\\Dragon\\\\User Data\" or TargetProcessCommandLine contains \"\\\\Elements Browser\\\\User Data\" or TargetProcessCommandLine contains \"\\\\Epic Privacy Browser\\\\User Data\" or TargetProcessCommandLine contains \"\\\\Google\\\\Chrome Beta\\\\User Data\" or TargetProcessCommandLine contains \"\\\\Google\\\\Chrome SxS\\\\User Data\" or TargetProcessCommandLine contains \"\\\\Google\\\\Chrome\\\\User Data\\\\\" or TargetProcessCommandLine contains \"\\\\Kometa\\\\User Data\" or TargetProcessCommandLine contains \"\\\\Maxthon5\\\\Users\" or TargetProcessCommandLine contains \"\\\\Microsoft\\\\Edge\\\\User Data\" or TargetProcessCommandLine contains \"\\\\Mozilla\\\\Firefox\\\\Profiles\" or TargetProcessCommandLine contains \"\\\\Nichrome\\\\User Data\" or TargetProcessCommandLine contains \"\\\\Opera Software\\\\Opera GX Stable\\\\\" or TargetProcessCommandLine contains \"\\\\Opera Software\\\\Opera Neon\\\\User Data\" or TargetProcessCommandLine contains \"\\\\Opera Software\\\\Opera Stable\\\\\" or TargetProcessCommandLine contains \"\\\\Orbitum\\\\User Data\" or TargetProcessCommandLine contains \"\\\\QIP Surf\\\\User Data\" or TargetProcessCommandLine contains \"\\\\Sputnik\\\\User Data\" or TargetProcessCommandLine contains \"\\\\Torch\\\\User Data\" or TargetProcessCommandLine contains \"\\\\uCozMedia\\\\Uran\\\\User Data\" or TargetProcessCommandLine contains \"\\\\Vivaldi\\\\User Data\"))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000114\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_copy_browser_data.yml\"|extend RuleTitle=\"Potential Browser Data Stealing\"|extend RuleDescription=\"Adversaries may acquire credentials from web browsers by reading files specific to the target browser.\nWeb browsers commonly save credentials such as website usernames and passwords so that they do not need to be entered manually in the future.\nWeb browsers typically store the credentials in an encrypted format within a credential store.\n\";\nlet q1=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\cmd.exe\" and TargetProcessCommandLine contains \"copy \") or ((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") and (TargetProcessCommandLine contains \"copy-item\" or TargetProcessCommandLine contains \" copy \" or TargetProcessCommandLine contains \"cpi \" or TargetProcessCommandLine contains \" cp \")) or ((TargetProcessName endswith \"\\\\robocopy.exe\" or TargetProcessName endswith \"\\\\xcopy.exe\") or (TargetProcessFilename =~ \"robocopy.exe\" or TargetProcessFilename =~ \"XCOPY.EXE\"))) and (TargetProcessCommandLine contains \"\\\\System32\" or TargetProcessCommandLine contains \"\\\\SysWOW64\" or TargetProcessCommandLine contains \"\\\\WinSxS\"))|extend RuleId=\"fff9d2b7-e11c-4a69-93d3-40ef66189767\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_copy_system_dir.yml\";\nlet q2=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"Cmd.Exe\" or TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and ((ActingProcessName contains \"\\\\Windows\\\\Installer\\\\\" and ActingProcessName contains \"msi\") and ActingProcessName endswith \"tmp\"))|extend RuleId=\"1e53dd56-8d83-4eb4-a43e-b790a05510aa\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_elavated_msi_spawned_shell.yml\";\nlet q3=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\chrome.exe\" or ActingProcessName endswith \"\\\\discord.exe\" or ActingProcessName endswith \"\\\\GitHubDesktop.exe\" or ActingProcessName endswith \"\\\\keybase.exe\" or ActingProcessName endswith \"\\\\msedge.exe\" or ActingProcessName endswith \"\\\\msedgewebview2.exe\" or ActingProcessName endswith \"\\\\msteams.exe\" or ActingProcessName endswith \"\\\\slack.exe\" or ActingProcessName endswith \"\\\\Teams.exe\") and ((TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\wscript.exe\") or (TargetProcessName contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or TargetProcessName contains \"\\\\Users\\\\Public\\\\\" or TargetProcessName contains \"\\\\Windows\\\\Temp\\\\\" or TargetProcessName contains \":\\\\Temp\\\\\")) and (not(((ActingProcessName endswith \"\\\\chrome.exe\" and TargetProcessName endswith \"\\\\chrome.exe\") or (ActingProcessName endswith \"\\\\discord.exe\" and TargetProcessName endswith \"\\\\discord.exe\") or (ActingProcessName endswith \"\\\\GitHubDesktop.exe\" and TargetProcessName endswith \"\\\\GitHubDesktop.exe\") or (ActingProcessName endswith \"\\\\keybase.exe\" and TargetProcessName endswith \"\\\\keybase.exe\") or (ActingProcessName endswith \"\\\\msedge.exe\" and TargetProcessName endswith \"\\\\msedge.exe\") or (ActingProcessName endswith \"\\\\msedgewebview2.exe\" and TargetProcessName endswith \"\\\\msedgewebview2.exe\") or (ActingProcessName endswith \"\\\\msteams.exe\" and TargetProcessName endswith \"\\\\msteams.exe\") or (ActingProcessName endswith \"\\\\slack.exe\" and TargetProcessName endswith \"\\\\slack.exe\") or (ActingProcessName endswith \"\\\\teams.exe\" and TargetProcessName endswith \"\\\\teams.exe\") or (TargetProcessName =~ \"C:\\\\Windows\\\\SysWOW64\\\\WerFault.exe\" or TargetProcessName =~ \"C:\\\\Windows\\\\System32\\\\WerFault.exe\")))) and (not((ActingProcessName endswith \"\\\\Discord.exe\" and TargetProcessCommandLine contains \"\\\\NVSMI\\\\nvidia-smi.exe\"))))|extend RuleId=\"f26eb764-fd89-464b-85e2-dc4a8e6e77b8\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_electron_app_children.yml\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\chrome.exe\" or TargetProcessName endswith \"\\\\code.exe\" or TargetProcessName endswith \"\\\\discord.exe\" or TargetProcessName endswith \"\\\\GitHubDesktop.exe\" or TargetProcessName endswith \"\\\\keybase.exe\" or TargetProcessName endswith \"\\\\msedge.exe\" or TargetProcessName endswith \"\\\\msedgewebview2.exe\" or TargetProcessName endswith \"\\\\msteams.exe\" or TargetProcessName endswith \"\\\\slack.exe\" or TargetProcessName endswith \"\\\\Teams.exe\") and (TargetProcessCommandLine contains \"--browser-subprocess-path\" or TargetProcessCommandLine contains \"--gpu-launcher\" or TargetProcessCommandLine contains \"--renderer-cmd-prefix\" or TargetProcessCommandLine contains \"--utility-cmd-prefix\"))|extend RuleId=\"378a05d8-963c-46c9-bcce-13c7657eac99\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_electron_exeuction_proxy.yml\";\nlet q5=_Im_ProcessCreate\n| where ((((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\cmd.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\" or TargetProcessFilename =~ \"Cmd.Exe\")) and ((TargetUsername contains \"AUTHORI\" or TargetUsername contains \"AUTORI\") and LogonId =~ \"0x3e7\")) and (not((((ActingProcessName contains \":\\\\Windows\\\\System32\\\\\" or ActingProcessName contains \":\\\\Program Files (x86)\\\\\" or ActingProcessName contains \":\\\\Program Files\\\\\") and (TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\powershell.exe\")) or ((ActingProcessName contains \":\\\\Windows\\\\System32\" or ActingProcessName contains \":\\\\Windows\\\\WinSxS\\\\\") and ActingProcessName endswith \"\\\\CompatTelRunner.exe\" and ActingProcessCommandLine contains \":\\\\Windows\\\\system32\\\\CompatTelRunner.exe -m:appraiser.dll -f:DoScheduledTelemetryRun\") or (ActingProcessName endswith \":\\\\Windows\\\\SysWOW64\\\\msiexec.exe\" and ActingProcessCommandLine contains \":\\\\Windows\\\\syswow64\\\\MsiExec.exe -Embedding\" and TargetProcessCommandLine contains \"\\\\RegisterMicrosoftUpdate.ps1\") or ((TargetProcessCommandLine startswith \"powershell.exe -ExecutionPolicy Restricted -Command  $res = 0; \" or TargetProcessCommandLine startswith \"powershell.exe -ExecutionPolicy Restricted -Command Write-Host \") and (TargetProcessCommandLine endswith \"Write-Host 'Final result:', $Res;\" or TargetProcessCommandLine endswith \"Write-Host \\\"Final result:\\\", $res\" or TargetProcessCommandLine endswith \"Write-Host 'Final result: 1';\")) or (TargetProcessName endswith \"\\\\cmd.exe\" and TargetProcessCommandLine contains \"/d /c C:\\\\Windows\\\\system32\\\\silcollector.cmd\") or (TargetProcessName endswith \"\\\\cmd.exe\" and (TargetProcessCommandLine endswith \"cmd.exe /c btool server list replication_port --no-log\" or TargetProcessCommandLine endswith \"cmd.exe /c btool server list general --no-log\")) or (TargetProcessName endswith \"\\\\cmd.exe\" and TargetProcessCommandLine contains \":\\\\Windows\\\\system32\\\\reg.exe query hklm\\\\software\\\\microsoft\\\\windows\\\\softwareinventorylogging /v collectionstate /reg:64\") or (TargetProcessName endswith \":\\\\Windows\\\\System32\\\\cmd.exe\" and TargetProcessCommandLine endswith \":\\\\Windows\\\\system32\\\\cmd.exe /c PAUSE\")))) and (not(((ActingProcessName endswith \":\\\\ManageEngine\\\\ADManager Plus\\\\pgsql\\\\bin\\\\postgres.exe\" and TargetProcessName endswith \"\\\\cmd.exe\") or (ActingProcessName contains \":\\\\Windows\\\\SysWOW64\\\\config\\\\systemprofile\\\\Citrix\\\\UpdaterBinaries\\\\\" and ActingProcessName endswith \"\\\\CitrixReceiverUpdater.exe\" and TargetProcessName endswith \"\\\\cmd.exe\") or (TargetProcessCommandLine contains \":\\\\WINDOWS\\\\system32\\\\cmd.exe /c \\\"\" and TargetProcessCurrentDirectory contains \":\\\\WINDOWS\\\\Temp\\\\asgard2-agent\\\\\") or (ActingProcessName contains \":\\\\Windows\\\\Temp\" and ActingProcessName endswith \"\\\\invcol.exe\" and ActingProcessCommandLine contains \":\\\\ProgramData\\\\Dell\\\\UpdateService\\\\\" and TargetProcessName endswith \"\\\\cmd.exe\") or (ActingProcessName contains \":\\\\IBM\\\\SpectrumProtect\\\\webserver\\\\scripts\\\\\" and TargetProcessCommandLine contains \":\\\\IBM\\\\SpectrumProtect\\\\webserver\\\\scripts\\\\\") or TargetProcessCommandLine contains \":\\\\Windows\\\\system32\\\\cmd.exe\\\" /C copy \\\"C:\\\\ProgramData\\\\Avira\\\\SystemSpeedup\\\\Update\\\\avira_speedup_setup_update.exe\\\"\" or (ActingProcessName =~ \"\" and TargetProcessCommandLine contains \":\\\\IBM\\\\SpectrumProtect\\\\webserver\\\\scripts\\\\\") or (isnull(ActingProcessName) and TargetProcessCommandLine contains \":\\\\IBM\\\\SpectrumProtect\\\\webserver\\\\scripts\\\\\")))))|extend RuleId=\"178e615d-e666-498b-9630-9ed363038101\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_elevated_system_shell.yml\";\nlet q6=_Im_ProcessCreate\n| where (ActingProcessName =~ \"C:\\\\Windows\\\\explorer.exe\" and TargetProcessName =~ \"C:\\\\Windows\\\\System32\\\\cmd.exe\" and (TargetProcessCommandLine contains \"powershell\" and TargetProcessCommandLine contains \".lnk\"))|extend RuleId=\"30e92f50-bb5a-4884-98b5-d20aa80f3d7a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_embed_exe_lnk.yml\";\nlet q7=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\") and (TargetProcessCommandLine contains \"\\\\{\" and TargetProcessCommandLine contains \"}\\\\\")) and (not(((TargetProcessName contains \"\\\\{\" and TargetProcessName contains \"}\\\\\") or isnull(TargetProcessName) or TargetProcessName =~ \"C:\\\\Windows\\\\System32\\\\drvinst.exe\"))))|extend RuleId=\"90b63c33-2b97-4631-a011-ceb0f47b77c3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_execution_from_guid_folder_names.yml\";\nlet q8=_Im_ProcessCreate\n| where ((TargetProcessName contains \"\\\\wwwroot\\\\\" or TargetProcessName contains \"\\\\wmpub\\\\\" or TargetProcessName contains \"\\\\htdocs\\\\\") and (not(((TargetProcessName contains \"bin\\\\\" or TargetProcessName contains \"\\\\Tools\\\\\" or TargetProcessName contains \"\\\\SMSComponent\\\\\") and ActingProcessName endswith \"\\\\services.exe\"))))|extend RuleId=\"35efb964-e6a5-47ad-bbcd-19661854018d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_execution_path_webserver.yml\";\nlet q9=_Im_ProcessCreate\n| where (((TargetProcessFileDescription =~ \"?\" and FileVersion =~ \"?\") or (TargetProcessFileDescription =~ \"?\" and TargetProcessFileProduct =~ \"?\") or (TargetProcessFileDescription =~ \"?\" and TargetProcessFileCompany =~ \"?\")) and TargetProcessName contains \"\\\\Downloads\\\\\")|extend RuleId=\"9637e8a5-7131-4f7f-bdc7-2b05d8670c43\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_file_characteristics.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["PrivilegeEscalation", "Persistence", "CredentialAccess", "DefenseEvasion", "Execution"],
                "techniques": ["T1548", "T1505", "T1059", "T1036", "T1555", "T1027"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000115",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}