{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000202')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000202')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation high 02",
                "description": "Sigma Windows Process Creation medium 02",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \"cmdexe/c\" or TargetProcessCommandLine contains \"\\\\cmd/c\" or TargetProcessCommandLine contains \"\\\"cmd/c\" or TargetProcessCommandLine contains \"cmdexe/k\" or TargetProcessCommandLine contains \"\\\\cmd/k\" or TargetProcessCommandLine contains \"\\\"cmd/k\" or TargetProcessCommandLine contains \"cmdexe/r\" or TargetProcessCommandLine contains \"\\\\cmd/r\" or TargetProcessCommandLine contains \"\\\"cmd/r\") or (TargetProcessCommandLine contains \"/cwhoami\" or TargetProcessCommandLine contains \"/cpowershell\" or TargetProcessCommandLine contains \"/cschtasks\" or TargetProcessCommandLine contains \"/cbitsadmin\" or TargetProcessCommandLine contains \"/ccertutil\" or TargetProcessCommandLine contains \"/kwhoami\" or TargetProcessCommandLine contains \"/kpowershell\" or TargetProcessCommandLine contains \"/kschtasks\" or TargetProcessCommandLine contains \"/kbitsadmin\" or TargetProcessCommandLine contains \"/kcertutil\") or (TargetProcessCommandLine contains \"cmdexe /c\" or TargetProcessCommandLine contains \"cmd /c\" or TargetProcessCommandLine contains \"cmdexe /k\" or TargetProcessCommandLine contains \"cmd /k\" or TargetProcessCommandLine contains \"cmdexe /r\" or TargetProcessCommandLine contains \"cmd /r\")) and (not(((TargetProcessCommandLine contains \"cmdexe /c \" or TargetProcessCommandLine contains \"cmd /c \" or TargetProcessCommandLine contains \"cmdexe /k \" or TargetProcessCommandLine contains \"cmd /k \" or TargetProcessCommandLine contains \"cmdexe /r \" or TargetProcessCommandLine contains \"cmd /r \") or (TargetProcessCommandLine contains \"AppData\\\\Local\\\\Programs\\\\Microsoft VS Code\\\\resources\\\\app\\\\node_modules\" or TargetProcessCommandLine endswith \"cmdexe/c \" or TargetProcessCommandLine =~ \"cmdexe /c\")))))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000201\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmd_no_space_execution.yml\";\nlet q1=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"type %windir%\\\\system32\\\\ntdlldll\" or TargetProcessCommandLine contains \"type %systemroot%\\\\system32\\\\ntdlldll\" or TargetProcessCommandLine contains \"type c:\\\\windows\\\\system32\\\\ntdlldll\" or TargetProcessCommandLine contains \"\\\\ntdlldll > \\\\\\\\\\\\pipe\\\\\")|extend RuleId=\"bbc865e4-7fcd-45a6-8ff1-95ced28ec5b2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmd_ntdllpipe_redirect.yml\";\nlet q2=_Im_ProcessCreate\n| where (((ActingProcessName endswith \"\\\\cmdexe\" or TargetProcessName endswith \"\\\\cmdexe\" or TargetProcessFilename =~ \"cmdexe\") and ((ActingProcessCommandLine contains \"/c\" or ActingProcessCommandLine contains \"/k\" or ActingProcessCommandLine contains \"/r\") or (TargetProcessCommandLine contains \"/c\" or TargetProcessCommandLine contains \"/k\" or TargetProcessCommandLine contains \"/r\")) and (ActingProcessCommandLine =~ \"///\" or TargetProcessCommandLine contains \"///\")) and (not(TargetProcessCommandLine contains \"\\\\Tasktop\\\\keycloak\\\\bin\\\\///jre\\\\bin\\\\java\")))|extend RuleId=\"087790e3-3287-436c-bccf-cbd0184a7db1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmd_path_traversal.yml\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \" -n \" or TargetProcessCommandLine contains \" /n \") and TargetProcessCommandLine contains \"Nul\" and (TargetProcessCommandLine contains \" /f \" or TargetProcessCommandLine contains \" -f \" or TargetProcessCommandLine contains \" /q \" or TargetProcessCommandLine contains \" -q \") and (TargetProcessCommandLine contains \"ping\" and TargetProcessCommandLine contains \"del \"))|extend RuleId=\"54786ddc-5b8a-11ed-9b6a-0242ac120002\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmd_ping_del_combined_execution.yml\";\nlet q4=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"copy \" and TargetProcessCommandLine contains \"\\\\\\\\?\\\\GLOBALROOT\\\\Device\\\\HarddiskVolumeShadowCopy\")|extend RuleId=\"c73124a7-3e89-44a3-bdc1-25fe4df754b1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmd_shadowcopy_access.yml\";\nlet q5=_Im_ProcessCreate\n| where ActingProcessName endswith \"\\\\cmstpexe\"|extend RuleId=\"7d4cdc5a-0076-40ca-aac8-f7e714570e47\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmstp_execution_by_creation.yml\";\nlet q6=_Im_ProcessCreate\n| where (ActingProcessCommandLine contains \"conhost\" and TargetProcessCommandLine contains \"///\")|extend RuleId=\"ee5e119b-1f75-4b34-add8-3be976961e39\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_conhost_path_traversal.yml\";\nlet q7=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\regexe\" or TargetProcessFilename =~ \"regexe\") and (TargetProcessCommandLine contains \"add\" and TargetProcessCommandLine contains \"CurrentVersion\\\\Control Panel\\\\CPLs\")) or (TargetProcessCommandLine endswith \"cpl\" and (not(((TargetProcessCommandLine contains \"\\\\System32\\\\\" or TargetProcessCommandLine contains \"%System%\" or TargetProcessCommandLine contains \"|C:\\\\Windows\\\\system32|\") or (TargetProcessCommandLine contains \"regsvr32 \" and TargetProcessCommandLine contains \" /s \" and TargetProcessCommandLine contains \"igfxCPLcpl\"))))))|extend RuleId=\"0ba863e6-def5-4e50-9cea-4dd8c7dc46a4\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_control_panel_item.yml\";\nlet q8=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\createdumpexe\" or TargetProcessFilename =~ \"FX_VER_INTERNALNAME_STR\") and (TargetProcessCommandLine contains \" -u \" or TargetProcessCommandLine contains \" --full \" or TargetProcessCommandLine contains \" -f \" or TargetProcessCommandLine contains \" --name \" or TargetProcessCommandLine contains \"dmp \"))|extend RuleId=\"515c8be5-e5df-4c5e-8f6d-a4a2f05e4b48\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_createdump_lolbin_execution.yml\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\cscexe\" or TargetProcessFilename =~ \"cscexe\") and ((ActingProcessName endswith \"\\\\cscriptexe\" or ActingProcessName endswith \"\\\\mshtaexe\" or ActingProcessName endswith \"\\\\winwordexe\" or ActingProcessName endswith \"\\\\wscriptexe\") or ((ActingProcessName endswith \"\\\\powershellexe\" or ActingProcessName endswith \"\\\\pwshexe\") and (ActingProcessCommandLine contains \"-Encoded \" or ActingProcessCommandLine contains \"FromBase64String\")) or (ActingProcessCommandLine matches regex \"([Pp]rogram[Dd]ata|%([Ll]ocal)?[Aa]pp[Dd]ata%|\\\\\\\\[Aa]pp[Dd]ata\\\\\\\\([Ll]ocal(Ll]ow)?|[Rr]oaming))\\\\\\\\[^\\\\\\\\]{1,256}$\" or (ActingProcessCommandLine contains \":\\\\Users\\\\Public\\\\\" or ActingProcessCommandLine contains \":\\\\PerfLogs\\\\\" or ActingProcessCommandLine contains \"\\\\Temporary Internet\") or (ActingProcessCommandLine contains \":\\\\Users\\\\\" and ActingProcessCommandLine contains \"\\\\Favorites\\\\\") or (ActingProcessCommandLine contains \":\\\\Users\\\\\" and ActingProcessCommandLine contains \"\\\\Favourites\\\\\") or (ActingProcessCommandLine contains \":\\\\Users\\\\\" and ActingProcessCommandLine contains \"\\\\Contacts\\\\\") or (ActingProcessCommandLine contains \":\\\\Users\\\\\" and ActingProcessCommandLine contains \"\\\\Pictures\\\\\"))) and (not((ActingProcessCommandLine contains \"JwB7ACIAZgBhAGkAbABlAGQAIgA6AHQAcgB1AGUALAAiAG0AcwBnACIAOgAiAEEAbgBzAGkAYgBsAGUAIAByAGUAcQB1AGkAcgBlAHMAIABQAG8AdwBlAHIAUwBoAGUAbABsACAAdgAzAC4AMAAgAG8AcgAgAG4AZQB3AGUAcgAiAH0AJw\" or ActingProcessCommandLine contains \"cAewAiAGYAYQBpAGwAZQBkACIAOgB0AHIAdQBlACwAIgBtAHMAZwAiADoAIgBBAG4AcwBpAGIAbABlACAAcgBlAHEAdQBpAHIAZQBzACAAUABvAHcAZQByAFMAaABlAGwAbAAgAHYAMwAuADAAIABvAHIAIABuAGUAdwBlAHIAIgB9ACcA\" or ActingProcessCommandLine contains \"nAHsAIgBmAGEAaQBsAGUAZAAiADoAdAByAHUAZQAsACIAbQBzAGcAIgA6ACIAQQBuAHMAaQBiAGwAZQAgAHIAZQBxAHUAaQByAGUAcwAgAFAAbwB3AGUAcgBTAGgAZQBsAGwAIAB2ADMALgAwACAAbwByACAAbgBlAHcAZQByACIAfQAnA\"))))|extend RuleId=\"b730a276-6b63-41b8-bcf8-55930c8fc6ee\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_csc_susp_parent.yml\";\nlet q10=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\csiexe\" and (ActingProcessName endswith \"\\\\powershellexe\" or ActingProcessName endswith \"\\\\pwshexe\" or ActingProcessName endswith \"\\\\powershell_iseexe\") and TargetProcessFilename =~ \"csiexe\")|extend RuleId=\"a9e416a8-e613-4f8b-88b8-a7d1d1af2f61\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_csi_use_of_csharp_console.yml\";\nlet q11=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\curlexe\" or TargetProcessFilename =~ \"curlexe\") and TargetProcessCommandLine matches regex \"://[0-9]{1,3}\\\\.[0-9]{1,3}\\\\.[0-9]{1,3}\\\\.[0-9]{1,3}\" and TargetProcessCommandLine contains \"http\" and (TargetProcessCommandLine contains \" -O\" or TargetProcessCommandLine contains \"--remote-name\" or TargetProcessCommandLine contains \"--output\") and (TargetProcessCommandLine endswith \"ps1\" or TargetProcessCommandLine endswith \"ps1'\" or TargetProcessCommandLine endswith \"ps1\\\"\" or TargetProcessCommandLine endswith \"dat\" or TargetProcessCommandLine endswith \"dat'\" or TargetProcessCommandLine endswith \"dat\\\"\" or TargetProcessCommandLine endswith \"msi\" or TargetProcessCommandLine endswith \"msi'\" or TargetProcessCommandLine endswith \"msi\\\"\" or TargetProcessCommandLine endswith \"bat\" or TargetProcessCommandLine endswith \"bat'\" or TargetProcessCommandLine endswith \"bat\\\"\" or TargetProcessCommandLine endswith \"exe\" or TargetProcessCommandLine endswith \"exe'\" or TargetProcessCommandLine endswith \"exe\\\"\" or TargetProcessCommandLine endswith \"vbs\" or TargetProcessCommandLine endswith \"vbs'\" or TargetProcessCommandLine endswith \"vbs\\\"\" or TargetProcessCommandLine endswith \"vbe\" or TargetProcessCommandLine endswith \"vbe'\" or TargetProcessCommandLine endswith \"vbe\\\"\" or TargetProcessCommandLine endswith \"hta\" or TargetProcessCommandLine endswith \"hta'\" or TargetProcessCommandLine endswith \"hta\\\"\" or TargetProcessCommandLine endswith \"dll\" or TargetProcessCommandLine endswith \"dll'\" or TargetProcessCommandLine endswith \"dll\\\"\" or TargetProcessCommandLine endswith \"psm1\" or TargetProcessCommandLine endswith \"psm1'\" or TargetProcessCommandLine endswith \"psm1\\\"\"))|extend RuleId=\"5cb299fc-5fb1-4d07-b989-0644c68b6043\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_curl_download_direct_ip.yml\";\nlet q12=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\curlexe\" or TargetProcessFilename =~ \"curlexe\") and TargetProcessCommandLine matches regex \"://[0-9]{1,3}\\\\.[0-9]{1,3}\\\\.[0-9]{1,3}\\\\.[0-9]{1,3}\" and TargetProcessCommandLine contains \"http\" and (TargetProcessCommandLine contains \" -O\" or TargetProcessCommandLine contains \"--remote-name\" or TargetProcessCommandLine contains \"--output\") and (TargetProcessCommandLine endswith \"bat\" or TargetProcessCommandLine endswith \"bat\\\"\" or TargetProcessCommandLine endswith \"dat\" or TargetProcessCommandLine endswith \"dat\\\"\" or TargetProcessCommandLine endswith \"dll\" or TargetProcessCommandLine endswith \"dll\\\"\" or TargetProcessCommandLine endswith \"exe\" or TargetProcessCommandLine endswith \"exe\\\"\" or TargetProcessCommandLine endswith \"gif\" or TargetProcessCommandLine endswith \"gif\\\"\" or TargetProcessCommandLine endswith \"hta\" or TargetProcessCommandLine endswith \"hta\\\"\" or TargetProcessCommandLine endswith \"jpeg\" or TargetProcessCommandLine endswith \"jpeg\\\"\" or TargetProcessCommandLine endswith \"log\" or TargetProcessCommandLine endswith \"log\\\"\" or TargetProcessCommandLine endswith \"msi\" or TargetProcessCommandLine endswith \"msi\\\"\" or TargetProcessCommandLine endswith \"png\" or TargetProcessCommandLine endswith \"png\\\"\" or TargetProcessCommandLine endswith \"ps1\" or TargetProcessCommandLine endswith \"ps1\\\"\" or TargetProcessCommandLine endswith \"psm1\" or TargetProcessCommandLine endswith \"psm1\\\"\" or TargetProcessCommandLine endswith \"vbe\" or TargetProcessCommandLine endswith \"vbe\\\"\" or TargetProcessCommandLine endswith \"vbs\" or TargetProcessCommandLine endswith \"vbs\\\"\" or TargetProcessCommandLine endswith \"bat'\" or TargetProcessCommandLine endswith \"dat'\" or TargetProcessCommandLine endswith \"dll'\" or TargetProcessCommandLine endswith \"exe'\" or TargetProcessCommandLine endswith \"gif'\" or TargetProcessCommandLine endswith \"hta'\" or TargetProcessCommandLine endswith \"jpeg'\" or TargetProcessCommandLine endswith \"log'\" or TargetProcessCommandLine endswith \"msi'\" or TargetProcessCommandLine endswith \"png'\" or TargetProcessCommandLine endswith \"ps1'\" or TargetProcessCommandLine endswith \"psm1'\" or TargetProcessCommandLine endswith \"vbe'\" or TargetProcessCommandLine endswith \"vbs'\"))|extend RuleId=\"5cb299fc-5fb1-4d07-b989-0644c68b6043\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_curl_download_direct_ip_susp_extensions.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Persistence", "Execution", "Impact", "DefenseEvasion", "PrivilegeEscalation", "CredentialAccess"],
                "techniques": ["T1127", "T1490", "T1070", "T1218", "T1027", "T1059", "T1546", "T1036", "T1003"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000202",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}