{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-4c76-45a9-804d-dc3f355f2011')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-4c76-45a9-804d-dc3f355f2011')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation high 011",
                "description": "Sigma Windows Process Creation high 011",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\netsh.exe\" or TargetProcessFilename =~ \"netsh.exe\") and (TargetProcessCommandLine contains \"firewall \" and TargetProcessCommandLine contains \"add \" and TargetProcessCommandLine contains \"tcp \" and TargetProcessCommandLine contains \"3389\") and (TargetProcessCommandLine contains \"portopening\" or (TargetProcessCommandLine contains \"advfirewall\" and TargetProcessCommandLine contains \"rule\" and TargetProcessCommandLine contains \"allow\")))|extend RuleId=\"01aeb693-138d-49d2-9403-c4f52d7d3d62\";\nlet q1=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\netsh.exe\" and (TargetProcessCommandLine contains \"add\" and TargetProcessCommandLine contains \"helper\"))|extend RuleId=\"56321594-9087-49d9-bf10-524fe8479452\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\netsh.exe\" or TargetProcessFilename =~ \"netsh.exe\") and (TargetProcessCommandLine contains \" i\" and TargetProcessCommandLine contains \" p\" and TargetProcessCommandLine contains \"=3389\" and TargetProcessCommandLine contains \" c\"))|extend RuleId=\"782d6f3e-4c5d-4b8c-92a3-1d05fed72e63\";\nlet q3=_Im_ProcessCreate\n| where ((((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") or (TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\")) and TargetProcessCommandLine contains \" user \" and (TargetProcessCommandLine contains \" J\u00e4rjestelm\u00e4nvalvoja \" or TargetProcessCommandLine contains \" Rendszergazda \" or TargetProcessCommandLine contains \" \u0410\u0434\u043c\u0438\u043d\u0438\u0441\u0442\u0440\u0430\u0442\u043e\u0440 \" or TargetProcessCommandLine contains \" Administrateur \" or TargetProcessCommandLine contains \" Administrador \" or TargetProcessCommandLine contains \" Administrat\u00f6r \" or TargetProcessCommandLine contains \" Administrator \" or TargetProcessCommandLine contains \" guest \" or TargetProcessCommandLine contains \" DefaultAccount \" or TargetProcessCommandLine contains \" \\\"J\u00e4rjestelm\u00e4nvalvoja\\\" \" or TargetProcessCommandLine contains \" \\\"Rendszergazda\\\" \" or TargetProcessCommandLine contains \" \\\"\u0410\u0434\u043c\u0438\u043d\u0438\u0441\u0442\u0440\u0430\u0442\u043e\u0440\\\" \" or TargetProcessCommandLine contains \" \\\"Administrateur\\\" \" or TargetProcessCommandLine contains \" \\\"Administrador\\\" \" or TargetProcessCommandLine contains \" \\\"Administrat\u00f6r\\\" \" or TargetProcessCommandLine contains \" \\\"Administrator\\\" \" or TargetProcessCommandLine contains \" \\\"guest\\\" \" or TargetProcessCommandLine contains \" \\\"DefaultAccount\\\" \" or TargetProcessCommandLine contains \" 'J\u00e4rjestelm\u00e4nvalvoja' \" or TargetProcessCommandLine contains \" 'Rendszergazda' \" or TargetProcessCommandLine contains \" '\u0410\u0434\u043c\u0438\u043d\u0438\u0441\u0442\u0440\u0430\u0442\u043e\u0440' \" or TargetProcessCommandLine contains \" 'Administrateur' \" or TargetProcessCommandLine contains \" 'Administrador' \" or TargetProcessCommandLine contains \" 'Administrat\u00f6r' \" or TargetProcessCommandLine contains \" 'Administrator' \" or TargetProcessCommandLine contains \" 'guest' \" or TargetProcessCommandLine contains \" 'DefaultAccount' \")) and (not((TargetProcessCommandLine contains \"guest\" and TargetProcessCommandLine contains \"/active no\"))))|extend RuleId=\"5b768e71-86f2-4879-b448-81061cbae951\";\nlet q4=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") or (TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\")) and (TargetProcessCommandLine contains \"user\" and TargetProcessCommandLine contains \"add\" and TargetProcessCommandLine contains \"expires:never\"))|extend RuleId=\"b9f0e6f5-09b4-4358-bae4-08408705bd5c\";\nlet q5=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") or (TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\")) and (TargetProcessCommandLine contains \" use \" and TargetProcessCommandLine contains \" http\"))|extend RuleId=\"7e6237fe-3ddb-438f-9381-9bf9de5af8d0\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\nltest.exe\" or TargetProcessFilename =~ \"nltestrk.exe\") and ((TargetProcessCommandLine contains \"/server\" and TargetProcessCommandLine contains \"/query\") or (TargetProcessCommandLine contains \"/dclist:\" or TargetProcessCommandLine contains \"/parentdomain\" or TargetProcessCommandLine contains \"/domain_trusts\" or TargetProcessCommandLine contains \"/all_trusts\" or TargetProcessCommandLine contains \"/trusted_domains\" or TargetProcessCommandLine contains \"/user\")))|extend RuleId=\"5cc90652-4cbd-4241-aa3b-4b462fa5a248\";\nlet q7=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\node.exe\" and (TargetProcessCommandLine contains \" -e \" or TargetProcessCommandLine contains \" --eval \")) and (TargetProcessCommandLine contains \".exec(\" and TargetProcessCommandLine contains \"net.socket\" and TargetProcessCommandLine contains \".connect\" and TargetProcessCommandLine contains \"child_process\"))|extend RuleId=\"6640f31c-01ad-49b5-beb5-83498a5cd8bd\";\nlet q8=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"nslookup\" and TargetProcessCommandLine contains \"_ldap._tcp.dc._msdcs.\")|extend RuleId=\"e6313acd-208c-44fc-a0ff-db85d572e90e\";\nlet q9=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\odbcconf.exe\" or TargetProcessFilename =~ \"odbcconf.exe\") and TargetProcessCommandLine contains \"INSTALLDRIVER \") and (not(TargetProcessCommandLine contains \".dll\")))|extend RuleId=\"cb0fe7c5-f3a3-484d-aa25-d350a7912729\";\nlet q10=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\odbcconf.exe\" or TargetProcessFilename =~ \"odbcconf.exe\") and (TargetProcessCommandLine contains \":\\\\PerfLogs\\\\\" or TargetProcessCommandLine contains \":\\\\ProgramData\\\\\" or TargetProcessCommandLine contains \":\\\\Temp\\\\\" or TargetProcessCommandLine contains \":\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\Registration\\\\CRMLog\" or TargetProcessCommandLine contains \":\\\\Windows\\\\System32\\\\com\\\\dmp\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\System32\\\\FxsTmp\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\System32\\\\Microsoft\\\\Crypto\\\\RSA\\\\MachineKeys\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\color\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\System32\\\\spool\\\\PRINTERS\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\System32\\\\spool\\\\SERVERS\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\System32\\\\Tasks_Migrated\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\System32\\\\Tasks\\\\Microsoft\\\\Windows\\\\SyncCenter\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\SysWOW64\\\\com\\\\dmp\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\SysWOW64\\\\FxsTmp\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\SysWOW64\\\\Tasks\\\\Microsoft\\\\Windows\\\\PLA\\\\System\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\SysWOW64\\\\Tasks\\\\Microsoft\\\\Windows\\\\SyncCenter\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\Tasks\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\Temp\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\Tracing\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\\"))|extend RuleId=\"6b65c28e-11f3-46cb-902a-68f2cafaf474\";\nlet q11=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\odbcconf.exe\" or TargetProcessFilename =~ \"odbcconf.exe\") and TargetProcessCommandLine contains \"REGSVR \") and (not(TargetProcessCommandLine contains \".dll\")))|extend RuleId=\"ba4cfc11-d0fa-4d94-bf20-7c332c412e76\";\nlet q12=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\odbcconf.exe\" or TargetProcessFilename =~ \"odbcconf.exe\") and (TargetProcessCommandLine contains \" -f \" or TargetProcessCommandLine contains \" /f \")) and (not((TargetProcessCommandLine contains \".rsp\" or (ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\runonce.exe\" and TargetProcessName =~ \"C:\\\\Windows\\\\System32\\\\odbcconf.exe\" and TargetProcessCommandLine contains \".exe /E /F \\\"C:\\\\WINDOWS\\\\system32\\\\odbcconf.tmp\\\"\")))))|extend RuleId=\"2d32dd6f-3196-4093-b9eb-1ad8ab088ca5\";\nlet q13=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\EXCEL.EXE\" or TargetProcessName endswith \"\\\\POWERPNT.EXE\" or TargetProcessName endswith \"\\\\WINWORD.exe\") or (TargetProcessFilename =~ \"Excel.exe\" or TargetProcessFilename =~ \"POWERPNT.EXE\" or TargetProcessFilename =~ \"WinWord.exe\")) and (TargetProcessCommandLine contains \"http://\" or TargetProcessCommandLine contains \"https://\"))|extend RuleId=\"4ae3e30b-b03f-43aa-87e3-b622f4048eed\";\nlet q14=_Im_ProcessCreate\n| where (((ActingProcessName endswith \"\\\\explorer.exe\" or ActingProcessName endswith \"\\\\dopus.exe\") and ((TargetProcessName endswith \"\\\\EXCEL.EXE\" or TargetProcessName endswith \"\\\\POWERPNT.EXE\" or TargetProcessName endswith \"\\\\WINWORD.exe\") or (TargetProcessFilename =~ \"Excel.exe\" or TargetProcessFilename =~ \"POWERPNT.EXE\" or TargetProcessFilename =~ \"WinWord.exe\")) and (TargetProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\Microsoft\\\\Templates\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\Microsoft\\\\Word\\\\Startup\\\\\" or TargetProcessCommandLine contains \"\\\\Microsoft Office\\\\root\\\\Templates\\\\\" or TargetProcessCommandLine contains \"\\\\Microsoft Office\\\\Templates\\\\\")) and (not((TargetProcessCommandLine endswith \".dotx\" or TargetProcessCommandLine endswith \".xltx\" or TargetProcessCommandLine endswith \".potx\"))))|extend RuleId=\"f99abdf0-6283-4e71-bd2b-b5c048a94743\";\nlet q15=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\onenote.exe\" and (((TargetProcessFilename =~ \"bitsadmin.exe\" or TargetProcessFilename =~ \"CertOC.exe\" or TargetProcessFilename =~ \"CertUtil.exe\" or TargetProcessFilename =~ \"Cmd.Exe\" or TargetProcessFilename =~ \"CMSTP.EXE\" or TargetProcessFilename =~ \"cscript.exe\" or TargetProcessFilename =~ \"curl.exe\" or TargetProcessFilename =~ \"HH.exe\" or TargetProcessFilename =~ \"IEExec.exe\" or TargetProcessFilename =~ \"InstallUtil.exe\" or TargetProcessFilename =~ \"javaw.exe\" or TargetProcessFilename =~ \"Microsoft.Workflow.Compiler.exe\" or TargetProcessFilename =~ \"msdt.exe\" or TargetProcessFilename =~ \"MSHTA.EXE\" or TargetProcessFilename =~ \"msiexec.exe\" or TargetProcessFilename =~ \"Msxsl.exe\" or TargetProcessFilename =~ \"odbcconf.exe\" or TargetProcessFilename =~ \"pcalua.exe\" or TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"RegAsm.exe\" or TargetProcessFilename =~ \"RegSvcs.exe\" or TargetProcessFilename =~ \"REGSVR32.exe\" or TargetProcessFilename =~ \"RUNDLL32.exe\" or TargetProcessFilename =~ \"schtasks.exe\" or TargetProcessFilename =~ \"ScriptRunner.exe\" or TargetProcessFilename =~ \"wmic.exe\" or TargetProcessFilename =~ \"WorkFolders.exe\" or TargetProcessFilename =~ \"wscript.exe\") or (TargetProcessName endswith \"\\\\AppVLP.exe\" or TargetProcessName endswith \"\\\\bash.exe\" or TargetProcessName endswith \"\\\\bitsadmin.exe\" or TargetProcessName endswith \"\\\\certoc.exe\" or TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\cmstp.exe\" or TargetProcessName endswith \"\\\\control.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\curl.exe\" or TargetProcessName endswith \"\\\\forfiles.exe\" or TargetProcessName endswith \"\\\\hh.exe\" or TargetProcessName endswith \"\\\\ieexec.exe\" or TargetProcessName endswith \"\\\\installutil.exe\" or TargetProcessName endswith \"\\\\javaw.exe\" or TargetProcessName endswith \"\\\\mftrace.exe\" or TargetProcessName endswith \"\\\\Microsoft.Workflow.Compiler.exe\" or TargetProcessName endswith \"\\\\msbuild.exe\" or TargetProcessName endswith \"\\\\msdt.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\msidb.exe\" or TargetProcessName endswith \"\\\\msiexec.exe\" or TargetProcessName endswith \"\\\\msxsl.exe\" or TargetProcessName endswith \"\\\\odbcconf.exe\" or TargetProcessName endswith \"\\\\pcalua.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\regasm.exe\" or TargetProcessName endswith \"\\\\regsvcs.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessName endswith \"\\\\scrcons.exe\" or TargetProcessName endswith \"\\\\scriptrunner.exe\" or TargetProcessName endswith \"\\\\sh.exe\" or TargetProcessName endswith \"\\\\svchost.exe\" or TargetProcessName endswith \"\\\\verclsid.exe\" or TargetProcessName endswith \"\\\\wmic.exe\" or TargetProcessName endswith \"\\\\workfolders.exe\" or TargetProcessName endswith \"\\\\wscript.exe\")) or (TargetProcessName endswith \"\\\\explorer.exe\" and (TargetProcessCommandLine contains \".hta\" or TargetProcessCommandLine contains \".vb\" or TargetProcessCommandLine contains \".wsh\" or TargetProcessCommandLine contains \".js\" or TargetProcessCommandLine contains \".ps\" or TargetProcessCommandLine contains \".scr\" or TargetProcessCommandLine contains \".pif\" or TargetProcessCommandLine contains \".bat\" or TargetProcessCommandLine contains \".cmd\")) or (TargetProcessName contains \"\\\\AppData\\\\\" or TargetProcessName contains \"\\\\Users\\\\Public\\\\\" or TargetProcessName contains \"\\\\ProgramData\\\\\" or TargetProcessName contains \"\\\\Windows\\\\Tasks\\\\\" or TargetProcessName contains \"\\\\Windows\\\\Temp\\\\\" or TargetProcessName contains \"\\\\Windows\\\\System32\\\\Tasks\\\\\")) and (not(((TargetProcessName endswith \"\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\current\\\\Teams.exe\" and TargetProcessCommandLine endswith \"-Embedding\") or (TargetProcessName contains \"\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\\" and TargetProcessName endswith \"\\\\FileCoAuth.exe\" and TargetProcessCommandLine endswith \"-Embedding\")))))|extend RuleId=\"c27515df-97a9-4162-8a60-dc0eeb51b775\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "PrivilegeEscalation", "Collection", "Discovery", "LateralMovement", "Persistence", "InitialAccess", "CommandAndControl"],
                "techniques": ["T1218", "T1482", "T1087", "T1562", "T1127", "T1136", "T1560", "T1566", "T1021", "T1546", "T1090", "T1082", "T1016", "T1202"],
                "alertRuleTemplateName": "5163A000-4c76-45a9-804d-dc3f355f2011",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}