{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-4c76-45a9-804d-dc3f355f2034')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-4c76-45a9-804d-dc3f355f2034')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation high 034",
                "description": "Sigma Windows Process Creation high 034",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\w32tm.exe\" or TargetProcessFilename =~ \"w32time.dll\") and (TargetProcessCommandLine contains \"/stripchart\" and TargetProcessCommandLine contains \"/computer:\" and TargetProcessCommandLine contains \"/period:\" and TargetProcessCommandLine contains \"/dataonly\" and TargetProcessCommandLine contains \"/samples:\"))|extend RuleId=\"6da2c9f5-7c53-401b-aacb-92c040ce1215\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\wab.exe\" or TargetProcessName endswith \"\\\\wabmig.exe\") and (not((TargetProcessName startswith \"C:\\\\Windows\\\\WinSxS\\\\\" or TargetProcessName startswith \"C:\\\\Program Files\\\\Windows Mail\\\\\" or TargetProcessName startswith \"C:\\\\Program Files (x86)\\\\Windows Mail\\\\\"))))|extend RuleId=\"395907ee-96e5-4666-af2e-2ca91688e151\";\nlet q2=_Im_ProcessCreate\n| where (((ActingProcessName endswith \"\\\\WmiPrvSE.exe\" or ActingProcessName endswith \"\\\\svchost.exe\" or ActingProcessName endswith \"\\\\dllhost.exe\") and (TargetProcessName endswith \"\\\\wab.exe\" or TargetProcessName endswith \"\\\\wabmig.exe\")) or (ActingProcessName endswith \"\\\\wab.exe\" or ActingProcessName endswith \"\\\\wabmig.exe\"))|extend RuleId=\"63d1ccc0-2a43-4f4b-9289-361b308991ff\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\wbadmin.exe\" or TargetProcessFilename =~ \"WBADMIN.EXE\") and (TargetProcessCommandLine contains \"delete \" and TargetProcessCommandLine contains \"systemstatebackup \" and TargetProcessCommandLine contains \"-keepVersions:0\"))|extend RuleId=\"89f75308-5b1b-4390-b2d8-d6b2340efaf8\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\w3wp.exe\" or ActingProcessName endswith \"\\\\w3wp.exe\") and (TargetProcessCommandLine contains \"&ipconfig&echo\" or TargetProcessCommandLine contains \"&quser&echo\" or TargetProcessCommandLine contains \"&whoami&echo\" or TargetProcessCommandLine contains \"&c:&echo\" or TargetProcessCommandLine contains \"&cd&echo\" or TargetProcessCommandLine contains \"&dir&echo\" or TargetProcessCommandLine contains \"&echo [E]\" or TargetProcessCommandLine contains \"&echo [S]\"))|extend RuleId=\"fa3c117a-bc0d-416e-a31b-0c0e80653efb\";\nlet q5=_Im_ProcessCreate\n| where (((ActingProcessName endswith \"\\\\w3wp.exe\" or ActingProcessName endswith \"\\\\php-cgi.exe\" or ActingProcessName endswith \"\\\\nginx.exe\" or ActingProcessName endswith \"\\\\httpd.exe\" or ActingProcessName endswith \"\\\\caddy.exe\" or ActingProcessName endswith \"\\\\ws_tomcatservice.exe\") or ((ActingProcessName endswith \"\\\\java.exe\" or ActingProcessName endswith \"\\\\javaw.exe\") and (ActingProcessName contains \"-tomcat-\" or ActingProcessName contains \"\\\\tomcat\")) or ((ActingProcessName endswith \"\\\\java.exe\" or ActingProcessName endswith \"\\\\javaw.exe\") and (TargetProcessCommandLine contains \"catalina.jar\" or TargetProcessCommandLine contains \"CATALINA_HOME\"))) and (((TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\") and (TargetProcessCommandLine contains \" user \" or TargetProcessCommandLine contains \" use \" or TargetProcessCommandLine contains \" group \")) or (TargetProcessFilename =~ \"ping.exe\" and TargetProcessCommandLine contains \" -n \") or (TargetProcessCommandLine contains \"&cd&echo\" or TargetProcessCommandLine contains \"cd /d \") or (TargetProcessFilename =~ \"wmic.exe\" and TargetProcessCommandLine contains \" /node:\") or ((TargetProcessName endswith \"\\\\whoami.exe\" or TargetProcessName endswith \"\\\\systeminfo.exe\" or TargetProcessName endswith \"\\\\quser.exe\" or TargetProcessName endswith \"\\\\ipconfig.exe\" or TargetProcessName endswith \"\\\\pathping.exe\" or TargetProcessName endswith \"\\\\tracert.exe\" or TargetProcessName endswith \"\\\\netstat.exe\" or TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessName endswith \"\\\\vssadmin.exe\" or TargetProcessName endswith \"\\\\wevtutil.exe\" or TargetProcessName endswith \"\\\\tasklist.exe\") or (TargetProcessFilename =~ \"whoami.exe\" or TargetProcessFilename =~ \"sysinfo.exe\" or TargetProcessFilename =~ \"quser.exe\" or TargetProcessFilename =~ \"ipconfig.exe\" or TargetProcessFilename =~ \"pathping.exe\" or TargetProcessFilename =~ \"tracert.exe\" or TargetProcessFilename =~ \"netstat.exe\" or TargetProcessFilename =~ \"schtasks.exe\" or TargetProcessFilename =~ \"VSSADMIN.EXE\" or TargetProcessFilename =~ \"wevtutil.exe\" or TargetProcessFilename =~ \"tasklist.exe\")) or (TargetProcessCommandLine contains \" Test-NetConnection \" or TargetProcessCommandLine contains \"dir \\\\\")))|extend RuleId=\"bed2a484-9348-4143-8a8a-b801c979301c\";\nlet q6=_Im_ProcessCreate\n| where (((ActingProcessName endswith \"\\\\w3wp.exe\" or ActingProcessName endswith \"\\\\php-cgi.exe\" or ActingProcessName endswith \"\\\\nginx.exe\" or ActingProcessName endswith \"\\\\httpd.exe\" or ActingProcessName endswith \"\\\\caddy.exe\" or ActingProcessName endswith \"\\\\ws_tomcatservice.exe\") or ((ActingProcessName endswith \"\\\\java.exe\" or ActingProcessName endswith \"\\\\javaw.exe\") and (ActingProcessName contains \"-tomcat-\" or ActingProcessName contains \"\\\\tomcat\")) or ((ActingProcessName endswith \"\\\\java.exe\" or ActingProcessName endswith \"\\\\javaw.exe\") and (TargetProcessCommandLine contains \"catalina.jar\" or TargetProcessCommandLine contains \"CATALINA_HOME\"))) and ((TargetProcessCommandLine contains \"rundll32\" and TargetProcessCommandLine contains \"comsvcs\") or (TargetProcessCommandLine contains \" -hp\" and TargetProcessCommandLine contains \" a \" and TargetProcessCommandLine contains \" -m\") or (TargetProcessCommandLine contains \"net\" and TargetProcessCommandLine contains \" user \" and TargetProcessCommandLine contains \" /add\") or (TargetProcessCommandLine contains \"net\" and TargetProcessCommandLine contains \" localgroup \" and TargetProcessCommandLine contains \" administrators \" and TargetProcessCommandLine contains \"/add\") or (TargetProcessName endswith \"\\\\ntdsutil.exe\" or TargetProcessName endswith \"\\\\ldifde.exe\" or TargetProcessName endswith \"\\\\adfind.exe\" or TargetProcessName endswith \"\\\\procdump.exe\" or TargetProcessName endswith \"\\\\Nanodump.exe\" or TargetProcessName endswith \"\\\\vssadmin.exe\" or TargetProcessName endswith \"\\\\fsutil.exe\") or (TargetProcessCommandLine contains \" -NoP \" or TargetProcessCommandLine contains \" -W Hidden \" or TargetProcessCommandLine contains \" -decode \" or TargetProcessCommandLine contains \" /decode \" or TargetProcessCommandLine contains \"reg save \" or TargetProcessCommandLine contains \".downloadstring(\" or TargetProcessCommandLine contains \".downloadfile(\" or TargetProcessCommandLine contains \"FromBase64String\" or TargetProcessCommandLine contains \" /ticket:\" or TargetProcessCommandLine contains \" sekurlsa\" or TargetProcessCommandLine contains \".dmp full\" or TargetProcessCommandLine contains \"process call create\" or TargetProcessCommandLine contains \"whoami /priv\")))|extend RuleId=\"4ebc877f-4612-45cb-b3a5-8e3834db36c9\";\nlet q7=_Im_ProcessCreate\n| where (((ActingProcessName endswith \"\\\\w3wp.exe\" or ActingProcessName endswith \"\\\\php-cgi.exe\" or ActingProcessName endswith \"\\\\nginx.exe\" or ActingProcessName endswith \"\\\\httpd.exe\" or ActingProcessName endswith \"\\\\caddy.exe\" or ActingProcessName endswith \"\\\\ws_tomcatservice.exe\") or ((ActingProcessName endswith \"\\\\java.exe\" or ActingProcessName endswith \"\\\\javaw.exe\") and (ActingProcessName contains \"-tomcat-\" or ActingProcessName contains \"\\\\tomcat\")) or ((ActingProcessName endswith \"\\\\java.exe\" or ActingProcessName endswith \"\\\\javaw.exe\") and (TargetProcessCommandLine contains \"catalina.jar\" or TargetProcessCommandLine contains \"CATALINA_HOME\"))) and (TargetProcessCommandLine contains \"perl --help\" or TargetProcessCommandLine contains \"python --help\" or TargetProcessCommandLine contains \"python -h\" or TargetProcessCommandLine contains \"python3 --help\" or TargetProcessCommandLine contains \"python3 -h\" or TargetProcessCommandLine contains \"wget --help\" or TargetProcessCommandLine contains \"perl -h\"))|extend RuleId=\"f64e5c19-879c-4bae-b471-6d84c8339677\";\nlet q8=_Im_ProcessCreate\n| where (((ActingProcessName endswith \"\\\\w3wp.exe\" or ActingProcessName endswith \"\\\\php.exe\" or ActingProcessName endswith \"\\\\php-cgi.exe\" or ActingProcessName endswith \"\\\\nginx.exe\" or ActingProcessName endswith \"\\\\httpd.exe\" or ActingProcessName endswith \"\\\\caddy.exe\" or ActingProcessName endswith \"\\\\ws_TomcatService.exe\" or ActingProcessName endswith \"\\\\tomcat.exe\" or ActingProcessName endswith \"\\\\UMWorkerProcess.exe\") or ((ActingProcessName endswith \"\\\\java.exe\" or ActingProcessName endswith \"\\\\javaw.exe\") and (ActingProcessName contains \"-tomcat-\" or ActingProcessName contains \"\\\\tomcat\")) or ((ActingProcessName endswith \"\\\\java.exe\" or ActingProcessName endswith \"\\\\javaw.exe\") and (ActingProcessCommandLine contains \"catalina.jar\" or ActingProcessCommandLine contains \"CATALINA_HOME\" or ActingProcessCommandLine contains \"catalina.home\"))) and (TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\sh.exe\" or TargetProcessName endswith \"\\\\bash.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\powershell_ise.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\bitsadmin.exe\" or TargetProcessName endswith \"\\\\arp.exe\" or TargetProcessName endswith \"\\\\at.exe\" or TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessName endswith \"\\\\dsget.exe\" or TargetProcessName endswith \"\\\\dsquery.exe\" or TargetProcessName endswith \"\\\\find.exe\" or TargetProcessName endswith \"\\\\findstr.exe\" or TargetProcessName endswith \"\\\\fsutil.exe\" or TargetProcessName endswith \"\\\\hostname.exe\" or TargetProcessName endswith \"\\\\ipconfig.exe\" or TargetProcessName endswith \"\\\\nbtstat.exe\" or TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\" or TargetProcessName endswith \"\\\\netdom.exe\" or TargetProcessName endswith \"\\\\netsh.exe\" or TargetProcessName endswith \"\\\\netstat.exe\" or TargetProcessName endswith \"\\\\nltest.exe\" or TargetProcessName endswith \"\\\\nslookup.exe\" or TargetProcessName endswith \"\\\\ntdutil.exe\" or TargetProcessName endswith \"\\\\pathping.exe\" or TargetProcessName endswith \"\\\\ping.exe\" or TargetProcessName endswith \"\\\\qprocess.exe\" or TargetProcessName endswith \"\\\\query.exe\" or TargetProcessName endswith \"\\\\qwinsta.exe\" or TargetProcessName endswith \"\\\\reg.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\sc.exe\" or TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessName endswith \"\\\\systeminfo.exe\" or TargetProcessName endswith \"\\\\tasklist.exe\" or TargetProcessName endswith \"\\\\tracert.exe\" or TargetProcessName endswith \"\\\\ver.exe\" or TargetProcessName endswith \"\\\\vssadmin.exe\" or TargetProcessName endswith \"\\\\wevtutil.exe\" or TargetProcessName endswith \"\\\\whoami.exe\" or TargetProcessName endswith \"\\\\wmic.exe\" or TargetProcessName endswith \"\\\\wscript.exe\" or TargetProcessName endswith \"\\\\wusa.exe\") and (not((TargetProcessCommandLine endswith \"Windows\\\\system32\\\\cmd.exe /c C:\\\\ManageEngine\\\\ADManager \\\"Plus\\\\ES\\\\bin\\\\elasticsearch.bat -Enode.name=RMP-NODE1 -pelasticsearch-pid.txt\" or (TargetProcessCommandLine contains \"sc query\" and TargetProcessCommandLine contains \"ADManager Plus\")))))|extend RuleId=\"8202070f-edeb-4d31-a010-a26c72ac5600\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Impact", "Discovery", "InitialAccess", "DefenseEvasion", "Persistence", "Execution"],
                "techniques": ["T1490", "T1087", "T1505", "T1018", "T1033", "T1190", "T1124"],
                "alertRuleTemplateName": "5163A000-4c76-45a9-804d-dc3f355f2034",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}