{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-4c76-45a9-804d-dc3f355f2030')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-4c76-45a9-804d-dc3f355f2030')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation high 030",
                "description": "Sigma Windows Process Creation high 030",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName contains \"\\\\Users\\\\Public\\\\\" or TargetProcessName contains \"\\\\$Recycle.bin\" or TargetProcessName contains \"\\\\Users\\\\All Users\\\\\" or TargetProcessName contains \"\\\\Users\\\\Default\\\\\" or TargetProcessName contains \"\\\\Users\\\\Contacts\\\\\" or TargetProcessName contains \"\\\\Users\\\\Searches\\\\\" or TargetProcessName contains \"C:\\\\Perflogs\\\\\" or TargetProcessName contains \"\\\\config\\\\systemprofile\\\\\" or TargetProcessName contains \"\\\\Windows\\\\Fonts\\\\\" or TargetProcessName contains \"\\\\Windows\\\\IME\\\\\" or TargetProcessName contains \"\\\\Windows\\\\addins\\\\\") and (ActingProcessName endswith \"\\\\services.exe\" or ActingProcessName endswith \"\\\\svchost.exe\"))|extend RuleId=\"883faa95-175a-4e22-8181-e5761aeb373c\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"143Svc\" or TargetProcessCommandLine contains \"Acronis VSS Provider\" or TargetProcessCommandLine contains \"AcronisAgent\" or TargetProcessCommandLine contains \"AcrSch2Svc\" or TargetProcessCommandLine contains \"Antivirus\" or TargetProcessCommandLine contains \"ARSM\" or TargetProcessCommandLine contains \"aswBcc\" or TargetProcessCommandLine contains \"Avast Business Console Client Antivirus Service\" or TargetProcessCommandLine contains \"avast! Antivirus\" or TargetProcessCommandLine contains \"AVG Antivirus\" or TargetProcessCommandLine contains \"avgAdminClient\" or TargetProcessCommandLine contains \"AvgAdminServer\" or TargetProcessCommandLine contains \"AVP1\" or TargetProcessCommandLine contains \"BackupExec\" or TargetProcessCommandLine contains \"bedbg\" or TargetProcessCommandLine contains \"BITS\" or TargetProcessCommandLine contains \"BrokerInfrastructure\" or TargetProcessCommandLine contains \"Client Agent 7.60\" or TargetProcessCommandLine contains \"Core Browsing Protection\" or TargetProcessCommandLine contains \"Core Mail Protection\" or TargetProcessCommandLine contains \"Core Scanning Server\" or TargetProcessCommandLine contains \"DCAgent\" or TargetProcessCommandLine contains \"EhttpSr\" or TargetProcessCommandLine contains \"ekrn\" or TargetProcessCommandLine contains \"Enterprise Client Service\" or TargetProcessCommandLine contains \"epag\" or TargetProcessCommandLine contains \"EPIntegrationService\" or TargetProcessCommandLine contains \"EPProtectedService\" or TargetProcessCommandLine contains \"EPRedline\" or TargetProcessCommandLine contains \"EPSecurityService\" or TargetProcessCommandLine contains \"EPUpdateService\" or TargetProcessCommandLine contains \"EraserSvc11710\" or TargetProcessCommandLine contains \"EsgShKernel\" or TargetProcessCommandLine contains \"ESHASRV\" or TargetProcessCommandLine contains \"FA_Scheduler\" or TargetProcessCommandLine contains \"FirebirdGuardianDefaultInstance\" or TargetProcessCommandLine contains \"FirebirdServerDefaultInstance\" or TargetProcessCommandLine contains \"HealthTLService\" or TargetProcessCommandLine contains \"MSSQLFDLauncher$\" or TargetProcessCommandLine contains \"hmpalertsvc\" or TargetProcessCommandLine contains \"HMS\" or TargetProcessCommandLine contains \"IISAdmin\" or TargetProcessCommandLine contains \"IMANSVC\" or TargetProcessCommandLine contains \"IMAP4Svc\" or TargetProcessCommandLine contains \"KAVFS\" or TargetProcessCommandLine contains \"KAVFSGT\" or TargetProcessCommandLine contains \"kavfsslp\" or TargetProcessCommandLine contains \"klbackupdisk\" or TargetProcessCommandLine contains \"klbackupflt\" or TargetProcessCommandLine contains \"klflt\" or TargetProcessCommandLine contains \"klhk\" or TargetProcessCommandLine contains \"KLIF\" or TargetProcessCommandLine contains \"klim6\" or TargetProcessCommandLine contains \"klkbdflt\" or TargetProcessCommandLine contains \"klmouflt\" or TargetProcessCommandLine contains \"klnagent\" or TargetProcessCommandLine contains \"klpd\" or TargetProcessCommandLine contains \"kltap\" or TargetProcessCommandLine contains \"KSDE1.0.0\" or TargetProcessCommandLine contains \"LogProcessorService\" or TargetProcessCommandLine contains \"M8EndpointAgent\" or TargetProcessCommandLine contains \"macmnsvc\" or TargetProcessCommandLine contains \"masvc\" or TargetProcessCommandLine contains \"MBAMService\" or TargetProcessCommandLine contains \"MBCloudEA\" or TargetProcessCommandLine contains \"MBEndpointAgent\" or TargetProcessCommandLine contains \"McAfeeDLPAgentService\" or TargetProcessCommandLine contains \"McAfeeEngineService\" or TargetProcessCommandLine contains \"MCAFEEEVENTPARSERSRV\" or TargetProcessCommandLine contains \"McAfeeFramework\" or TargetProcessCommandLine contains \"MCAFEETOMCATSRV530\" or TargetProcessCommandLine contains \"McShield\" or TargetProcessCommandLine contains \"McTaskManager\" or TargetProcessCommandLine contains \"mfefire\" or TargetProcessCommandLine contains \"mfemms\" or TargetProcessCommandLine contains \"mfevto\" or TargetProcessCommandLine contains \"mfevtp\" or TargetProcessCommandLine contains \"mfewc\" or TargetProcessCommandLine contains \"MMS\" or TargetProcessCommandLine contains \"mozyprobackup\" or TargetProcessCommandLine contains \"MsDtsServer\" or TargetProcessCommandLine contains \"MSExchange\" or TargetProcessCommandLine contains \"msftesq1SPROO\" or TargetProcessCommandLine contains \"msftesql$PROD\" or TargetProcessCommandLine contains \"MSOLAP$SQL_2008\" or TargetProcessCommandLine contains \"MSOLAP$SYSTEM_BGC\" or TargetProcessCommandLine contains \"MSOLAP$TPS\" or TargetProcessCommandLine contains \"MSOLAP$TPSAMA\" or TargetProcessCommandLine contains \"MSOLAPSTPS\" or TargetProcessCommandLine contains \"MSOLAPSTPSAMA\" or TargetProcessCommandLine contains \"mssecflt\" or TargetProcessCommandLine contains \"MSSQ!I.SPROFXENGAGEMEHT\" or TargetProcessCommandLine contains \"MSSQ0SHAREPOINT\" or TargetProcessCommandLine contains \"MSSQ0SOPHOS\" or TargetProcessCommandLine contains \"MSSQL\" or TargetProcessCommandLine contains \"MySQL\" or TargetProcessCommandLine contains \"NanoServiceMain\" or TargetProcessCommandLine contains \"NetMsmqActivator\" or TargetProcessCommandLine contains \"ntrtscan\" or TargetProcessCommandLine contains \"ofcservice\" or TargetProcessCommandLine contains \"Online Protection System\" or TargetProcessCommandLine contains \"OracleClientCache80\" or TargetProcessCommandLine contains \"PandaAetherAgent\" or TargetProcessCommandLine contains \"PccNTUpd\" or TargetProcessCommandLine contains \"PDVFSService\" or TargetProcessCommandLine contains \"POP3Svc\" or TargetProcessCommandLine contains \"POVFSService\" or TargetProcessCommandLine contains \"PSUAService\" or TargetProcessCommandLine contains \"Quick Update Service\" or TargetProcessCommandLine contains \"RepairService\" or TargetProcessCommandLine contains \"ReportServer\" or TargetProcessCommandLine contains \"ReportServer$\" or TargetProcessCommandLine contains \"RESvc\" or TargetProcessCommandLine contains \"RpcEptMapper\" or TargetProcessCommandLine contains \"sacsvr\" or TargetProcessCommandLine contains \"SamSs\" or TargetProcessCommandLine contains \"SAVAdminService\" or TargetProcessCommandLine contains \"SAVService\" or TargetProcessCommandLine contains \"ScSecSvc\" or TargetProcessCommandLine contains \"SDRSVC\" or TargetProcessCommandLine contains \"sense\" or TargetProcessCommandLine contains \"SentinelAgent\" or TargetProcessCommandLine contains \"SentinelHelperService\" or TargetProcessCommandLine contains \"SepMasterService\" or TargetProcessCommandLine contains \"ShMonitor\" or TargetProcessCommandLine contains \"Smcinst\" or TargetProcessCommandLine contains \"SmcService\" or TargetProcessCommandLine contains \"SMTPSvc\" or TargetProcessCommandLine contains \"SNAC\" or TargetProcessCommandLine contains \"SntpService\" or TargetProcessCommandLine contains \"Sophos\" or TargetProcessCommandLine contains \"SQ1SafeOLRService\" or TargetProcessCommandLine contains \"SQL Backups\" or TargetProcessCommandLine contains \"SQL Server\" or TargetProcessCommandLine contains \"SQLAgent\" or TargetProcessCommandLine contains \"SQLBrowser\" or TargetProcessCommandLine contains \"SQLsafe\" or TargetProcessCommandLine contains \"SQLSERVERAGENT\" or TargetProcessCommandLine contains \"SQLTELEMETRY\" or TargetProcessCommandLine contains \"SQLWriter\" or TargetProcessCommandLine contains \"SSISTELEMETRY130\" or TargetProcessCommandLine contains \"SstpSvc\" or TargetProcessCommandLine contains \"svcGenericHost\" or TargetProcessCommandLine contains \"swc_service\" or TargetProcessCommandLine contains \"swi_filter\" or TargetProcessCommandLine contains \"swi_service\" or TargetProcessCommandLine contains \"swi_update\" or TargetProcessCommandLine contains \"Symantec\" or TargetProcessCommandLine contains \"Telemetryserver\" or TargetProcessCommandLine contains \"ThreatLockerService\" or TargetProcessCommandLine contains \"TMBMServer\" or TargetProcessCommandLine contains \"TmCCSF\" or TargetProcessCommandLine contains \"TmFilter\" or TargetProcessCommandLine contains \"TMiCRCScanService\" or TargetProcessCommandLine contains \"tmlisten\" or TargetProcessCommandLine contains \"TMLWCSService\" or TargetProcessCommandLine contains \"TmPfw\" or TargetProcessCommandLine contains \"TmPreFilter\" or TargetProcessCommandLine contains \"TmProxy\" or TargetProcessCommandLine contains \"TMSmartRelayService\" or TargetProcessCommandLine contains \"tmusa\" or TargetProcessCommandLine contains \"Trend Micro Deep Security Manager\" or TargetProcessCommandLine contains \"TrueKey\" or TargetProcessCommandLine contains \"UI0Detect\" or TargetProcessCommandLine contains \"UTODetect\" or TargetProcessCommandLine contains \"Veeam\" or TargetProcessCommandLine contains \"VeeamDeploySvc\" or TargetProcessCommandLine contains \"Veritas System Recovery\" or TargetProcessCommandLine contains \"VSApiNt\" or TargetProcessCommandLine contains \"VSS\" or TargetProcessCommandLine contains \"W3Svc\" or TargetProcessCommandLine contains \"wbengine\" or TargetProcessCommandLine contains \"WdNisSvc\" or TargetProcessCommandLine contains \"WeanClOudSve\" or TargetProcessCommandLine contains \"Weems JY\" or TargetProcessCommandLine contains \"WinDefend\" or TargetProcessCommandLine contains \"wozyprobackup\" or TargetProcessCommandLine contains \"WRSVC\" or TargetProcessCommandLine contains \"Zoolz 2 Service\") and ((((TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\") or (TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\")) and TargetProcessCommandLine contains \" stop \") or (((TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\") or (TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\")) and (TargetProcessCommandLine contains \"Stop-Service \" or TargetProcessCommandLine contains \"Remove-Service \")) or ((TargetProcessFilename =~ \"sc.exe\" or TargetProcessName endswith \"\\\\sc.exe\") and (TargetProcessCommandLine contains \" stop \" or TargetProcessCommandLine contains \" delete \" or TargetProcessCommandLine contains \" pause \"))))|extend RuleId=\"ce72ef99-22f1-43d4-8695-419dcb5d9330\";\nunion q0, q1;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Impact", "DefenseEvasion"],
                "techniques": ["T1489", "T1202"],
                "alertRuleTemplateName": "5163A000-4c76-45a9-804d-dc3f355f2030",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}