{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000202')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000202')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 02",
                "description": "Sigma Windows Process Creation medium 02",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessFilename =~ \"CertUtil.exe\") and (TargetProcessCommandLine contains \"urlcache \" or TargetProcessCommandLine contains \"verifyctl \") and (TargetProcessCommandLine contains \".githubusercontent.com\" or TargetProcessCommandLine contains \"anonfiles.com\" or TargetProcessCommandLine contains \"cdn.discordapp.com\" or TargetProcessCommandLine contains \"cdn.discordapp.com/attachments/\" or TargetProcessCommandLine contains \"ddns.net\" or TargetProcessCommandLine contains \"dl.dropboxusercontent.com\" or TargetProcessCommandLine contains \"ghostbin.co\" or TargetProcessCommandLine contains \"glitch.me\" or TargetProcessCommandLine contains \"gofile.io\" or TargetProcessCommandLine contains \"hastebin.com\" or TargetProcessCommandLine contains \"mediafire.com\" or TargetProcessCommandLine contains \"mega.nz\" or TargetProcessCommandLine contains \"onrender.com\" or TargetProcessCommandLine contains \"paste.ee\" or TargetProcessCommandLine contains \"pastebin.com\" or TargetProcessCommandLine contains \"pastebin.pl\" or TargetProcessCommandLine contains \"pastetext.net\" or TargetProcessCommandLine contains \"privatlab.com\" or TargetProcessCommandLine contains \"privatlab.net\" or TargetProcessCommandLine contains \"send.exploit.in\" or TargetProcessCommandLine contains \"sendspace.com\" or TargetProcessCommandLine contains \"storage.googleapis.com\" or TargetProcessCommandLine contains \"storjshare.io\" or TargetProcessCommandLine contains \"supabase.co\" or TargetProcessCommandLine contains \"temp.sh\" or TargetProcessCommandLine contains \"transfer.sh\" or TargetProcessCommandLine contains \"ufile.io\"))|extend RuleId=\"42a5f1e7-9603-4f6d-97ae-3f37d130d794\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_certutil_download_file_sharing_domains.yml\"|extend RuleTitle=\"Suspicious File Downloaded From File-Sharing Website Via Certutil.EXE\"|extend RuleDescription=\"Detects the execution of certutil with certain flags that allow the utility to download files from file-sharing websites.\";\nlet q1=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"-encode\"\n| where TargetProcessCommandLine contains \"/encode\"\n| where ((TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessFilename =~ \"CertUtil.exe\") and () and (TargetProcessCommandLine contains \".acl\" or TargetProcessCommandLine contains \".bat\" or TargetProcessCommandLine contains \".doc\" or TargetProcessCommandLine contains \".gif\" or TargetProcessCommandLine contains \".jpeg\" or TargetProcessCommandLine contains \".jpg\" or TargetProcessCommandLine contains \".mp3\" or TargetProcessCommandLine contains \".pdf\" or TargetProcessCommandLine contains \".png\" or TargetProcessCommandLine contains \".ppt\" or TargetProcessCommandLine contains \".tmp\" or TargetProcessCommandLine contains \".xls\" or TargetProcessCommandLine contains \".xml\"))|extend RuleId=\"ea0cdc3e-2239-4f26-a947-4e8f8224e464\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_certutil_encode_susp_extensions.yml\"|extend RuleTitle=\"Suspicious File Encoded To Base64 Via Certutil.EXE\"|extend RuleDescription=\"Detects the execution of certutil with the \\\"encode\\\" flag to encode a file to base64 where the extensions of the file is suspicious\";\nlet q2=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"-encode\"\n| where TargetProcessCommandLine contains \"/encode\"\n| where ((TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessFilename =~ \"CertUtil.exe\") and () and (TargetProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\\" or TargetProcessCommandLine contains \"\\\\Desktop\\\\\" or TargetProcessCommandLine contains \"\\\\Local\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\PerfLogs\\\\\" or TargetProcessCommandLine contains \"\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\Temp\\\\\" or TargetProcessCommandLine contains \"$Recycle.Bin\"))|extend RuleId=\"82a6714f-4899-4f16-9c1e-9a333544d4c3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_certutil_encode_susp_location.yml\"|extend RuleTitle=\"File In Suspicious Location Encoded To Base64 Via Certutil.EXE\"|extend RuleDescription=\"Detects the execution of certutil with the \\\"encode\\\" flag to encode a file to base64 where the files are located in potentially suspicious locations\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\certutil.exe\" or TargetProcessFilename =~ \"CertUtil.exe\") and (TargetProcessCommandLine contains \" -syncwithWU \" and TargetProcessCommandLine contains \" \\\\\\\\\"))|extend RuleId=\"6c6d9280-e6d0-4b9d-80ac-254701b64916\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_certutil_ntlm_coercion.yml\"|extend RuleTitle=\"Potential NTLM Coercion Via Certutil.EXE\"|extend RuleDescription=\"Detects possible NTLM coercion via certutil using the 'syncwithWU' flag\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"\\\\TrolleyExpress 7\" or TargetProcessCommandLine contains \"\\\\TrolleyExpress 8\" or TargetProcessCommandLine contains \"\\\\TrolleyExpress 9\" or TargetProcessCommandLine contains \"\\\\TrolleyExpress.exe 7\" or TargetProcessCommandLine contains \"\\\\TrolleyExpress.exe 8\" or TargetProcessCommandLine contains \"\\\\TrolleyExpress.exe 9\" or TargetProcessCommandLine contains \"\\\\TrolleyExpress.exe -ma \") or (TargetProcessName endswith \"\\\\TrolleyExpress.exe\" and (not((TargetProcessFilename contains \"CtxInstall\" or isempty(TargetProcessFilename))))))|extend RuleId=\"4c0aaedc-154c-4427-ada0-d80ef9c9deb6\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_citrix_trolleyexpress_procdump.yml\"|extend RuleTitle=\"Process Access via TrolleyExpress Exclusion\"|extend RuleDescription=\"Detects a possible process memory dump that uses the white-listed Citrix TrolleyExpress.exe filename as a way to dump the lsass process memory\";\nlet q5=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \" -l\"\n| where TargetProcessCommandLine contains \" /l\"\n| where ((TargetProcessName endswith \"\\\\cmdkey.exe\" or TargetProcessFilename =~ \"cmdkey.exe\") and ())|extend RuleId=\"07f8bdc2-c9b3-472a-9817-5a670b872f53\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmdkey_recon.yml\"|extend RuleTitle=\"Potential Reconnaissance For Cached Credentials Via Cmdkey.EXE\"|extend RuleDescription=\"Detects usage of cmdkey to look for cached credentials on the system\";\nlet q6=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessFilename =~ \"Cmd.Exe\") and (TargetProcessCommandLine contains \"assoc \" and TargetProcessCommandLine contains \"exefile\")) and (not(TargetProcessCommandLine contains \".exe=exefile\")))|extend RuleId=\"ae6f14e6-14de-45b0-9f44-c0986f50dc89\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmd_assoc_tamper_exe_file_association.yml\"|extend RuleTitle=\"Change Default File Association To Executable Via Assoc\"|extend RuleDescription=\"Detects when a program changes the default file association of any extension to an executable.\\nWhen a file is opened, the default program used to open the file (also called the file association or handler) is checked. File association selections are stored in the Windows Registry and can be edited by users, administrators, or programs that have Registry access or by administrators using the built-in assoc utility. Applications can modify the file association for a given file extension to call an arbitrary program when a file with the given extension is opened.\\n\";\nlet q7=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessFilename =~ \"Cmd.Exe\") and ((TargetProcessCommandLine contains \"copy \" and TargetProcessCommandLine contains \" \\\\\\\\\") and (TargetProcessCommandLine contains \".dmp\" or TargetProcessCommandLine contains \".dump\" or TargetProcessCommandLine contains \".hdmp\")))|extend RuleId=\"044ba588-dff4-4918-9808-3f95e8160606\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmd_copy_dmp_from_share.yml\"|extend RuleTitle=\"Copy .DMP/.DUMP Files From Remote Share Via Cmd.EXE\"|extend RuleDescription=\"Detects usage of the copy builtin cmd command to copy files with the \\\".dmp\\\"/\\\".dump\\\" extension from a remote share\";\nlet q8=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \" -c \"\n| where TargetProcessCommandLine contains \" /c \"\n| where (() and (TargetProcessCommandLine contains \"curl \" and TargetProcessCommandLine contains \"http\" and TargetProcessCommandLine contains \"-o\" and TargetProcessCommandLine contains \"&\"))|extend RuleId=\"21dd6d38-2b18-4453-9404-a0fe4a0cc288\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmd_curl_download_exec_combo.yml\"|extend RuleTitle=\"Curl Download And Execute Combination\"|extend RuleDescription=\"Adversaries can use curl to download payloads remotely and execute them. Curl is included by default in Windows 10 build 17063 and later.\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessFilename =~ \"Cmd.Exe\") and (TargetProcessCommandLine contains \"mklink\" and TargetProcessCommandLine contains \"\\\\osk.exe\" and TargetProcessCommandLine contains \"\\\\cmd.exe\"))|extend RuleId=\"e9b61244-893f-427c-b287-3e708f321c6b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmd_mklink_osk_cmd.yml\"|extend RuleTitle=\"Potential Privilege Escalation Using Symlink Between Osk and Cmd\"|extend RuleDescription=\"Detects the creation of a symbolic link between \\\"cmd.exe\\\" and the accessibility on-screen keyboard binary (osk.exe) using \\\"mklink\\\". This technique provides an elevated command prompt to the user from the login screen without the need to log in.\";\nlet q10=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"mklink\" and TargetProcessCommandLine contains \"HarddiskVolumeShadowCopy\")|extend RuleId=\"40b19fa6-d835-400c-b301-41f3a2baacaf\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmd_mklink_shadow_copies_access_symlink.yml\"|extend RuleTitle=\"VolumeShadowCopy Symlink Creation Via Mklink\"|extend RuleDescription=\"Shadow Copies storage symbolic link creation using operating systems utilities\";\nlet q11=_Im_ProcessCreate\n| where ((TargetProcessName contains \"\\\\cmd.exe\" or TargetProcessFilename =~ \"Cmd.EXE\") and (TargetProcessCommandLine contains \" net use http\" and TargetProcessCommandLine contains \"& start /b \" and TargetProcessCommandLine contains \"\\\\DavWWWRoot\\\\\") and (TargetProcessCommandLine contains \".exe \" or TargetProcessCommandLine contains \".dll \" or TargetProcessCommandLine contains \".bat \" or TargetProcessCommandLine contains \".vbs \" or TargetProcessCommandLine contains \".ps1 \"))|extend RuleId=\"f0507c0f-a3a2-40f5-acc6-7f543c334993\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmd_net_use_and_exec_combo.yml\"|extend RuleTitle=\"Suspicious File Execution From Internet Hosted WebDav Share\"|extend RuleDescription=\"Detects the execution of the \\\"net use\\\" command to mount a WebDAV server and then immediately execute some content in it. As seen being used in malicious LNK files\";\nlet q12=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \"cmd.exe/c\" or TargetProcessCommandLine contains \"\\\\cmd/c\" or TargetProcessCommandLine contains \"\\\"cmd/c\" or TargetProcessCommandLine contains \"cmd.exe/k\" or TargetProcessCommandLine contains \"\\\\cmd/k\" or TargetProcessCommandLine contains \"\\\"cmd/k\" or TargetProcessCommandLine contains \"cmd.exe/r\" or TargetProcessCommandLine contains \"\\\\cmd/r\" or TargetProcessCommandLine contains \"\\\"cmd/r\") or (TargetProcessCommandLine contains \"/cwhoami\" or TargetProcessCommandLine contains \"/cpowershell\" or TargetProcessCommandLine contains \"/cschtasks\" or TargetProcessCommandLine contains \"/cbitsadmin\" or TargetProcessCommandLine contains \"/ccertutil\" or TargetProcessCommandLine contains \"/kwhoami\" or TargetProcessCommandLine contains \"/kpowershell\" or TargetProcessCommandLine contains \"/kschtasks\" or TargetProcessCommandLine contains \"/kbitsadmin\" or TargetProcessCommandLine contains \"/kcertutil\") or (TargetProcessCommandLine contains \"cmd.exe /c\" or TargetProcessCommandLine contains \"cmd /c\" or TargetProcessCommandLine contains \"cmd.exe /k\" or TargetProcessCommandLine contains \"cmd /k\" or TargetProcessCommandLine contains \"cmd.exe /r\" or TargetProcessCommandLine contains \"cmd /r\")) and (not(((TargetProcessCommandLine contains \"cmd.exe /c \" or TargetProcessCommandLine contains \"cmd /c \" or TargetProcessCommandLine contains \"cmd.exe /k \" or TargetProcessCommandLine contains \"cmd /k \" or TargetProcessCommandLine contains \"cmd.exe /r \" or TargetProcessCommandLine contains \"cmd /r \") or (TargetProcessCommandLine contains \"AppData\\\\Local\\\\Programs\\\\Microsoft VS Code\\\\resources\\\\app\\\\node_modules\" or TargetProcessCommandLine endswith \"cmd.exe/c .\" or TargetProcessCommandLine =~ \"cmd.exe /c\")))))|extend RuleId=\"a16980c2-0c56-4de0-9a79-17971979efdd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmd_no_space_execution.yml\"|extend RuleTitle=\"Cmd.EXE Missing Space Characters Execution Anomaly\"|extend RuleDescription=\"Detects Windows command lines that miss a space before or after the /c flag when running a command using the cmd.exe.\\nThis could be a sign of obfuscation of a fat finger problem (typo by the developer).\\n\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "CredentialAccess", "CommandAndControl", "Persistence", "PrivilegeEscalation", "Execution"],
                "techniques": ["T1003", "T1105", "T1218", "T1059", "T1027", "T1546"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000202",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}