{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000206')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000206')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 06",
                "description": "Sigma Windows Process Creation medium 06",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\Certify.exe\" or TargetProcessFilename =~ \"Certify.exe\" or TargetProcessFileDescription contains \"Certify\") or ((TargetProcessCommandLine contains \".exe cas \" or TargetProcessCommandLine contains \".exe find \" or TargetProcessCommandLine contains \".exe pkiobjects \" or TargetProcessCommandLine contains \".exe request \" or TargetProcessCommandLine contains \".exe download \") and (TargetProcessCommandLine contains \" /vulnerable\" or TargetProcessCommandLine contains \" /template:\" or TargetProcessCommandLine contains \" /altname:\" or TargetProcessCommandLine contains \" /domain:\" or TargetProcessCommandLine contains \" /path:\" or TargetProcessCommandLine contains \" /ca:\")))|extend RuleId=\"762f2482-ff21-4970-8939-0aa317a886bb\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_certify.yml\"|extend RuleTitle=\"HackTool - Certify Execution\"|extend RuleDescription=\"Detects Certify a tool for Active Directory certificate abuse based on PE metadata characteristics and common command line arguments.\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\Certipy.exe\" or TargetProcessFilename =~ \"Certipy.exe\" or TargetProcessFileDescription contains \"Certipy\") or ((TargetProcessCommandLine contains \" auth \" or TargetProcessCommandLine contains \" find \" or TargetProcessCommandLine contains \" forge \" or TargetProcessCommandLine contains \" relay \" or TargetProcessCommandLine contains \" req \" or TargetProcessCommandLine contains \" shadow \") and (TargetProcessCommandLine contains \" -bloodhound\" or TargetProcessCommandLine contains \" -ca-pfx \" or TargetProcessCommandLine contains \" -dc-ip \" or TargetProcessCommandLine contains \" -kirbi\" or TargetProcessCommandLine contains \" -old-bloodhound\" or TargetProcessCommandLine contains \" -pfx \" or TargetProcessCommandLine contains \" -target\" or TargetProcessCommandLine contains \" -username \" or TargetProcessCommandLine contains \" -vulnerable\" or TargetProcessCommandLine contains \"auth -pfx\" or TargetProcessCommandLine contains \"shadow auto\" or TargetProcessCommandLine contains \"shadow list\")))|extend RuleId=\"6938366d-8954-4ddc-baff-c830b3ba8fcd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_certipy.yml\"|extend RuleTitle=\"HackTool - Certipy Execution\"|extend RuleDescription=\"Detects Certipy a tool for Active Directory Certificate Services enumeration and abuse based on PE metadata characteristics and common command line arguments.\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"Cmd.Exe\" or TargetProcessName endswith \"\\\\cmd.exe\") and ((TargetProcessCommandLine startswith \"cmd \" or TargetProcessCommandLine startswith \"cmd.exe\" or TargetProcessCommandLine startswith \"c:\\\\windows\\\\system32\\\\cmd.exe\") and (TargetProcessCommandLine contains \"psinject\" or TargetProcessCommandLine contains \"spawnas\" or TargetProcessCommandLine contains \"make_token\" or TargetProcessCommandLine contains \"remote-exec\" or TargetProcessCommandLine contains \"rev2self\" or TargetProcessCommandLine contains \"dcsync\" or TargetProcessCommandLine contains \"logonpasswords\" or TargetProcessCommandLine contains \"execute-assembly\" or TargetProcessCommandLine contains \"getsystem\")))|extend RuleId=\"647c7b9e-d784-4fda-b9a0-45c565a7b729\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_cobaltstrike_bloopers_cmd.yml\"|extend RuleTitle=\"Operator Bloopers Cobalt Strike Commands\"|extend RuleDescription=\"Detects use of Cobalt Strike commands accidentally entered in the CMD shell\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"Cmd.Exe\" or TargetProcessName endswith \"\\\\cmd.exe\") and (TargetProcessCommandLine contains \"Invoke-UserHunter\" or TargetProcessCommandLine contains \"Invoke-ShareFinder\" or TargetProcessCommandLine contains \"Invoke-Kerberoast\" or TargetProcessCommandLine contains \"Invoke-SMBAutoBrute\" or TargetProcessCommandLine contains \"Invoke-Nightmare\" or TargetProcessCommandLine contains \"zerologon\" or TargetProcessCommandLine contains \"av_query\"))|extend RuleId=\"4f154fb6-27d1-4813-a759-78b93e0b9c48\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_cobaltstrike_bloopers_modules.yml\"|extend RuleTitle=\"Operator Bloopers Cobalt Strike Modules\"|extend RuleDescription=\"Detects Cobalt Strike module/commands accidentally entered in CMD shell\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessFilename =~ \"RUNDLL32.EXE\" or (TargetProcessCommandLine contains \"rundll32.exe\" or TargetProcessCommandLine contains \"rundll32 \")) and (TargetProcessCommandLine contains \".dll\" and (TargetProcessCommandLine endswith \" StartW\" or TargetProcessCommandLine endswith \",StartW\")))|extend RuleId=\"ae9c6a7c-9521-42a6-915e-5aaa8689d529\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_cobaltstrike_load_by_rundll32.yml\"|extend RuleTitle=\"CobaltStrike Load by Rundll32\"|extend RuleDescription=\"Rundll32 can be use by Cobalt Strike with StartW function to load DLLs from the command line.\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessCommandLine endswith \"cmd.exe /C whoami\" and ActingProcessName startswith \"C:\\\\Temp\\\\\") or ((ActingProcessName endswith \"\\\\runonce.exe\" or ActingProcessName endswith \"\\\\dllhost.exe\") and (TargetProcessCommandLine contains \"cmd.exe /c echo\" and TargetProcessCommandLine contains \"> \\\\\\\\.\\\\pipe\")) or ((ActingProcessCommandLine contains \"cmd.exe /C echo\" and ActingProcessCommandLine contains \" > \\\\\\\\.\\\\pipe\") and TargetProcessCommandLine endswith \"conhost.exe 0xffffffff -ForceV1\") or (ActingProcessCommandLine endswith \"/C whoami\" and TargetProcessCommandLine endswith \"conhost.exe 0xffffffff -ForceV1\"))|extend RuleId=\"f35c5d71-b489-4e22-a115-f003df287317\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_cobaltstrike_process_patterns.yml\"|extend RuleTitle=\"Potential CobaltStrike Process Patterns\"|extend RuleDescription=\"Detects potential process patterns related to Cobalt Strike beacon activity\";\nlet q6=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\CoercedPotato.exe\" or TargetProcessCommandLine contains \" --exploitId \" or ((TargetProcessIMPHASH =~ \"a75d7669db6b2e107a44c4057ff7f7d6\" or TargetProcessIMPHASH =~ \"f91624350e2c678c5dcbe5e1f24e22c9\" or TargetProcessIMPHASH =~ \"14c81850a079a87e83d50ca41c709a15\") or (TargetProcessIMPHASH=~\"A75D7669DB6B2E107A44C4057FF7F7D6\" or TargetProcessIMPHASH=~\"F91624350E2C678C5DCBE5E1F24E22C9\" or TargetProcessIMPHASH=~\"14C81850A079A87E83D50CA41C709A15\")))|extend RuleId=\"e8d34729-86a4-4140-adfd-0a29c2106307\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_coercedpotato.yml\"|extend RuleTitle=\"HackTool - CoercedPotato Execution\"|extend RuleDescription=\"Detects the use of CoercedPotato, a tool for privilege escalation\";\nlet q7=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \"-Sta\" and TargetProcessCommandLine contains \"-Nop\" and TargetProcessCommandLine contains \"-Window\" and TargetProcessCommandLine contains \"Hidden\") and (TargetProcessCommandLine contains \"-Command\" or TargetProcessCommandLine contains \"-EncodedCommand\")) or (TargetProcessCommandLine contains \"sv o (New-Object IO.MemorySteam);sv d \" or TargetProcessCommandLine contains \"mshta file.hta\" or TargetProcessCommandLine contains \"GruntHTTP\" or TargetProcessCommandLine contains \"-EncodedCommand cwB2ACAAbwAgA\"))|extend RuleId=\"c260b6db-48ba-4b4a-a76f-2f67644e99d2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_covenant.yml\"|extend RuleTitle=\"HackTool - Covenant PowerShell Launcher\"|extend RuleDescription=\"Detects suspicious command lines used in Covenant luanchers\";\nlet q8=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\crackmapexec.exe\" or TargetProcessCommandLine contains \" -M pe_inject \" or (TargetProcessCommandLine contains \" --local-auth\" and TargetProcessCommandLine contains \" -u \" and TargetProcessCommandLine contains \" -x \") or (TargetProcessCommandLine contains \" --local-auth\" and TargetProcessCommandLine contains \" -u \" and TargetProcessCommandLine contains \" -p \" and TargetProcessCommandLine contains \" -H 'NTHASH'\") or (TargetProcessCommandLine contains \" mssql \" and TargetProcessCommandLine contains \" -u \" and TargetProcessCommandLine contains \" -p \" and TargetProcessCommandLine contains \" -M \" and TargetProcessCommandLine contains \" -d \") or (TargetProcessCommandLine contains \" smb \" and TargetProcessCommandLine contains \" -u \" and TargetProcessCommandLine contains \" -H \" and TargetProcessCommandLine contains \" -M \" and TargetProcessCommandLine contains \" -o \") or (TargetProcessCommandLine contains \" smb \" and TargetProcessCommandLine contains \" -u \" and TargetProcessCommandLine contains \" -p \" and TargetProcessCommandLine contains \" --local-auth\")) or ((TargetProcessCommandLine contains \" --local-auth\" and TargetProcessCommandLine contains \" -u \" and TargetProcessCommandLine contains \" -p \") and (TargetProcessCommandLine contains \" 10.\" and TargetProcessCommandLine contains \" 192.168.\" and TargetProcessCommandLine contains \"/24 \")))|extend RuleId=\"42a993dd-bb3e-48c8-b372-4d6684c4106c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_crackmapexec_execution.yml\"|extend RuleTitle=\"HackTool - CrackMapExec Execution\"|extend RuleDescription=\"This rule detect common flag combinations used by CrackMapExec in order to detect its use even if the binary has been replaced.\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"*cmd.exe /Q /c * 1> \\\\\\\\*\\\\*\\\\* 2>&1\" or TargetProcessCommandLine contains \"*cmd.exe /C * > \\\\\\\\*\\\\*\\\\* 2>&1\" or TargetProcessCommandLine contains \"*cmd.exe /C * > *\\\\Temp\\\\* 2>&1\") and (TargetProcessCommandLine contains \"powershell.exe -exec bypass -noni -nop -w 1 -C \\\"\" or TargetProcessCommandLine contains \"powershell.exe -noni -nop -w 1 -enc \"))|extend RuleId=\"058f4380-962d-40a5-afce-50207d36d7e2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_crackmapexec_execution_patterns.yml\"|extend RuleTitle=\"HackTool - CrackMapExec Execution Patterns\"|extend RuleDescription=\"Detects various execution patterns of the CrackMapExec pentesting framework\";\nlet q10=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \"tasklist /fi \" and TargetProcessCommandLine contains \"Imagename eq lsass.exe\") and (TargetProcessCommandLine contains \"cmd.exe /c \" or TargetProcessCommandLine contains \"cmd.exe /r \" or TargetProcessCommandLine contains \"cmd.exe /k \" or TargetProcessCommandLine contains \"cmd /c \" or TargetProcessCommandLine contains \"cmd /r \" or TargetProcessCommandLine contains \"cmd /k \") and (TargetUsername contains \"AUTHORI\" or TargetUsername contains \"AUTORI\")) or (TargetProcessCommandLine contains \"do rundll32.exe C:\\\\windows\\\\System32\\\\comsvcs.dll, MiniDump\" and TargetProcessCommandLine contains \"\\\\Windows\\\\Temp\\\\\" and TargetProcessCommandLine contains \" full\" and TargetProcessCommandLine contains \"%%B\") or (TargetProcessCommandLine contains \"tasklist /v /fo csv\" and TargetProcessCommandLine contains \"findstr /i \\\"lsass\\\"\"))|extend RuleId=\"f26307d8-14cd-47e3-a26b-4b4769f24af6\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_crackmapexec_patterns.yml\"|extend RuleTitle=\"HackTool - CrackMapExec Process Patterns\"|extend RuleDescription=\"Detects suspicious process patterns found in logs when CrackMapExec is used\";\nlet q11=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and (TargetProcessCommandLine contains \"*join*split*\" or TargetProcessCommandLine contains \"( $ShellId[1]+$ShellId[13]+'x')\" or TargetProcessCommandLine contains \"*( $PSHome[*]+$PSHOME[*]+*\" or TargetProcessCommandLine contains \"( $env:Public[13]+$env:Public[5]+'x')\" or TargetProcessCommandLine contains \"*( $env:ComSpec[4,*,25]-Join'')*\" or TargetProcessCommandLine contains \"[1,3]+'x'-Join'')\"))|extend RuleId=\"6f8b3439-a203-45dc-a88b-abf57ea15ccf\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_crackmapexec_powershell_obfuscation.yml\"|extend RuleTitle=\"HackTool - CrackMapExec PowerShell Obfuscation\"|extend RuleDescription=\"The CrachMapExec pentesting framework implements a PowerShell obfuscation with some static strings detected by this rule.\";\nlet q12=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\CreateMiniDump.exe\" or TargetProcessIMPHASH =~ \"4a07f944a83e8a7c2525efa35dd30e2f\" or TargetProcessIMPHASH=~\"4a07f944a83e8a7c2525efa35dd30e2f\")|extend RuleId=\"36d88494-1d43-4dc0-b3fa-35c8fea0ca9d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_createminidump.yml\"|extend RuleTitle=\"HackTool - CreateMiniDump Execution\"|extend RuleDescription=\"Detects the use of CreateMiniDump hack tool used to dump the LSASS process memory for credential extraction on the attacker's machine\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Execution", "DefenseEvasion", "Persistence", "CredentialAccess", "Discovery", "PrivilegeEscalation"],
                "techniques": ["T1059", "T1110", "T1201", "T1053", "T1027", "T1564", "T1218", "T1047", "T1055", "T1003"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000206",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}