{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000106')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000106')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation low 06",
                "description": "Sigma Windows Process Creation low 06",
                "severity": "low",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\java.exe\" or ActingProcessName endswith \"\\\\javaw.exe\") and ActingProcessCommandLine contains \"SysAidServer\")|extend RuleId=\"60bfeac3-0d35-4302-8efb-1dd16f715bc6\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_java_sysaidserver_susp_child_process.yml\"|extend RuleTitle=\"Suspicious SysAidServer Child\"|extend RuleDescription=\"Detects suspicious child processes of SysAidServer (as seen in MERCURY threat actor intrusions)\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\ksetup.exe\" or TargetProcessFilename =~ \"ksetup.exe\") and TargetProcessCommandLine contains \" /setcomputerpassword \")|extend RuleId=\"de16d92c-c446-4d53-8938-10aeef41c8b6\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_ksetup_password_change_computer.yml\"|extend RuleTitle=\"Computer Password Change Via Ksetup.EXE\"|extend RuleDescription=\"Detects password change for the computer's domain account or host principal via \\\"ksetup.exe\\\"\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\ksetup.exe\" or TargetProcessFilename =~ \"ksetup.exe\") and TargetProcessCommandLine contains \" /ChangePassword \")|extend RuleId=\"c9783e20-4793-4164-ba96-d9ee483992c4\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_ksetup_password_change_user.yml\"|extend RuleTitle=\"Logged-On User Password Change Via Ksetup.EXE\"|extend RuleDescription=\"Detects password change for the logged-on user's via \\\"ksetup.exe\\\"\";\nlet q3=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\ldifde.exe\" or TargetProcessFilename =~ \"ldifde.exe\") and TargetProcessCommandLine contains \"-f\") and (not(TargetProcessCommandLine contains \" -i\")))|extend RuleId=\"4f7a6757-ff79-46db-9687-66501a02d9ec\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_ldifde_export.yml\"|extend RuleTitle=\"Active Directory Structure Export Via Ldifde.EXE\"|extend RuleDescription=\"Detects the execution of \\\"ldifde.exe\\\" in order to export organizational Active Directory structure.\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\ldifde.exe\" or TargetProcessFilename =~ \"ldifde.exe\") and (TargetProcessCommandLine contains \"-i\" and TargetProcessCommandLine contains \"-f\"))|extend RuleId=\"6f535e01-ca1f-40be-ab8d-45b19c0c8b7f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_ldifde_file_load.yml\"|extend RuleTitle=\"Import LDAP Data Interchange Format File Via Ldifde.EXE\"|extend RuleDescription=\"Detects the execution of \\\"Ldifde.exe\\\" with the import flag \\\"-i\\\". The can be abused to include HTTP-based arguments which will allow the arbitrary download of files from a remote server.\\n\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\lodctr.exe\" and TargetProcessFilename =~ \"LODCTR.EXE\") and (TargetProcessCommandLine contains \" /r\" or TargetProcessCommandLine contains \" -r\"))|extend RuleId=\"cc9d3712-6310-4320-b2df-7cb408274d53\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lodctr_performance_counter_tampering.yml\"|extend RuleTitle=\"Rebuild Performance Counter Values Via Lodctr.EXE\"|extend RuleDescription=\"Detects the execution of \\\"lodctr.exe\\\" to rebuild the performance counter registry values. This can be abused by attackers by providing a malicious config file to overwrite performance counter configuration to confuse and evade monitoring and security solutions.\";\nlet q6=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\appvlp.exe\" and (not((TargetProcessName endswith \"\\\\msoasb.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\"))))|extend RuleId=\"9c7e131a-0f2c-4ae0-9d43-b04f4e266d43\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_appvlp.yml\"|extend RuleTitle=\"Using AppVLP To Circumvent ASR File Path Rule\"|extend RuleDescription=\"Application Virtualization Utility is included with Microsoft Office. We are able to abuse \\\"AppVLP\\\" to execute shell commands.\\nNormally, this binary is used for Application Virtualization, but we can use it as an abuse binary to circumvent the ASR file path rule folder\\nor to mark a file as a system file.\\n\";\nlet q7=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\cdb.exe\" or TargetProcessFilename =~ \"CDB.Exe\") and (TargetProcessCommandLine contains \" -c \" or TargetProcessCommandLine contains \" -cf \"))|extend RuleId=\"b5c7395f-e501-4a08-94d4-57fe7a9da9d2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_cdb.yml\"|extend RuleTitle=\"WinDbg/CDB LOLBIN Usage\"|extend RuleDescription=\"Detects usage of \\\"cdb.exe\\\" to launch 64-bit shellcode or arbitrary processes or commands from a debugger script file\";\nlet q8=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\xwizard.exe\" and TargetProcessCommandLine matches regex \"\\\\{[a-fA-F0-9]{8}-[a-fA-F0-9]{4}-[a-fA-F0-9]{4}-[a-fA-F0-9]{4}-[a-fA-F0-9]{12}\\\\}\")|extend RuleId=\"53d4bb30-3f36-4e8a-b078-69d36c4a79ff\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_class_exec_xwizard.yml\"|extend RuleTitle=\"Custom Class Execution via Xwizard\"|extend RuleDescription=\"Detects the execution of Xwizard tool with specific arguments which utilized to run custom class properties.\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\cmdl32.exe\" or TargetProcessFilename =~ \"CMDL32.EXE\") and (TargetProcessCommandLine contains \"/vpn \" and TargetProcessCommandLine contains \"/lan \"))|extend RuleId=\"f37aba28-a9e6-4045-882c-d5004043b337\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_cmdl32.yml\"|extend RuleTitle=\"Suspicious Cmdl32 Execution\"|extend RuleDescription=\"lolbas Cmdl32 is use to download a payload to evade antivirus\";\nlet q10=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"ConfigSecurityPolicy.exe\" or TargetProcessName endswith \"\\\\ConfigSecurityPolicy.exe\" or TargetProcessFilename =~ \"ConfigSecurityPolicy.exe\") and (TargetProcessCommandLine contains \"https://\" or TargetProcessCommandLine contains \"http://\" or TargetProcessCommandLine contains \"ftp://\"))|extend RuleId=\"1f0f6176-6482-4027-b151-00071af39d7e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_configsecuritypolicy.yml\"|extend RuleTitle=\"Suspicious ConfigSecurityPolicy Execution\"|extend RuleDescription=\"Upload file, credentials or data exfiltration with Binary part of Windows Defender\";\nlet q11=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\CustomShellHost.exe\" and (not(TargetProcessName =~ \"C:\\\\Windows\\\\explorer.exe\")))|extend RuleId=\"84b14121-9d14-416e-800b-f3b829c5a14d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_customshellhost.yml\"|extend RuleTitle=\"Suspicious CustomShellHost Execution\"|extend RuleDescription=\"Detects the execution of CustomShellHost binary where the child isn't located in 'C:\\\\Windows\\\\explorer.exe'\";\nlet q12=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"/in:\" or TargetProcessCommandLine contains \"/out:\" or TargetProcessCommandLine contains \"/uri:\") and (TargetProcessName endswith \"\\\\DataSvcUtil.exe\" or TargetProcessFilename =~ \"DataSvcUtil.exe\"))|extend RuleId=\"e290b10b-1023-4452-a4a9-eb31a9013b3a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_data_exfiltration_by_using_datasvcutil.yml\"|extend RuleTitle=\"LOLBAS Data Exfiltration by DataSvcUtil.exe\"|extend RuleDescription=\"Detects when a user performs data exfiltration by using DataSvcUtil.exe\";\nlet q13=_Im_ProcessCreate\n| where ActingProcessName endswith \"\\\\defaultpack.exe\"|extend RuleId=\"b2309017-4235-44fe-b5af-b15363011957\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_defaultpack.yml\"|extend RuleTitle=\"Lolbin Defaultpack.exe Use As Proxy\"|extend RuleDescription=\"Detect usage of the \\\"defaultpack.exe\\\" binary as a proxy to launch other programs\";\nlet q14=_Im_ProcessCreate\n| where TargetProcessName endswith \"\\\\DeviceCredentialDeployment.exe\"|extend RuleId=\"b8b1b304-a60f-4999-9a6e-c547bde03ffd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_device_credential_deployment.yml\"|extend RuleTitle=\"DeviceCredentialDeployment Execution\"|extend RuleDescription=\"Detects the execution of DeviceCredentialDeployment to hide a process from view\";\nlet q15=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"diantz.exe\" and TargetProcessCommandLine contains \".cab\") and TargetProcessCommandLine matches regex \":[^\\\\\\\\]\")|extend RuleId=\"6b369ced-4b1d-48f1-b427-fdc0de0790bd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_diantz_ads.yml\"|extend RuleTitle=\"Suspicious Diantz Alternate Data Stream Execution\"|extend RuleDescription=\"Compress target file into a cab file stored in the Alternate Data Stream (ADS) of the target file.\";\nlet q16=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"diantz.exe\" and TargetProcessCommandLine contains \" \\\\\\\\\" and TargetProcessCommandLine contains \".cab\")|extend RuleId=\"185d7418-f250-42d0-b72e-0c8b70661e93\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_diantz_remote_cab.yml\"|extend RuleTitle=\"Suspicious Diantz Download and Compress Into a CAB File\"|extend RuleDescription=\"Download and compress a remote file and store it in a cab file on local machine.\";\nlet q17=_Im_ProcessCreate\n| where TargetProcessName endswith \"\\\\dnx.exe\"|extend RuleId=\"81ebd28b-9607-4478-bf06-974ed9d53ed7\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_dnx.yml\"|extend RuleTitle=\"Application Whitelisting Bypass via Dnx.exe\"|extend RuleDescription=\"Execute C# code located in the consoleapp folder\";\nlet q18=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\dotnet.exe\" or TargetProcessFilename =~ \".NET Host\") and (TargetProcessCommandLine endswith \".dll\" or TargetProcessCommandLine endswith \".csproj\"))|extend RuleId=\"d80d5c81-04ba-45b4-84e4-92eba40e0ad3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_dotnet.yml\"|extend RuleTitle=\"Dotnet.exe Exec Dll and Execute Unsigned Code LOLBIN\"|extend RuleDescription=\"dotnet.exe will execute any DLL and execute unsigned code\";\nlet q19=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\dotnet-dump.exe\" or TargetProcessFilename =~ \"dotnet-dump.dll\") and TargetProcessCommandLine contains \"collect\")|extend RuleId=\"53d8d3e1-ca33-4012-adf3-e05a4d652e34\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_dotnet_dump.yml\"|extend RuleTitle=\"Process Memory Dump Via Dotnet-Dump\"|extend RuleDescription=\"Detects the execution of \\\"dotnet-dump\\\" with the \\\"collect\\\" flag. The execution could indicate potential process dumping of critical processes such as LSASS\";\nlet q20=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"Extexport.exe\" or TargetProcessName endswith \"\\\\Extexport.exe\" or TargetProcessFilename =~ \"extexport.exe\")|extend RuleId=\"fb0b815b-f5f6-4f50-970f-ffe21f253f7a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_extexport.yml\"|extend RuleTitle=\"Suspicious Extexport Execution\"|extend RuleDescription=\"Extexport.exe loads dll and is execute from other folder the original path\";\nlet q21=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"extrac32.exe\" or TargetProcessName endswith \"\\\\extrac32.exe\" or TargetProcessFilename =~ \"extrac32.exe\") and TargetProcessCommandLine contains \".cab\" and (TargetProcessCommandLine contains \"/C\" or TargetProcessCommandLine contains \"/Y\" or TargetProcessCommandLine contains \" \\\\\\\\\"))|extend RuleId=\"aa8e035d-7be4-48d3-a944-102aec04400d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_extrac32.yml\"|extend RuleTitle=\"Suspicious Extrac32 Execution\"|extend RuleDescription=\"Download or Copy file with Extrac32\";\nlet q22=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"extrac32.exe\" and TargetProcessCommandLine contains \".cab\") and TargetProcessCommandLine matches regex \":[^\\\\\\\\]\")|extend RuleId=\"4b13db67-0c45-40f1-aba8-66a1a7198a1e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_extrac32_ads.yml\"|extend RuleTitle=\"Suspicious Extrac32 Alternate Data Stream Execution\"|extend RuleDescription=\"Extract data from cab file and hide it in an alternate data stream\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19, q20, q21, q22;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Execution", "DefenseEvasion", "CommandAndControl", "LateralMovement", "Exfiltration"],
                "techniques": ["T1127", "T1027", "T1567", "T1105", "T1210", "T1564", "T1218", "T1216", "T1202", "T1106"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000106",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}