{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000210')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000210')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 10",
                "description": "Sigma Windows Process Creation medium 10",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\Stracciatella.exe\" or TargetProcessFilename =~ \"Stracciatella.exe\" or TargetProcessFileDescription =~ \"Stracciatella\" or (TargetProcessIMPHASH=~\"SHA256=9d25e61ec1527e2a69d7c2a4e3fe2fe15890710c198a66a9f25d99fdf6c7b956\" or TargetProcessIMPHASH=~\"SHA256=fd16609bd9830c63b9413671678bb159b89c357d21942ddbb6b93add808d121a\") or (TargetProcessSHA256 =~ \"9d25e61ec1527e2a69d7c2a4e3fe2fe15890710c198a66a9f25d99fdf6c7b956\" or TargetProcessSHA256 =~ \"fd16609bd9830c63b9413671678bb159b89c357d21942ddbb6b93add808d121a\"))|extend RuleId=\"7a4d9232-92fc-404d-8ce1-4c92e7caf539\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_stracciatella_execution.yml\"|extend RuleTitle=\"HackTool - Stracciatella Execution\"|extend RuleDescription=\"Detects Stracciatella which executes a Powershell runspace from within C# (aka SharpPick technique) with AMSI, ETW and Script Block Logging disabled based on PE metadata characteristics.\";\nlet q1=_Im_ProcessCreate\n| where (TargetProcessFilename =~ \"TruffleSnout.exe\" or TargetProcessName endswith \"\\\\TruffleSnout.exe\")|extend RuleId=\"69ca006d-b9a9-47f5-80ff-ecd4d25d481a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_trufflesnout.yml\"|extend RuleTitle=\"HackTool - TruffleSnout Execution\"|extend RuleDescription=\"Detects the use of TruffleSnout.exe an iterative AD discovery toolkit for offensive operators, situational awareness and targeted low noise enumeration.\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessFileProduct =~ \"UACMe\" or (TargetProcessFileCompany =~ \"REvol Corp\" or TargetProcessFileCompany =~ \"APT 92\" or TargetProcessFileCompany =~ \"UG North\" or TargetProcessFileCompany =~ \"Hazardous Environments\" or TargetProcessFileCompany =~ \"CD Project Rekt\") or (TargetProcessFileDescription =~ \"UACMe main module\" or TargetProcessFileDescription =~ \"Pentesting utility\") or (TargetProcessFilename =~ \"Akagi.exe\" or TargetProcessFilename =~ \"Akagi64.exe\")) or (TargetProcessName endswith \"\\\\Akagi64.exe\" or TargetProcessName endswith \"\\\\Akagi.exe\") or (TargetProcessIMPHASH=~\"767637C23BB42CD5D7397CF58B0BE688\" or TargetProcessIMPHASH=~\"14C4E4C72BA075E9069EE67F39188AD8\" or TargetProcessIMPHASH=~\"3C782813D4AFCE07BBFC5A9772ACDBDC\" or TargetProcessIMPHASH=~\"7D010C6BB6A3726F327F7E239166D127\" or TargetProcessIMPHASH=~\"89159BA4DD04E4CE5559F132A9964EB3\" or TargetProcessIMPHASH=~\"6F33F4A5FC42B8CEC7314947BD13F30F\" or TargetProcessIMPHASH=~\"5834ED4291BDEB928270428EBBAF7604\" or TargetProcessIMPHASH=~\"5A8A8A43F25485E7EE1B201EDCBC7A38\" or TargetProcessIMPHASH=~\"DC7D30B90B2D8ABF664FBED2B1B59894\" or TargetProcessIMPHASH=~\"41923EA1F824FE63EA5BEB84DB7A3E74\" or TargetProcessIMPHASH=~\"3DE09703C8E79ED2CA3F01074719906B\") or (TargetProcessIMPHASH =~ \"767637c23bb42cd5d7397cf58b0be688\" or TargetProcessIMPHASH =~ \"14c4e4c72ba075e9069ee67f39188ad8\" or TargetProcessIMPHASH =~ \"3c782813d4afce07bbfc5a9772acdbdc\" or TargetProcessIMPHASH =~ \"7d010c6bb6a3726f327f7e239166d127\" or TargetProcessIMPHASH =~ \"89159ba4dd04e4ce5559f132a9964eb3\" or TargetProcessIMPHASH =~ \"6f33f4a5fc42b8cec7314947bd13f30f\" or TargetProcessIMPHASH =~ \"5834ed4291bdeb928270428ebbaf7604\" or TargetProcessIMPHASH =~ \"5a8a8a43f25485e7ee1b201edcbc7a38\" or TargetProcessIMPHASH =~ \"dc7d30b90b2d8abf664fbed2b1b59894\" or TargetProcessIMPHASH =~ \"41923ea1f824fe63ea5beb84db7a3e74\" or TargetProcessIMPHASH =~ \"3de09703c8e79ed2ca3f01074719906b\"))|extend RuleId=\"d38d2fa4-98e6-4a24-aff1-410b0c9ad177\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_uacme.yml\"|extend RuleTitle=\"HackTool - UACMe Akagi Execution\"|extend RuleDescription=\"Detects the execution of UACMe, a tool used for UAC bypasses, via default PE metadata\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"winPEAS.exe\" or (TargetProcessName endswith \"\\\\winPEASany_ofs.exe\" or TargetProcessName endswith \"\\\\winPEASany.exe\" or TargetProcessName endswith \"\\\\winPEASx64_ofs.exe\" or TargetProcessName endswith \"\\\\winPEASx64.exe\" or TargetProcessName endswith \"\\\\winPEASx86_ofs.exe\" or TargetProcessName endswith \"\\\\winPEASx86.exe\")) or (TargetProcessCommandLine contains \" applicationsinfo\" or TargetProcessCommandLine contains \" browserinfo\" or TargetProcessCommandLine contains \" eventsinfo\" or TargetProcessCommandLine contains \" fileanalysis\" or TargetProcessCommandLine contains \" filesinfo\" or TargetProcessCommandLine contains \" processinfo\" or TargetProcessCommandLine contains \" servicesinfo\" or TargetProcessCommandLine contains \" windowscreds\") or TargetProcessCommandLine contains \"https://github.com/carlospolop/PEASS-ng/releases/latest/download/\" or (ActingProcessCommandLine endswith \" -linpeas\" or TargetProcessCommandLine endswith \" -linpeas\"))|extend RuleId=\"98b53e78-ebaf-46f8-be06-421aafd176d9\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_winpeas.yml\"|extend RuleTitle=\"HackTool - winPEAS Execution\"|extend RuleDescription=\"WinPEAS is a script that search for possible paths to escalate privileges on Windows hosts. The checks are explained on book.hacktricks.xyz\";\nlet q4=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"Offline_Winpwn\" or TargetProcessCommandLine contains \"WinPwn \" or TargetProcessCommandLine contains \"WinPwn.exe\" or TargetProcessCommandLine contains \"WinPwn.ps1\")|extend RuleId=\"d557dc06-62e8-4468-a8e8-7984124908ce\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_winpwn.yml\"|extend RuleTitle=\"HackTool - WinPwn Execution\"|extend RuleDescription=\"Detects commandline keywords indicative of potential usge of the tool WinPwn. A tool for Windows and Active Directory reconnaissance and exploitation.\\n\";\nlet q5=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"-NoP -NoL -sta -NonI -W Hidden -Exec Bypass -Enc\"|extend RuleId=\"022eaba8-f0bf-4dd9-9217-4604b0bb3bb0\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_wmiexec_default_powershell.yml\"|extend RuleTitle=\"HackTool - Wmiexec Default Powershell Command\"|extend RuleDescription=\"Detects the execution of PowerShell with a specific flag sequence that is used by the Wmiexec script\";\nlet q6=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\xordump.exe\" or (TargetProcessCommandLine contains \" -process lsass.exe \" or TargetProcessCommandLine contains \" -m comsvcs \" or TargetProcessCommandLine contains \" -m dbghelp \" or TargetProcessCommandLine contains \" -m dbgcore \"))|extend RuleId=\"66e563f9-1cbd-4a22-a957-d8b7c0f44372\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_xordump.yml\"|extend RuleTitle=\"HackTool - XORDump Execution\"|extend RuleDescription=\"Detects suspicious use of XORDump process memory dumping utility\";\nlet q7=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\Hwp.exe\" and TargetProcessName endswith \"\\\\gbb.exe\")|extend RuleId=\"023394c4-29d5-46ab-92b8-6a534c6f447b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hwp_exploits.yml\"|extend RuleTitle=\"Suspicious HWP Sub Processes\"|extend RuleDescription=\"Detects suspicious Hangul Word Processor (Hanword) sub processes that could indicate an exploitation\";\nlet q8=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\IEExec.exe\" or TargetProcessFilename =~ \"IEExec.exe\") and (TargetProcessCommandLine contains \"http://\" or TargetProcessCommandLine contains \"https://\"))|extend RuleId=\"9801abb8-e297-4dbf-9fbd-57dde0e830ad\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_ieexec_download.yml\"|extend RuleTitle=\"File Download And Execution Via IEExec.EXE\"|extend RuleDescription=\"Detects execution of the IEExec utility to download and execute files\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\iexpress.exe\" or TargetProcessFilename =~ \"IEXPRESS.exe\") and TargetProcessCommandLine contains \" /n \" and (TargetProcessCommandLine contains \":\\\\ProgramData\\\\\" or TargetProcessCommandLine contains \":\\\\Temp\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\System32\\\\Tasks\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\Tasks\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\"))|extend RuleId=\"b2b048b0-7857-4380-b0fb-d3f0ab820b71\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_iexpress_susp_execution.yml\"|extend RuleTitle=\"Self Extracting Package Creation Via Iexpress.EXE From Potentially Suspicious Location\"|extend RuleDescription=\"Detects the use of iexpress.exe to create binaries via Self Extraction Directive (SED) files located in potentially suspicious locations.\\nThis behavior has been observed in-the-wild by different threat actors.\\n\";\nlet q10=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\appcmd.exe\" or TargetProcessFilename =~ \"appcmd.exe\") and (TargetProcessCommandLine contains \"set\" and TargetProcessCommandLine contains \"config\" and TargetProcessCommandLine contains \"section:httplogging\" and TargetProcessCommandLine contains \"dontLog:true\"))|extend RuleId=\"e4ed6030-ffe5-4e6a-8a8a-ab3c1ab9d94e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_iis_appcmd_http_logging.yml\"|extend RuleTitle=\"Disable Windows IIS HTTP Logging\"|extend RuleDescription=\"Disables HTTP logging on a Windows IIS web server as seen by Threat Group 3390 (Bronze Union)\";\nlet q11=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\appcmd.exe\" or TargetProcessFilename =~ \"appcmd.exe\") and TargetProcessCommandLine contains \"list \") and ((TargetProcessCommandLine contains \" /config\" or TargetProcessCommandLine contains \" /xml\" or TargetProcessCommandLine contains \" -config\" or TargetProcessCommandLine contains \" -xml\") or ((TargetProcessCommandLine contains \" /@t\" or TargetProcessCommandLine contains \" /text\" or TargetProcessCommandLine contains \" /show\" or TargetProcessCommandLine contains \" -@t\" or TargetProcessCommandLine contains \" -text\" or TargetProcessCommandLine contains \" -show\") and (TargetProcessCommandLine contains \":\\\\*\" or TargetProcessCommandLine contains \"password\"))))|extend RuleId=\"2d3cdeec-c0db-45b4-aa86-082f7eb75701\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_iis_appcmd_service_account_password_dumped.yml\"|extend RuleTitle=\"Microsoft IIS Service Account Password Dumped\"|extend RuleDescription=\"Detects the Internet Information Services (IIS) command-line tool, AppCmd, being used to list passwords\";\nlet q12=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\aspnet_regiis.exe\" or TargetProcessFilename =~ \"aspnet_regiis.exe\") and (TargetProcessCommandLine contains \"connectionStrings\" and TargetProcessCommandLine contains \" -pdf\"))|extend RuleId=\"97dbf6e2-e436-44d8-abee-4261b24d3e41\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_iis_connection_strings_decryption.yml\"|extend RuleTitle=\"Microsoft IIS Connection Strings Decryption\"|extend RuleDescription=\"Detects use of aspnet_regiis to decrypt Microsoft IIS connection strings. An attacker with Microsoft IIS web server access via a webshell or alike can decrypt and dump any hardcoded connection strings, such as the MSSQL service account password using aspnet_regiis command.\";\nlet q13=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\w3wp.exe\" and (TargetProcessCommandLine contains \"appcmd.exe add module\" or (TargetProcessCommandLine contains \" system.enterpriseservices.internal.publish\" and TargetProcessName endswith \"\\\\powershell.exe\") or (TargetProcessCommandLine contains \"gacutil\" and TargetProcessCommandLine contains \" /I\")))|extend RuleId=\"043c4b8b-3a54-4780-9682-081cb6b8185c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_iis_susp_module_registration.yml\"|extend RuleTitle=\"Suspicious IIS Module Registration\"|extend RuleDescription=\"Detects a suspicious IIS module registration as described in Microsoft threat report on IIS backdoors\";\nlet q14=_Im_ProcessCreate\n| where (((ActingProcessName endswith \"\\\\WmiPrvSE.exe\" or ActingProcessName endswith \"\\\\svchost.exe\" or ActingProcessName endswith \"\\\\dllhost.exe\") and TargetProcessName endswith \"\\\\ImagingDevices.exe\") or ActingProcessName endswith \"\\\\ImagingDevices.exe\")|extend RuleId=\"f11f2808-adb4-46c0-802a-8660db50fa99\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_imagingdevices_unusual_parents.yml\"|extend RuleTitle=\"ImagingDevices Unusual Parent/Child Processes\"|extend RuleDescription=\"Detects unusual parent or children of the ImagingDevices.exe (Windows Contacts) process as seen being used with Bumblebee activity\";\nlet q15=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\IMEWDBLD.exe\" or TargetProcessFilename =~ \"imewdbld.exe\") and (TargetProcessCommandLine contains \"http://\" or TargetProcessCommandLine contains \"https://\"))|extend RuleId=\"863218bd-c7d0-4c52-80cd-0a96c09f54af\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_imewbdld_download.yml\"|extend RuleTitle=\"Arbitrary File Download Via IMEWDBLD.EXE\"|extend RuleDescription=\"Detects usage of \\\"IMEWDBLD.exe\\\" to download arbitrary files\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["CommandAndControl", "PrivilegeEscalation", "Discovery", "DefenseEvasion", "CredentialAccess", "InitialAccess", "Persistence", "Execution", "LateralMovement"],
                "techniques": ["T1003", "T1106", "T1566", "T1105", "T1087", "T1552", "T1562", "T1203", "T1046", "T1036", "T1548", "T1482", "T1518", "T1082", "T1505", "T1555", "T1059", "T1218"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000210",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}