{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000232')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000232')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 32",
                "description": "Sigma Windows Process Creation medium 32",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (ActingProcessName =~ \"C:\\\\Windows\\\\PSEXESVC.exe\" and (TargetUsername contains \"AUTHORI\" or TargetUsername contains \"AUTORI\"))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000231\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_psexesvc_as_system.yml\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"pssuspend.exe\" or (TargetProcessName endswith \"\\\\pssuspend.exe\" or TargetProcessName endswith \"\\\\pssuspend64.exe\")) and TargetProcessCommandLine contains \"msmpeng.exe\")|extend RuleId=\"4beb6ae0-f85b-41e2-8f18-8668abc8af78\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_pssuspend_susp_execution.yml\";\nlet q2=_Im_ProcessCreate\n| where (TargetProcessFilename =~ \"sdelete.exe\" and (not((TargetProcessCommandLine contains \" -h\" or TargetProcessCommandLine contains \" -c\" or TargetProcessCommandLine contains \" -z\" or TargetProcessCommandLine contains \" /\\?\"))))|extend RuleId=\"a4824fca-976f-4964-b334-0621379e84c4\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_sdelete.yml\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \" -s cmd\" or TargetProcessCommandLine contains \" /s cmd\" or TargetProcessCommandLine contains \" -s -i cmd\" or TargetProcessCommandLine contains \" /s /i cmd\" or TargetProcessCommandLine contains \" /s -i cmd\" or TargetProcessCommandLine contains \" -s /i cmd\" or TargetProcessCommandLine contains \" -i -s cmd\" or TargetProcessCommandLine contains \" /i /s cmd\" or TargetProcessCommandLine contains \" -i /s cmd\" or TargetProcessCommandLine contains \" /i -s cmd\" or TargetProcessCommandLine contains \" -s pwsh\" or TargetProcessCommandLine contains \" /s pwsh\" or TargetProcessCommandLine contains \" -s -i pwsh\" or TargetProcessCommandLine contains \" /s /i pwsh\" or TargetProcessCommandLine contains \" /s -i pwsh\" or TargetProcessCommandLine contains \" -s /i pwsh\" or TargetProcessCommandLine contains \" -i -s pwsh\" or TargetProcessCommandLine contains \" /i /s pwsh\" or TargetProcessCommandLine contains \" -i /s pwsh\" or TargetProcessCommandLine contains \" /i -s pwsh\" or TargetProcessCommandLine contains \" -s powershell\" or TargetProcessCommandLine contains \" /s powershell\" or TargetProcessCommandLine contains \" -s -i powershell\" or TargetProcessCommandLine contains \" /s /i powershell\" or TargetProcessCommandLine contains \" /s -i powershell\" or TargetProcessCommandLine contains \" -s /i powershell\" or TargetProcessCommandLine contains \" -i -s powershell\" or TargetProcessCommandLine contains \" /i /s powershell\" or TargetProcessCommandLine contains \" -i /s powershell\" or TargetProcessCommandLine contains \" /i -s powershell\") and (not((TargetProcessCommandLine contains \"paexec\" or TargetProcessCommandLine contains \"PsExec\" or TargetProcessCommandLine contains \"accepteula\"))))|extend RuleId=\"207b0396-3689-42d9-8399-4222658efc99\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_susp_psexec_paexec_flags.yml\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \" -s cmd\" or TargetProcessCommandLine contains \" /s cmd\" or TargetProcessCommandLine contains \" -s -i cmd\" or TargetProcessCommandLine contains \" /s /i cmd\" or TargetProcessCommandLine contains \" /s -i cmd\" or TargetProcessCommandLine contains \" -s /i cmd\" or TargetProcessCommandLine contains \" -i -s cmd\" or TargetProcessCommandLine contains \" /i /s cmd\" or TargetProcessCommandLine contains \" -i /s cmd\" or TargetProcessCommandLine contains \" /i -s cmd\" or TargetProcessCommandLine contains \" -s pwsh\" or TargetProcessCommandLine contains \" /s pwsh\" or TargetProcessCommandLine contains \" -s -i pwsh\" or TargetProcessCommandLine contains \" /s /i pwsh\" or TargetProcessCommandLine contains \" /s -i pwsh\" or TargetProcessCommandLine contains \" -s /i pwsh\" or TargetProcessCommandLine contains \" -i -s pwsh\" or TargetProcessCommandLine contains \" /i /s pwsh\" or TargetProcessCommandLine contains \" -i /s pwsh\" or TargetProcessCommandLine contains \" /i -s pwsh\" or TargetProcessCommandLine contains \" -s powershell\" or TargetProcessCommandLine contains \" /s powershell\" or TargetProcessCommandLine contains \" -s -i powershell\" or TargetProcessCommandLine contains \" /s /i powershell\" or TargetProcessCommandLine contains \" /s -i powershell\" or TargetProcessCommandLine contains \" -s /i powershell\" or TargetProcessCommandLine contains \" -i -s powershell\" or TargetProcessCommandLine contains \" /i /s powershell\" or TargetProcessCommandLine contains \" -i /s powershell\" or TargetProcessCommandLine contains \" /i -s powershell\") and (not((TargetProcessCommandLine contains \"paexec\" or TargetProcessCommandLine contains \"PsExec\" or TargetProcessCommandLine contains \"accepteula\"))))|extend RuleId=\"207b0396-3689-42d9-8399-4222658efc99\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_susp_psexec_paexec_flags_.yml\";\nlet q5=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\Sysmon64.exe\" or TargetProcessName endswith \"\\\\Sysmon.exe\") or TargetProcessFileDescription =~ \"System activity monitor\") and (TargetProcessCommandLine contains \"-u\" or TargetProcessCommandLine contains \"/u\"))|extend RuleId=\"6a5f68d1-c4b5-46b9-94ee-5324892ea939\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_sysmon_uninstall.yml\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\SystemSettingsAdminFlows.exe\" or TargetProcessFilename =~ \"SystemSettingsAdminFlows.EXE\") and TargetProcessCommandLine contains \"TurnOnDeveloperFeatures\" and (TargetProcessCommandLine contains \"DeveloperUnlock\" or TargetProcessCommandLine contains \"EnableSideloading\"))|extend RuleId=\"a383dec4-deec-4e6e-913b-ed9249670848\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_systemsettingsadminflows_turn_on_dev_features.yml\";\nlet q7=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"taskkill\" and TargetProcessCommandLine contains \" /F \" and TargetProcessCommandLine contains \" /IM \" and TargetProcessCommandLine contains \"ccSvcHst.exe\")|extend RuleId=\"4a6713f6-3331-11ed-a261-0242ac120002\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_taskkill_sep.yml\";\nlet q8=_Im_ProcessCreate\n| where ((TargetUsername contains \"AUTHORI\" or TargetUsername contains \"AUTORI\") and TargetProcessName endswith \"\\\\taskmgr.exe\")|extend RuleId=\"9fff585c-c33e-4a86-b3cd-39312079a65f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_taskmgr_localsystem.yml\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"\\\\Microsoft\\\\Teams\\\\Cookies\" or TargetProcessCommandLine contains \"\\\\Microsoft\\\\Teams\\\\Local Storage\\\\leveldb\") and (not(TargetProcessName endswith \"\\\\Microsoft\\\\Teams\\\\current\\\\Teams.exe\")))|extend RuleId=\"d2eb17db-1d39-41dc-b57f-301f6512fa75\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_teams_suspicious_command_line_cred_access.yml\";\nlet q10=_Im_ProcessCreate\n| where ((TargetUsername contains \"AUTHORI\" or TargetUsername contains \"AUTORI\") and TargetProcessName endswith \"\\\\tscon.exe\")|extend RuleId=\"9847f263-4a81-424f-970c-875dab15b79b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_tscon_localsystem.yml\";\nlet q11=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \" /dest:rdp-tcp#\"|extend RuleId=\"f72aa3e8-49f9-4c7d-bd74-f8ab84ff9bbb\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_tscon_rdp_redirect.yml\";\nlet q12=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\changepk.exe\" and ActingProcessName endswith \"\\\\slui.exe\" and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\"))|extend RuleId=\"503d581c-7df0-4bbe-b9be-5840c0ecc1fc\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_changepk_slui.yml\";\nlet q13=_Im_ProcessCreate\n| where (TargetProcessCommandLine endswith \"\\\"\\\\system32\\\\cleanmgr.exe /autoclean /d C:\" and ActingProcessCommandLine =~ \"C:\\\\Windows\\\\system32\\\\svchost.exe -k netsvcs -p -s Schedule\" and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\"))|extend RuleId=\"b697e69c-746f-4a86-9f59-7bfff8eab881\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_cleanmgr.yml\";\nlet q14=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\cmstp.exe\" or TargetProcessFilename =~ \"CMSTP.EXE\") and (TargetProcessCommandLine contains \"/s\" or TargetProcessCommandLine contains \"-s\" or TargetProcessCommandLine contains \"/au\" or TargetProcessCommandLine contains \"-au\" or TargetProcessCommandLine contains \"/ni\" or TargetProcessCommandLine contains \"-ni\"))|extend RuleId=\"e66779cc-383e-4224-a3a4-267eeb585c40\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_cmstp.yml\";\nlet q15=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\DllHost.exe\" and (ActingProcessCommandLine contains \" /Processid:{3E5FC7F9-9A51-4367-9063-A120244FBEC7}\" or ActingProcessCommandLine contains \" /Processid:{3E000D72-A845-4CD9-BD83-80C07C3B881F}\" or ActingProcessCommandLine contains \" /Processid:{BD54C901-076B-434E-B6C7-17C531F4AB41}\" or ActingProcessCommandLine contains \" /Processid:{D2E7041B-2927-42FB-8E9F-7CE93B6DC937}\" or ActingProcessCommandLine contains \" /Processid:{E9495B87-D950-4AB5-87A5-FF6D70BF3E90}\") and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\"))|extend RuleId=\"4b60e6f2-bf39-47b4-b4ea-398e33cfe253\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_cmstp_com_object_access.yml\";\nlet q16=_Im_ProcessCreate\n| where (((TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\") and TargetProcessName =~ \"C:\\\\Windows\\\\System32\\\\ComputerDefaults.exe\") and (not((ActingProcessName contains \":\\\\Windows\\\\System32\" or ActingProcessName contains \":\\\\Program Files\"))))|extend RuleId=\"3c05e90d-7eba-4324-9972-5d7f711a60a8\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_computerdefaults.yml\";\nlet q17=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\consent.exe\" and TargetProcessName endswith \"\\\\werfault.exe\" and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\"))|extend RuleId=\"1ca6bd18-0ba0-44ca-851c-92ed89a61085\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_consent_comctl32.yml\";\nlet q18=_Im_ProcessCreate\n| where ((ActingProcessName contains \"C:\\\\Users\\\\\" and ActingProcessName contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" and ActingProcessName contains \"\\\\DismHost.exe\") and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\"))|extend RuleId=\"853e74f9-9392-4935-ad3b-2e8c040dae86\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_dismhost.yml\";\nlet q19=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\eventvwr.exe\" and (not((TargetProcessName endswith \"\\\\mmc.exe\" or TargetProcessName endswith \":\\\\Windows\\\\SysWOW64\\\\WerFault.exe\" or TargetProcessName endswith \":\\\\Windows\\\\System32\\\\WerFault.exe\"))))|extend RuleId=\"be344333-921d-4c4d-8bb8-e584cf584780\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_eventvwr.yml\";\nlet q20=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"\\\\Event Viewer\\\\RecentViews\" or TargetProcessCommandLine contains \"\\\\EventV~1\\\\RecentViews\") and TargetProcessCommandLine contains \">\")|extend RuleId=\"30fc8de7-d833-40c4-96b6-28319fbc4f6c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_eventvwr_recentviews.yml\";\nlet q21=_Im_ProcessCreate\n| where ActingProcessName endswith \"\\\\fodhelper.exe\"|extend RuleId=\"7f741dcf-fc22-4759-87b4-9ae8376676a2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_fodhelper.yml\";\nlet q22=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\dllhost.exe\" and (ActingProcessCommandLine contains \"/Processid:{3E5FC7F9-9A51-4367-9063-A120244FBEC7}\" or ActingProcessCommandLine contains \"/Processid:{D2E7041B-2927-42FB-8E9F-7CE93B6DC937}\")) and (not((TargetProcessName endswith \"\\\\WerFault.exe\" or TargetProcessFilename =~ \"WerFault.exe\"))))|extend RuleId=\"49f2f17b-b4c8-4172-a68b-d5bf95d05130\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_icmluautil.yml\";\nlet q23=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\DllHost.exe\" and ActingProcessCommandLine contains \" /Processid:{12C21EA7-2EB8-4B55-9249-AC243DA8C666}\" and (TargetProcessIntegrityLevel =~ \"High\" or TargetProcessIntegrityLevel =~ \"System\"))|extend RuleId=\"4cbef972-f347-4170-b62a-8253f6168e6d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_uac_bypass_idiagnostic_profile.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19, q20, q21, q22, q23;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["LateralMovement", "Impact", "CredentialAccess", "PrivilegeEscalation", "ResourceDevelopment", "CommandAndControl", "DefenseEvasion", "Execution"],
                "techniques": ["T1218", "T1528", "T1562", "T1036", "T1021", "T1587", "T1548", "T1219", "T1485", "T1563"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000232",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}