{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000205')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000205')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 05",
                "description": "Sigma Windows Process Creation medium 05",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\explorer.exe\" and TargetProcessCommandLine contains \"/NOUACCHECK\") and (not((ActingProcessCommandLine =~ \"C:\\\\Windows\\\\system32\\\\svchost.exe -k netsvcs -p -s Schedule\" or ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\svchost.exe\"))))|extend RuleId=\"534f2ef7-e8a2-4433-816d-c91bccde289b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_explorer_nouaccheck.yml\"|extend RuleTitle=\"Explorer NOUACCHECK Flag\"|extend RuleDescription=\"Detects suspicious starts of explorer.exe that use the /NOUACCHECK flag that allows to run all sub processes of that newly started explorer.exe without any UAC checks\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\findstr.exe\" or TargetProcessFilename =~ \"FINDSTR.EXE\") and (TargetProcessCommandLine contains \"cpassword\" and TargetProcessCommandLine contains \"\\\\sysvol\\\\\" and TargetProcessCommandLine contains \".xml\"))|extend RuleId=\"91a2c315-9ee6-4052-a853-6f6a8238f90d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_findstr_gpp_passwords.yml\"|extend RuleTitle=\"Findstr GPP Passwords\"|extend RuleDescription=\"Look for the encrypted cpassword value within Group Policy Preference files on the Domain Controller. This value can be decrypted with gpp-decrypt.\";\nlet q2=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\findstr.exe\" or TargetProcessFilename =~ \"FINDSTR.EXE\") and TargetProcessCommandLine contains \"lsass\") or (TargetProcessCommandLine contains \" /i \\\"lsass\" or TargetProcessCommandLine contains \" /i lsass.exe\" or TargetProcessCommandLine contains \"findstr \\\"lsass\" or TargetProcessCommandLine contains \"findstr lsass\" or TargetProcessCommandLine contains \"findstr.exe \\\"lsass\" or TargetProcessCommandLine contains \"findstr.exe lsass\"))|extend RuleId=\"fe63010f-8823-4864-a96b-a7b4a0f7b929\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_findstr_lsass.yml\"|extend RuleTitle=\"LSASS Process Reconnaissance Via Findstr.EXE\"|extend RuleDescription=\"Detects findstring commands that include the keyword lsass, which indicates recon actviity for the LSASS process PID\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\findstr.exe\" or TargetProcessFilename =~ \"FINDSTR.EXE\") and TargetProcessCommandLine contains \" 385201\")|extend RuleId=\"37db85d1-b089-490a-a59a-c7b6f984f480\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_findstr_sysmon_discovery_via_default_altitude.yml\"|extend RuleTitle=\"Sysmon Discovery Via Default Driver Altitude Using Findstr.EXE\"|extend RuleDescription=\"Detects usage of \\\"findstr\\\" with the argument \\\"385201\\\". Which could indicate potential discovery of an installed Sysinternals Sysmon service using the default driver altitude (even if the name is changed).\";\nlet q4=_Im_ProcessCreate\n| where (TargetProcessFilename =~ \"finger.exe\" or TargetProcessName endswith \"\\\\finger.exe\")|extend RuleId=\"af491bca-e752-4b44-9c86-df5680533dbc\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_finger_usage.yml\"|extend RuleTitle=\"Finger.exe Suspicious Invocation\"|extend RuleDescription=\"Detects suspicious aged finger.exe tool execution often used in malware attacks nowadays\";\nlet q5=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\fltMC.exe\" or TargetProcessFilename =~ \"fltMC.exe\") and TargetProcessCommandLine contains \"unload\") and (not(TargetProcessCommandLine endswith \"unload rtp_filesystem_filter\")))|extend RuleId=\"4931188c-178e-4ee7-a348-39e8a7a56821\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_fltmc_unload_driver.yml\"|extend RuleTitle=\"Filter Driver Unloaded Via Fltmc.EXE\"|extend RuleDescription=\"Detect filter driver unloading activity via fltmc.exe\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\fltMC.exe\" or TargetProcessFilename =~ \"fltMC.exe\") and (TargetProcessCommandLine contains \"unload\" and TargetProcessCommandLine contains \"sysmon\"))|extend RuleId=\"4d7cda18-1b12-4e52-b45c-d28653210df8\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_fltmc_unload_driver_sysmon.yml\"|extend RuleTitle=\"Sysmon Driver Unloaded Via Fltmc.EXE\"|extend RuleDescription=\"Detects possible Sysmon filter driver unloaded via fltmc.exe\";\nlet q7=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\fsutil.exe\" or TargetProcessFilename =~ \"fsutil.exe\") and (TargetProcessCommandLine contains \"deletejournal\" or TargetProcessCommandLine contains \"createjournal\" or TargetProcessCommandLine contains \"setZeroData\"))|extend RuleId=\"add64136-62e5-48ea-807e-88638d02df1e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_fsutil_usage.yml\"|extend RuleTitle=\"Fsutil Suspicious Invocation\"|extend RuleDescription=\"Detects suspicious parameters of fsutil (deleting USN journal, configuring it with small size, etc).\\nMight be used by ransomwares during the attack (seen by NotPetya and others).\\n\";\nlet q8=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\GoogleUpdate.exe\" and (not(((TargetProcessName contains \"\\\\Google\" or (TargetProcessName endswith \"\\\\setup.exe\" or TargetProcessName endswith \"chrome_updater.exe\" or TargetProcessName endswith \"chrome_installer.exe\")) or isnull(TargetProcessName)))))|extend RuleId=\"84b1ecf9-6eff-4004-bafb-bae5c0e251b2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_googleupdate_susp_child_process.yml\"|extend RuleTitle=\"Potentially Suspicious GoogleUpdate Child Process\"|extend RuleDescription=\"Detects potentially suspicious child processes of \\\"GoogleUpdate.exe\\\"\";\nlet q9=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\gpg.exe\" or TargetProcessName endswith \"\\\\gpg2.exe\") or TargetProcessFilename =~ \"gpg.exe\" or TargetProcessFileDescription =~ \"GnuPG\u2019s OpenPGP tool\") and (not((TargetProcessName contains \":\\\\Program Files (x86)\\\\GnuPG\\\\bin\\\\\" or TargetProcessName contains \":\\\\Program Files (x86)\\\\GNU\\\\GnuPG\\\\bin\\\\\" or TargetProcessName contains \":\\\\Program Files (x86)\\\\Gpg4win\\\\bin\\\\\"))))|extend RuleId=\"77df53a5-1d78-4f32-bc5a-0e7465bd8f41\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_gpg4win_portable_execution.yml\"|extend RuleTitle=\"Portable Gpg.EXE Execution\"|extend RuleDescription=\"Detects the execution of \\\"gpg.exe\\\" from uncommon location. Often used by ransomware and loaders to decrypt/encrypt data.\";\nlet q10=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\gpg.exe\" or TargetProcessName endswith \"\\\\gpg2.exe\") or TargetProcessFileProduct =~ \"GNU Privacy Guard (GnuPG)\" or TargetProcessFileDescription =~ \"GnuPG\u2019s OpenPGP tool\") and TargetProcessCommandLine contains \"-passphrase\" and (TargetProcessCommandLine contains \":\\\\PerfLogs\\\\\" or TargetProcessCommandLine contains \":\\\\Temp\\\\\" or TargetProcessCommandLine contains \":\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\\"))|extend RuleId=\"e1e0b7d7-e10b-4ee4-ac49-a4bda05d320d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_gpg4win_susp_location.yml\"|extend RuleTitle=\"File Encryption/Decryption Via Gpg4win From Suspicious Locations\"|extend RuleDescription=\"Detects usage of Gpg4win to encrypt/decrypt files located in potentially suspicious locations.\";\nlet q11=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\GUP.exe\" or TargetProcessFilename =~ \"gup.exe\") and (TargetProcessCommandLine contains \" -unzipTo \" and TargetProcessCommandLine contains \"http\")) and (not(ActingProcessName endswith \"\\\\notepad++.exe\")))|extend RuleId=\"44143844-0631-49ab-97a0-96387d6b2d7c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_gup_download.yml\"|extend RuleTitle=\"File Download Using Notepad++ GUP Utility\"|extend RuleDescription=\"Detects execution of the Notepad++ updater (gup) from a process other than Notepad++ to download files.\";\nlet q12=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\GUP.exe\" and (not(((TargetProcessName endswith \"\\\\Program Files\\\\Notepad++\\\\updater\\\\GUP.exe\" or TargetProcessName endswith \"\\\\Program Files (x86)\\\\Notepad++\\\\updater\\\\GUP.exe\") or (TargetProcessName contains \"\\\\Users\\\\\" and (TargetProcessName endswith \"\\\\AppData\\\\Local\\\\Notepad++\\\\updater\\\\GUP.exe\" or TargetProcessName endswith \"\\\\AppData\\\\Roaming\\\\Notepad++\\\\updater\\\\GUP.exe\"))))))|extend RuleId=\"0a4f6091-223b-41f6-8743-f322ec84930b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_gup_suspicious_execution.yml\"|extend RuleTitle=\"Suspicious GUP Usage\"|extend RuleDescription=\"Detects execution of the Notepad++ updater in a suspicious directory, which is often used in DLL side-loading attacks\";\nlet q13=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"HH.exe\" or TargetProcessName endswith \"\\\\hh.exe\") and TargetProcessCommandLine contains \"http\")|extend RuleId=\"f57c58b3-ee69-4ef5-9041-455bf39aaa89\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hh_chm_remote_download_or_execution.yml\"|extend RuleTitle=\"Remote CHM File Download/Execution Via HH.EXE\"|extend RuleDescription=\"Detects the usage of \\\"hh.exe\\\" to execute/download remotely hosted \\\".chm\\\" files.\";\nlet q14=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\hh.exe\" and (TargetProcessName endswith \"\\\\CertReq.exe\" or TargetProcessName endswith \"\\\\CertUtil.exe\" or TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\installutil.exe\" or TargetProcessName endswith \"\\\\MSbuild.exe\" or TargetProcessName endswith \"\\\\MSHTA.EXE\" or TargetProcessName endswith \"\\\\msiexec.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessName endswith \"\\\\wmic.exe\" or TargetProcessName endswith \"\\\\wscript.exe\"))|extend RuleId=\"52cad028-0ff0-4854-8f67-d25dfcbc78b4\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hh_html_help_susp_child_process.yml\"|extend RuleTitle=\"HTML Help HH.EXE Suspicious Child Process\"|extend RuleDescription=\"Detects a suspicious child process of a Microsoft HTML Help (HH.exe)\";\nlet q15=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"HH.exe\" or TargetProcessName endswith \"\\\\hh.exe\") and (TargetProcessCommandLine contains \".application\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\Content.Outlook\\\\\" or TargetProcessCommandLine contains \"\\\\Downloads\\\\\" or TargetProcessCommandLine contains \"\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\Temp\\\\\"))|extend RuleId=\"e8a95b5e-c891-46e2-b33a-93937d3abc31\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hh_susp_execution.yml\"|extend RuleTitle=\"Suspicious HH.EXE Execution\"|extend RuleDescription=\"Detects a suspicious execution of a Microsoft HTML Help (HH.exe)\";\nlet q16=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \" --adcs \" and TargetProcessCommandLine contains \" --port \")|extend RuleId=\"cd8c163e-a19b-402e-bdd5-419ff5859f12\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_adcspwn.yml\"|extend RuleTitle=\"HackTool - ADCSPwn Execution\"|extend RuleDescription=\"Detects command line parameters used by ADCSPwn, a tool to escalate privileges in an active directory network by coercing authenticate from machine accounts and relaying to the certificate service\";\nlet q17=_Im_ProcessCreate\n| where ((TargetProcessFileProduct contains \"SharpHound\" or TargetProcessFileDescription contains \"SharpHound\" or (TargetProcessFileCompany contains \"SpecterOps\" or TargetProcessFileCompany contains \"evil corp\") or (TargetProcessName contains \"\\\\Bloodhound.exe\" or TargetProcessName contains \"\\\\SharpHound.exe\")) or (TargetProcessCommandLine contains \" -CollectionMethod All \" or TargetProcessCommandLine contains \" --CollectionMethods Session \" or TargetProcessCommandLine contains \" --Loop --Loopduration \" or TargetProcessCommandLine contains \" --PortScanTimeout \" or TargetProcessCommandLine contains \".exe -c All -d \" or TargetProcessCommandLine contains \"Invoke-Bloodhound\" or TargetProcessCommandLine contains \"Get-BloodHoundData\") or (TargetProcessCommandLine contains \" -JsonFolder \" and TargetProcessCommandLine contains \" -ZipFileName \") or (TargetProcessCommandLine contains \" DCOnly \" and TargetProcessCommandLine contains \" --NoSaveCache \"))|extend RuleId=\"f376c8a7-a2d0-4ddc-aa0c-16c17236d962\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_bloodhound_sharphound.yml\"|extend RuleTitle=\"HackTool - Bloodhound/Sharphound Execution\"|extend RuleDescription=\"Detects command line parameters used by Bloodhound and Sharphound hack tools\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Collection", "Discovery", "InitialAccess", "Execution", "DefenseEvasion", "CredentialAccess", "Impact", "CommandAndControl"],
                "techniques": ["T1548", "T1069", "T1218", "T1574", "T1518", "T1485", "T1562", "T1566", "T1557", "T1070", "T1059", "T1482", "T1105", "T1047", "T1087", "T1486", "T1552"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000205",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}