{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000232')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000232')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 32",
                "description": "Sigma Windows Process Creation medium 32",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\schtasks.exe\" and (TargetProcessCommandLine contains \"/delete\" and TargetProcessCommandLine contains \"/tn\") and (TargetProcessCommandLine contains \"\\\\Windows\\\\SystemRestore\\\\SR\" or TargetProcessCommandLine contains \"\\\\Windows\\\\Windows Defender\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\BitLocker\" or TargetProcessCommandLine contains \"\\\\Windows\\\\WindowsBackup\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\WindowsUpdate\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\UpdateOrchestrator\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\ExploitGuard\"))|extend RuleId=\"dbc1f800-0fe0-4bc0-9c66-292c2abe3f78\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_schtasks_delete.yml\"|extend RuleTitle=\"Delete Important Scheduled Task\"|extend RuleDescription=\"Detects when adversaries stop services or processes by deleting their respective scheduled tasks in order to conduct data destructive activities\";\nlet q1=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\schtasks.exe\" and (TargetProcessCommandLine contains \" /delete \" and TargetProcessCommandLine contains \"/tn \\\\*\" and TargetProcessCommandLine contains \" /f\"))|extend RuleId=\"220457c1-1c9f-4c2e-afe6-9598926222c1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_schtasks_delete_all.yml\"|extend RuleTitle=\"Delete All Scheduled Tasks\"|extend RuleDescription=\"Detects the usage of schtasks with the delete flag and the asterisk symbol to delete all tasks from the schedule of the local computer, including tasks scheduled by other users.\";\nlet q2=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\schtasks.exe\" and (TargetProcessCommandLine contains \"/Change\" and TargetProcessCommandLine contains \"/TN\" and TargetProcessCommandLine contains \"/disable\") and (TargetProcessCommandLine contains \"\\\\Windows\\\\SystemRestore\\\\SR\" or TargetProcessCommandLine contains \"\\\\Windows\\\\Windows Defender\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\BitLocker\" or TargetProcessCommandLine contains \"\\\\Windows\\\\WindowsBackup\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\WindowsUpdate\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\UpdateOrchestrator\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\ExploitGuard\"))|extend RuleId=\"9ac94dc8-9042-493c-ba45-3b5e7c86b980\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_schtasks_disable.yml\"|extend RuleTitle=\"Disable Important Scheduled Task\"|extend RuleDescription=\"Detects when adversaries stop services or processes by disabling their respective scheduled tasks in order to conduct data destructive activities\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessFilename =~ \"schtasks.exe\") and TargetProcessCommandLine contains \" /create \" and (TargetProcessCommandLine contains \"powershell\" or TargetProcessCommandLine contains \"pwsh\" or TargetProcessCommandLine contains \"cmd /c \" or TargetProcessCommandLine contains \"cmd /k \" or TargetProcessCommandLine contains \"cmd /r \" or TargetProcessCommandLine contains \"cmd.exe /c \" or TargetProcessCommandLine contains \"cmd.exe /k \" or TargetProcessCommandLine contains \"cmd.exe /r \") and (TargetProcessCommandLine contains \"C:\\\\ProgramData\\\\\" or TargetProcessCommandLine contains \"%ProgramData%\"))|extend RuleId=\"8a8379b8-780b-4dbf-b1e9-31c8d112fefb\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_schtasks_folder_combos.yml\"|extend RuleTitle=\"Schtasks From Suspicious Folders\"|extend RuleDescription=\"Detects scheduled task creations that have suspicious action command and folder combinations\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessName contains \"\\\\schtasks.exe\" or TargetProcessFilename =~ \"schtasks.exe\") and (TargetProcessCommandLine contains \"wscript\" or TargetProcessCommandLine contains \"vbscript\" or TargetProcessCommandLine contains \"cscript\" or TargetProcessCommandLine contains \"wmic \" or TargetProcessCommandLine contains \"wmic.exe\" or TargetProcessCommandLine contains \"regsvr32.exe\" or TargetProcessCommandLine contains \"powershell\" or TargetProcessCommandLine contains \"\\\\AppData\\\\\") and (TargetProcessCommandLine contains \"once\" and TargetProcessCommandLine contains \"00:00\"))|extend RuleId=\"970823b7-273b-460a-8afc-3a6811998529\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_schtasks_one_time_only_midnight_task.yml\"|extend RuleTitle=\"Uncommon One Time Only Scheduled Task At 00:00\"|extend RuleDescription=\"Detects scheduled task creation events that include suspicious actions, and is run once at 00:00\";\nlet q5=_Im_ProcessCreate\n| where (ActingProcessName =~ \"C:\\\\WINDOWS\\\\System32\\\\svchost.exe\" and (ActingProcessCommandLine contains \"-k netsvcs\" and ActingProcessCommandLine contains \"-s Schedule\") and (TargetProcessCommandLine endswith \" -windowstyle hidden\" or TargetProcessCommandLine endswith \" -w hidden\" or TargetProcessCommandLine endswith \" -ep bypass\" or TargetProcessCommandLine endswith \" -noni\"))|extend RuleId=\"b66474aa-bd92-4333-a16c-298155b120df\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_schtasks_powershell_persistence.yml\"|extend RuleTitle=\"Potential Persistence Via Powershell Search Order Hijacking - Task\"|extend RuleDescription=\"Detects suspicious powershell execution via a schedule task where the command ends with an suspicious flags to hide the powershell instance instead of executeing scripts or commands. This could be a sign of persistence via PowerShell \\\"Get-Variable\\\" technique as seen being used in Colibri Loader\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessFilename =~ \"schtasks.exe\") and TargetProcessCommandLine contains \"/Create\" and (TargetProcessCommandLine contains \"FromBase64String\" or TargetProcessCommandLine contains \"encodedcommand\") and (TargetProcessCommandLine contains \"Get-ItemProperty\" or TargetProcessCommandLine contains \" gp \") and (TargetProcessCommandLine contains \"HKCU:\" or TargetProcessCommandLine contains \"HKLM:\" or TargetProcessCommandLine contains \"registry::\" or TargetProcessCommandLine contains \"HKEY_\"))|extend RuleId=\"c4eeeeae-89f4-43a7-8b48-8d1bdfa66c78\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_schtasks_reg_loader_encoded.yml\"|extend RuleTitle=\"Scheduled Task Executing Encoded Payload from Registry\"|extend RuleDescription=\"Detects the creation of a schtask that potentially executes a base64 encoded payload stored in the Windows Registry using PowerShell.\";\nlet q7=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessFilename =~ \"schtasks.exe\") and (TargetProcessCommandLine contains \" ONLOGON \" or TargetProcessCommandLine contains \" ONSTART \" or TargetProcessCommandLine contains \" ONCE \" or TargetProcessCommandLine contains \" ONIDLE \")) and (not((TargetProcessCommandLine contains \"NT AUT\" or TargetProcessCommandLine contains \" SYSTEM\" or TargetProcessCommandLine contains \"HIGHEST\"))))|extend RuleId=\"24c8392b-aa3c-46b7-a545-43f71657fe98\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_schtasks_schedule_type.yml\"|extend RuleTitle=\"Suspicious Schtasks Schedule Types\"|extend RuleDescription=\"Detects scheduled task creations or modification on a suspicious schedule type\";\nlet q8=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\schtasks.exe\" and TargetProcessCommandLine contains \"/Create \") and (((TargetProcessCommandLine contains \"/sc minute \" or TargetProcessCommandLine contains \"/ru system \") and (TargetProcessCommandLine contains \"cmd /c\" or TargetProcessCommandLine contains \"cmd /k\" or TargetProcessCommandLine contains \"cmd /r\" or TargetProcessCommandLine contains \"cmd.exe /c \" or TargetProcessCommandLine contains \"cmd.exe /k \" or TargetProcessCommandLine contains \"cmd.exe /r \")) or (TargetProcessCommandLine contains \" -decode \" or TargetProcessCommandLine contains \" -enc \" or TargetProcessCommandLine contains \" -w hidden \" or TargetProcessCommandLine contains \" bypass \" or TargetProcessCommandLine contains \" IEX\" or TargetProcessCommandLine contains \".DownloadData\" or TargetProcessCommandLine contains \".DownloadFile\" or TargetProcessCommandLine contains \".DownloadString\" or TargetProcessCommandLine contains \"/c start /min \" or TargetProcessCommandLine contains \"FromBase64String\" or TargetProcessCommandLine contains \"mshta http\" or TargetProcessCommandLine contains \"mshta.exe http\") or ((TargetProcessCommandLine contains \":\\\\Windows\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\\" or TargetProcessCommandLine contains \"%AppData%\" or TargetProcessCommandLine contains \"%Temp%\" or TargetProcessCommandLine contains \"%tmp%\") and (TargetProcessCommandLine contains \"cscript\" or TargetProcessCommandLine contains \"curl\" or TargetProcessCommandLine contains \"wscript\"))))|extend RuleId=\"f2c64357-b1d2-41b7-849f-34d2682c0fad\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_schtasks_susp_pattern.yml\"|extend RuleTitle=\"Suspicious Command Patterns In Scheduled Task Creation\"|extend RuleDescription=\"Detects scheduled task creation using \\\"schtasks\\\" that contain potentially suspicious or uncommon commands\";\nlet q9=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\schtasks.exe\" and (TargetProcessCommandLine contains \" /change \" or TargetProcessCommandLine contains \" /create \")) and TargetProcessCommandLine contains \"/ru \" and (TargetProcessCommandLine contains \"NT AUT\" or TargetProcessCommandLine contains \" SYSTEM \")) and (not(((TargetProcessName endswith \"\\\\schtasks.exe\" and (TargetProcessCommandLine contains \"/TN TVInstallRestore\" and TargetProcessCommandLine contains \"\\\\TeamViewer_.exe\")) or (TargetProcessCommandLine contains \"/Create /F /RU System /SC WEEKLY /TN AviraSystemSpeedupVerify /TR \" or TargetProcessCommandLine contains \":\\\\Program Files (x86)\\\\Avira\\\\System Speedup\\\\setup\\\\avira_speedup_setup.exe\" or TargetProcessCommandLine contains \"/VERIFY /VERYSILENT /NOSTART /NODOTNET /NORESTART\\\" /RL HIGHEST\")))))|extend RuleId=\"89ca78fd-b37c-4310-b3d3-81a023f83936\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_schtasks_system.yml\"|extend RuleTitle=\"Schtasks Creation Or Modification With SYSTEM Privileges\"|extend RuleDescription=\"Detects the creation or update of a scheduled task to run with \\\"NT AUTHORITY\\\\SYSTEM\\\" privileges\";\nlet q10=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\scrcons.exe\" and (TargetProcessName endswith \"\\\\svchost.exe\" or TargetProcessName endswith \"\\\\dllhost.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\wscript.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\schtasks.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\msiexec.exe\" or TargetProcessName endswith \"\\\\msbuild.exe\"))|extend RuleId=\"f6d1dd2f-b8ce-40ca-bc23-062efb686b34\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_scrcons_susp_child_process.yml\"|extend RuleTitle=\"Script Event Consumer Spawning Process\"|extend RuleDescription=\"Detects a suspicious child process of Script Event Consumer (scrcons.exe).\";\nlet q11=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\sc.exe\" and TargetProcessIntegrityLevel =~ \"Medium\") and ((TargetProcessCommandLine contains \"config\" and TargetProcessCommandLine contains \"binPath\") or (TargetProcessCommandLine contains \"failure\" and TargetProcessCommandLine contains \"command\")))|extend RuleId=\"d937b75f-a665-4480-88a5-2f20e9f9b22a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sc_change_sevice_image_path_by_non_admin.yml\"|extend RuleTitle=\"Possible Privilege Escalation via Weak Service Permissions\"|extend RuleDescription=\"Detection of sc.exe utility spawning by user with Medium integrity level to change service ImagePath or FailureCommand\";\nlet q12=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\sc.exe\" or TargetProcessFilename =~ \"sc.exe\") and (TargetProcessCommandLine contains \"sdset\" and TargetProcessCommandLine contains \"A;\") and (TargetProcessCommandLine contains \";IU\" or TargetProcessCommandLine contains \";SU\" or TargetProcessCommandLine contains \";BA\" or TargetProcessCommandLine contains \";SY\" or TargetProcessCommandLine contains \";WD\"))|extend RuleId=\"6c8fbee5-dee8-49bc-851d-c3142d02aa47\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sc_sdset_allow_service_changes.yml\"|extend RuleTitle=\"Allow Service Access Using Security Descriptor Tampering Via Sc.EXE\"|extend RuleDescription=\"Detects suspicious DACL modifications to allow access to a service from a suspicious trustee. This can be used to override access restrictions set by previous ACLs.\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Impact", "DefenseEvasion", "Persistence", "PrivilegeEscalation", "Execution"],
                "techniques": ["T1489", "T1543", "T1053", "T1574", "T1059", "T1047"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000232",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}