{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000000')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000000')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation informational 00",
                "description": "Sigma Windows Process Creation informational 00",
                "severity": "informational",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\attrib.exe\" or TargetProcessFilename =~ \"ATTRIB.EXE\") and TargetProcessCommandLine contains \" +s \")|extend RuleId=\"bb19e94c-59ae-4c15-8c12-c563d23fe52b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_attrib_system.yml\"|extend RuleTitle=\"Set Files as System Files Using Attrib.EXE\"|extend RuleDescription=\"Detects the execution of \"attrib\" with the \"+s\" flag to mark files as system files\";\nlet q1=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\clip.exe\" or TargetProcessFilename =~ \"clip.exe\")|extend RuleId=\"ddeff553-5233-4ae9-bbab-d64d2bd634be\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_clip_execution.yml\"|extend RuleTitle=\"Data Copied To Clipboard Via Clip.EXE\"|extend RuleDescription=\"Detects the execution of clip.exe in order to copy data to the clipboard. Adversaries may collect data stored in the clipboard from users copying information within or between applications.\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessFilename =~ \"Cmd.Exe\") and TargetProcessCommandLine contains \"assoc\")|extend RuleId=\"3d3aa6cd-6272-44d6-8afc-7e88dfef7061\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmd_assoc_execution.yml\"|extend RuleTitle=\"Change Default File Association Via Assoc\"|extend RuleDescription=\"Detects file association changes using the builtin \"assoc\" command.\nWhen a file is opened, the default program used to open the file (also called the file association or handler) is checked. File association selections are stored in the Windows Registry and can be edited by users, administrators, or programs that have Registry access or by administrators using the built-in assoc utility. Applications can modify the file association for a given file extension to call an arbitrary program when a file with the given extension is opened.\n\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessFilename =~ \"Cmd.Exe\") and (TargetProcessCommandLine contains \"del \" or TargetProcessCommandLine contains \"erase \") and (TargetProcessCommandLine contains \" /f\" or TargetProcessCommandLine contains \" /s\" or TargetProcessCommandLine contains \" /q\"))|extend RuleId=\"379fa130-190e-4c3f-b7bc-6c8e834485f3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmd_del_execution.yml\"|extend RuleTitle=\"File Deletion Via Del\"|extend RuleDescription=\"Detects execution of the builtin \"del\"/\"erase\" commands in order to delete files.\nAdversaries may delete files left behind by the actions of their intrusion activity.\nMalware, tools, or other non-native files dropped or created on a system by an adversary may leave traces to indicate to what was done within a network and how.\nRemoval of these files can occur during an intrusion, or as part of a post-intrusion process to minimize the adversary's footprint.\n\";\nlet q4=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"dir \" and TargetProcessCommandLine contains \" /s\" and TargetProcessCommandLine contains \" /b\")|extend RuleId=\"7c9340a9-e2ee-4e43-94c5-c54ebbea1006\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmd_dir_execution.yml\"|extend RuleTitle=\"Files And Subdirectories Listing Using Dir\"|extend RuleDescription=\"Detects usage of the \"dir\" command that is part of Windows batch/cmd to collect information about directories\";\nlet q5=_Im_ProcessCreate\n| where (((TargetProcessFilename =~ \"Cmd.Exe\" or TargetProcessName endswith \"\\\\cmd.exe\") and TargetProcessCommandLine contains \">\") and (not((TargetProcessCommandLine contains \"C:\\\\Program Files (x86)\\\\Internet Download Manager\\\\IDMMsgHost.exe\" or TargetProcessCommandLine contains \"chrome-extension://\" or TargetProcessCommandLine contains \"\\\\.\\\\pipe\\\\chrome.nativeMessaging\"))))|extend RuleId=\"4f4eaa9f-5ad4-410c-a4be-bc6132b0175a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmd_redirect.yml\"|extend RuleTitle=\"CMD Shell Output Redirect\"|extend RuleDescription=\"Detects the use of the redirection character \">\" to redicrect information in commandline\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessFilename =~ \"Cmd.Exe\") and TargetProcessCommandLine contains \"rmdir\" and (TargetProcessCommandLine contains \"/s\" or TargetProcessCommandLine contains \"/q\"))|extend RuleId=\"41ca393d-538c-408a-ac27-cf1e038be80c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmd_rmdir_execution.yml\"|extend RuleTitle=\"Directory Removal Via Rmdir\"|extend RuleDescription=\"Detects execution of the builtin \"rmdir\" command in order to delete directories.\nAdversaries may delete files left behind by the actions of their intrusion activity.\nMalware, tools, or other non-native files dropped or created on a system by an adversary may leave traces to indicate to what was done within a network and how.\nRemoval of these files can occur during an intrusion, or as part of a post-intrusion process to minimize the adversary's footprint.\n\";\nlet q7=_Im_ProcessCreate\n| where (TargetProcessFilename =~ \"DirLister.exe\" or TargetProcessName endswith \"\\\\dirlister.exe\")|extend RuleId=\"b4dc61f5-6cce-468e-a608-b48b469feaa2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_dirlister_execution.yml\"|extend RuleTitle=\"DirLister Execution\"|extend RuleDescription=\"Detect the usage of \"DirLister.exe\" a utility for quickly listing folder or drive contents. It was seen used by BlackCat ransomware to create a list of accessible directories and files.\";\nlet q8=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\explorer.exe\" and ActingProcessName endswith \"\\\\cmd.exe\" and TargetProcessCommandLine contains \"explorer.exe\")|extend RuleId=\"9eb271b9-24ae-4cd4-9465-19cfc1047f3e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_explorer_lolbin_execution.yml\"|extend RuleTitle=\"Proxy Execution Via Explorer.exe\"|extend RuleDescription=\"Attackers can use explorer.exe for evading defense mechanisms\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\fsutil.exe\" or TargetProcessFilename =~ \"fsutil.exe\") and TargetProcessCommandLine contains \"drives\")|extend RuleId=\"63de06b9-a385-40b5-8b32-73f2b9ef84b6\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_fsutil_drive_enumeration.yml\"|extend RuleTitle=\"Fsutil Drive Enumeration\"|extend RuleDescription=\"Attackers may leverage fsutil to enumerated connected drives.\";\nlet q10=_Im_ProcessCreate\n| where TargetProcessName endswith \"\\\\HOSTNAME.EXE\"|extend RuleId=\"7be5fb68-f9ef-476d-8b51-0256ebece19e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hostname_execution.yml\"|extend RuleTitle=\"Suspicious Execution of Hostname\"|extend RuleDescription=\"Use of hostname to get information\";\nlet q11=_Im_ProcessCreate\n| where ActingProcessName endswith \"\\\\pcwrun.exe\"|extend RuleId=\"b97cd4b1-30b8-4a9d-bd72-6293928d52bc\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_pcwrun.yml\"|extend RuleTitle=\"Indirect Command Execution By Program Compatibility Wizard\"|extend RuleDescription=\"Detect indirect command execution via Program Compatibility Assistant pcwrun.exe\";\nlet q12=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\mstsc.exe\" or TargetProcessFilename =~ \"mstsc.exe\") and (TargetProcessCommandLine endswith \".rdp\" or TargetProcessCommandLine endswith \".rdp\\\"\")) and (not((ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\lxss\\\\wslhost.exe\" and TargetProcessCommandLine contains \"C:\\\\ProgramData\\\\Microsoft\\\\WSL\\\\wslg.rdp\"))))|extend RuleId=\"5fdce3ac-e7f9-4ecd-a3aa-a4d78ebbf0af\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_mstsc_run_local_rdp_file.yml\"|extend RuleTitle=\"Mstsc.EXE Execution With Local RDP File\"|extend RuleDescription=\"Detects potential RDP connection via Mstsc using a local \".rdp\" file\";\nlet q13=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\netsh.exe\" or TargetProcessFilename =~ \"netsh.exe\") and ((TargetProcessCommandLine contains \"netsh \" and TargetProcessCommandLine contains \"show \" and TargetProcessCommandLine contains \"firewall \") and (TargetProcessCommandLine contains \"config \" or TargetProcessCommandLine contains \"state \" or TargetProcessCommandLine contains \"rule \" or TargetProcessCommandLine contains \"name=all\")))|extend RuleId=\"0e4164da-94bc-450d-a7be-a4b176179f1f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_netsh_fw_rules_discovery.yml\"|extend RuleTitle=\"Suspicious Firewall Configuration Discovery Via Netsh.EXE\"|extend RuleDescription=\"Adversaries may look for details about the network configuration and settings of systems they access or through information discovery of remote systems\";\nlet q14=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") or (TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\")) and ((TargetProcessCommandLine endswith \" use\" or TargetProcessCommandLine endswith \" sessions\") or (TargetProcessCommandLine contains \" use \" or TargetProcessCommandLine contains \" sessions \")))|extend RuleId=\"1c67a717-32ba-409b-a45d-0fb704a73a81\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_network_connections_discovery.yml\"|extend RuleTitle=\"System Network Connections Discovery Via Net.EXE\"|extend RuleDescription=\"Adversaries may attempt to get a listing of network connections to or from the compromised system they are currently accessing or from remote systems by querying for information over the network.\";\nlet q15=_Im_ProcessCreate\n| where ((((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") or (TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\")) and TargetProcessCommandLine contains \"view\") and (not(TargetProcessCommandLine contains \"\\\\\\\\\")))|extend RuleId=\"62510e69-616b-4078-b371-847da438cc03\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_share_and_sessions_enum.yml\"|extend RuleTitle=\"Share And Session Enumeration Using Net.EXE\"|extend RuleDescription=\"Detects attempts to enumerate file shares, printer shares and sessions using \"net.exe\" with the \"view\" flag.\";\nlet q16=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") or (TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\")) and (TargetProcessCommandLine contains \"share\" and TargetProcessCommandLine contains \"/delete\"))|extend RuleId=\"cb7c4a03-2871-43c0-9bbb-18bbdb079896\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_share_unmount.yml\"|extend RuleTitle=\"Unmount Share Via Net.EXE\"|extend RuleDescription=\"Detects when when a mounted share is removed. Adversaries may remove share connections that are no longer useful in order to clean up traces of their operation\";\nlet q17=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") or (TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\")) and TargetProcessCommandLine contains \" start \")|extend RuleId=\"2a072a96-a086-49fa-bcb5-15cc5a619093\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_start_service.yml\"|extend RuleTitle=\"Start Windows Service Via Net.EXE\"|extend RuleDescription=\"Detects the usage of the \"net.exe\" command to start a service using the \"start\" flag\";\nlet q18=_Im_ProcessCreate\n| where (((TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\") or (TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\")) and TargetProcessCommandLine contains \" stop \")|extend RuleId=\"88872991-7445-4a22-90b2-a3adadb0e827\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_stop_service.yml\"|extend RuleTitle=\"Stop Windows Service Via Net.EXE\"|extend RuleDescription=\"Detects the stopping of a Windows service\";\nlet q19=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") or (TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\")) and (TargetProcessCommandLine contains \" group\" or TargetProcessCommandLine contains \" localgroup\" or TargetProcessCommandLine contains \" user\" or TargetProcessCommandLine contains \" view\" or TargetProcessCommandLine contains \" share\" or TargetProcessCommandLine contains \" accounts\" or TargetProcessCommandLine contains \" stop \" or TargetProcessCommandLine contains \" start\"))|extend RuleId=\"183e7ea8-ac4b-4c23-9aec-b3dac4e401ac\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_susp_execution.yml\"|extend RuleTitle=\"Net.exe Execution\"|extend RuleDescription=\"Detects execution of Net.exe, whether suspicious or benign.\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Impact", "LateralMovement", "Collection", "Execution", "PrivilegeEscalation", "DefenseEvasion", "CommandAndControl", "Persistence", "Discovery"],
                "techniques": ["T1219", "T1087", "T1120", "T1546", "T1201", "T1217", "T1083", "T1049", "T1489", "T1070", "T1069", "T1569", "T1564", "T1021", "T1115", "T1082", "T1016", "T1218", "T1135", "T1007", "T1018"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000000",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}