{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A5163A120')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A5163A120')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 20",
                "description": "Sigma Windows Process Creation low 20",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\wsl\\.exe\" or ActingProcessName endswith \"\\\\wslhost\\.exe\") and ((TargetProcessName endswith \"\\\\calc\\.exe\" or TargetProcessName endswith \"\\\\cmd\\.exe\" or TargetProcessName endswith \"\\\\cscript\\.exe\" or TargetProcessName endswith \"\\\\mshta\\.exe\" or TargetProcessName endswith \"\\\\powershell\\.exe\" or TargetProcessName endswith \"\\\\pwsh\\.exe\" or TargetProcessName endswith \"\\\\regsvr32\\.exe\" or TargetProcessName endswith \"\\\\rundll32\\.exe\" or TargetProcessName endswith \"\\\\wscript\\.exe\") or (TargetProcessName contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or TargetProcessName contains \"C:\\\\Users\\\\Public\\\\\" or TargetProcessName contains \"C:\\\\Windows\\\\Temp\\\\\" or TargetProcessName contains \"C:\\\\Temp\\\\\" or TargetProcessName contains \"\\\\Downloads\\\\\" or TargetProcessName contains \"\\\\Desktop\\\\\")))|extend RuleId=\"5163A000-5160-5160-5160-5163A5163A119\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wsl_child_processes_anomalies.yml\";\nlet q1=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\wsl\\.exe\" or TargetProcessFilename =~ \"wsl\\.exe\") and (TargetProcessCommandLine contains \" -e \" or TargetProcessCommandLine contains \" --exec\" or TargetProcessCommandLine contains \" --system\" or TargetProcessCommandLine contains \" --shell-type \" or TargetProcessCommandLine contains \" /mnt/c\" or TargetProcessCommandLine contains \" --user root\" or TargetProcessCommandLine contains \" -u root\" or TargetProcessCommandLine contains \"--debug-shell\")) and (not((ActingProcessName endswith \"\\\\cmd\\.exe\" and (TargetProcessCommandLine contains \" -d \" and TargetProcessCommandLine contains \" -e kill \")))))|extend RuleId=\"dec44ca7-61ad-493c-bfd7-8819c5faa09b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wsl_lolbin_execution.yml\";\nlet q2=_Im_ProcessCreate\n| where (TargetProcessName matches regex \"[a-zA-Z]:\\\\\\\\\" and TargetProcessCurrentDirectory contains \"\\\\\\\\wsl\\.localhost\")|extend RuleId=\"ed825c86-c009-4014-b413-b76003e33d35\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wsl_windows_binaries_execution.yml\";\nlet q3=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\wusa\\.exe\" and TargetProcessCommandLine contains \"/extract:\")|extend RuleId=\"59b39960-5f9d-4a49-9cef-1e4d2c1d0cb9\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wusa_cab_files_extraction.yml\";\nunion q0, q1, q2, q3;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Execution", "DefenseEvasion"],
                "techniques": ["T1202", "T1218"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A5163A120",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}