{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000226')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000226')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation high 26",
                "description": "Sigma Windows Process Creation medium 26",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\sdiagnhost\\.exe\" and (TargetProcessName endswith \"\\\\powershell\\.exe\" or TargetProcessName endswith \"\\\\pwsh\\.exe\" or TargetProcessName endswith \"\\\\cmd\\.exe\" or TargetProcessName endswith \"\\\\mshta\\.exe\" or TargetProcessName endswith \"\\\\cscript\\.exe\" or TargetProcessName endswith \"\\\\wscript\\.exe\" or TargetProcessName endswith \"\\\\taskkill\\.exe\" or TargetProcessName endswith \"\\\\regsvr32\\.exe\" or TargetProcessName endswith \"\\\\rundll32\\.exe\" or TargetProcessName endswith \"\\\\calc\\.exe\"))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000225\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sdiagnhost_susp_child.yml\";\nlet q1=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\Serv-U\\.exe\" and (TargetProcessName endswith \"\\\\cmd\\.exe\" or TargetProcessName endswith \"\\\\powershell\\.exe\" or TargetProcessName endswith \"\\\\pwsh\\.exe\" or TargetProcessName endswith \"\\\\wscript\\.exe\" or TargetProcessName endswith \"\\\\cscript\\.exe\" or TargetProcessName endswith \"\\\\sh\\.exe\" or TargetProcessName endswith \"\\\\bash\\.exe\" or TargetProcessName endswith \"\\\\schtasks\\.exe\" or TargetProcessName endswith \"\\\\regsvr32\\.exe\" or TargetProcessName endswith \"\\\\wmic\\.exe\" or TargetProcessName endswith \"\\\\mshta\\.exe\" or TargetProcessName endswith \"\\\\rundll32\\.exe\" or TargetProcessName endswith \"\\\\msiexec\\.exe\" or TargetProcessName endswith \"\\\\forfiles\\.exe\" or TargetProcessName endswith \"\\\\scriptrunner\\.exe\"))|extend RuleId=\"58f4ea09-0fc2-4520-ba18-b85c540b0eaf\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_servu_susp_child_process.yml\";\nlet q2=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\splwow64\\.exe\" and TargetProcessCommandLine endswith \"splwow64\\.exe\")|extend RuleId=\"1f1a8509-2cbb-44f5-8751-8e1571518ce2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_splwow64_cli_anomaly.yml\";\nlet q3=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\spoolsv\\.exe\" and TargetProcessIntegrityLevel =~ \"System\") and ((TargetProcessName endswith \"\\\\gpupdate\\.exe\" or TargetProcessName endswith \"\\\\whoami\\.exe\" or TargetProcessName endswith \"\\\\nltest\\.exe\" or TargetProcessName endswith \"\\\\taskkill\\.exe\" or TargetProcessName endswith \"\\\\wmic\\.exe\" or TargetProcessName endswith \"\\\\taskmgr\\.exe\" or TargetProcessName endswith \"\\\\sc\\.exe\" or TargetProcessName endswith \"\\\\findstr\\.exe\" or TargetProcessName endswith \"\\\\curl\\.exe\" or TargetProcessName endswith \"\\\\wget\\.exe\" or TargetProcessName endswith \"\\\\certutil\\.exe\" or TargetProcessName endswith \"\\\\bitsadmin\\.exe\" or TargetProcessName endswith \"\\\\accesschk\\.exe\" or TargetProcessName endswith \"\\\\wevtutil\\.exe\" or TargetProcessName endswith \"\\\\bcdedit\\.exe\" or TargetProcessName endswith \"\\\\fsutil\\.exe\" or TargetProcessName endswith \"\\\\cipher\\.exe\" or TargetProcessName endswith \"\\\\schtasks\\.exe\" or TargetProcessName endswith \"\\\\write\\.exe\" or TargetProcessName endswith \"\\\\wuauclt\\.exe\" or TargetProcessName endswith \"\\\\systeminfo\\.exe\" or TargetProcessName endswith \"\\\\reg\\.exe\" or TargetProcessName endswith \"\\\\query\\.exe\") or ((TargetProcessName endswith \"\\\\net\\.exe\" or TargetProcessName endswith \"\\\\net1\\.exe\") and (not(TargetProcessCommandLine contains \"start\"))) or (TargetProcessName endswith \"\\\\cmd\\.exe\" and (not((TargetProcessCommandLine contains \"\\.spl\" or TargetProcessCommandLine contains \"route add\" or TargetProcessCommandLine contains \"program files\")))) or (TargetProcessName endswith \"\\\\netsh\\.exe\" and (not((TargetProcessCommandLine contains \"add portopening\" or TargetProcessCommandLine contains \"rule name\")))) or ((TargetProcessName endswith \"\\\\powershell\\.exe\" or TargetProcessName endswith \"\\\\pwsh\\.exe\") and (not(TargetProcessCommandLine contains \"\\.spl\"))) or ((TargetProcessName endswith \"\\\\rundll32\\.exe\" or TargetProcessFilename =~ \"RUNDLL32\\.EXE\") and TargetProcessCommandLine endswith \"rundll32\\.exe\")))|extend RuleId=\"dcdbc940-0bff-46b2-95f3-2d73f848e33b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_spoolsv_susp_child_processes.yml\";\nlet q4=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\sqlcmd\\.exe\" and (TargetProcessCommandLine contains \"SELECT\" and TargetProcessCommandLine contains \"TOP\" and TargetProcessCommandLine contains \"[VeeamBackup]\\.[dbo]\\.[Credentials]\"))|extend RuleId=\"b57ba453-b384-4ab9-9f40-1038086b4e53\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sqlcmd_veeam_dump.yml\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessFileProduct =~ \"SQLite\" or (TargetProcessName endswith \"\\\\sqlite\\.exe\" or TargetProcessName endswith \"\\\\sqlite3\\.exe\")) and (TargetProcessCommandLine contains \"\\\\User Data\\\\\" or TargetProcessCommandLine contains \"\\\\Opera Software\\\\\" or TargetProcessCommandLine contains \"\\\\ChromiumViewer\\\\\") and (TargetProcessCommandLine contains \"Login Data\" or TargetProcessCommandLine contains \"Cookies\" or TargetProcessCommandLine contains \"Web Data\" or TargetProcessCommandLine contains \"History\" or TargetProcessCommandLine contains \"Bookmarks\"))|extend RuleId=\"24c77512-782b-448a-8950-eddb0785fc71\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sqlite_chromium_profile_data.yml\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessFileProduct =~ \"SQLite\" or (TargetProcessName endswith \"\\\\sqlite\\.exe\" or TargetProcessName endswith \"\\\\sqlite3\\.exe\")) and (TargetProcessCommandLine contains \"cookies\\.sqlite\" or TargetProcessCommandLine contains \"places\\.sqlite\"))|extend RuleId=\"4833155a-4053-4c9c-a997-777fcea0baa7\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sqlite_firefox_gecko_profile_data.yml\";\nlet q7=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\ssh\\.exe\" and TargetProcessCommandLine contains \" -R \")|extend RuleId=\"327f48c1-a6db-4eb8-875a-f6981f1b0183\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_ssh_port_forward.yml\";\nlet q8=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\ssh\\.exe\" and TargetProcessCommandLine contains \":3389\")|extend RuleId=\"f7d7ebd5-a016-46e2-9c54-f9932f2d386d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_ssh_rdp_tunneling.yml\";\nlet q9=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\stordiag\\.exe\" and (TargetProcessName endswith \"\\\\schtasks\\.exe\" or TargetProcessName endswith \"\\\\systeminfo\\.exe\" or TargetProcessName endswith \"\\\\fltmc\\.exe\")) and (not((ActingProcessName startswith \"c:\\\\windows\\\\system32\\\\\" or ActingProcessName startswith \"c:\\\\windows\\\\syswow64\\\\\"))))|extend RuleId=\"961e0abb-1b1e-4c84-a453-aafe56ad0d34\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_stordiag_susp_child_process.yml\";\nlet q10=_Im_ProcessCreate\n| where ((((ActingProcessName endswith \"\\\\winlogon\\.exe\" or ActingProcessName endswith \"\\\\services\\.exe\" or ActingProcessName endswith \"\\\\lsass\\.exe\" or ActingProcessName endswith \"\\\\csrss\\.exe\" or ActingProcessName endswith \"\\\\smss\\.exe\" or ActingProcessName endswith \"\\\\wininit\\.exe\" or ActingProcessName endswith \"\\\\spoolsv\\.exe\" or ActingProcessName endswith \"\\\\searchindexer\\.exe\") and (TargetUsername contains \"AUTHORI\" or TargetUsername contains \"AUTORI\")) and ((TargetProcessName endswith \"\\\\powershell\\.exe\" or TargetProcessName endswith \"\\\\pwsh\\.exe\" or TargetProcessName endswith \"\\\\cmd\\.exe\") or (TargetProcessFilename =~ \"PowerShell\\.EXE\" or TargetProcessFilename =~ \"pwsh\\.dll\" or TargetProcessFilename =~ \"Cmd\\.Exe\"))) and (not((TargetProcessCommandLine contains \" route \" and TargetProcessCommandLine contains \" ADD \"))))|extend RuleId=\"d522eca2-2973-4391-a3e0-ef0374321dae\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_abusing_debug_privilege.yml\";\nlet q11=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \"localgroup \" and TargetProcessCommandLine contains \" /add\") or (TargetProcessCommandLine contains \"Add-LocalGroupMember \" and TargetProcessCommandLine contains \" -Group \")) and (TargetProcessCommandLine contains \"Remote Desktop Users\" or TargetProcessCommandLine contains \"Utilisateurs du Bureau \u00e0 distance\" or TargetProcessCommandLine contains \"Usuarios de escritorio remoto\"))|extend RuleId=\"ffa28e60-bdb1-46e0-9f82-05f7a61cc06e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_add_user_remote_desktop_group.yml\";\nlet q12=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\Winrar\\.exe\" or ActingProcessName endswith \"\\\\7zFM\\.exe\" or ActingProcessName endswith \"\\\\peazip\\.exe\") and (TargetProcessName endswith \"\\\\isoburn\\.exe\" or TargetProcessName endswith \"\\\\PowerISO\\.exe\" or TargetProcessName endswith \"\\\\ImgBurn\\.exe\"))|extend RuleId=\"fcdf69e5-a3d3-452a-9724-26f2308bf2b1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_archiver_iso_phishing.yml\";\nlet q13=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\WerFault\\.exe\" and TargetProcessCommandLine endswith \"WerFault\\.exe\") or (TargetProcessName endswith \"\\\\rundll32\\.exe\" and TargetProcessCommandLine endswith \"rundll32\\.exe\") or (TargetProcessName endswith \"\\\\regsvcs\\.exe\" and TargetProcessCommandLine endswith \"regsvcs\\.exe\") or (TargetProcessName endswith \"\\\\regasm\\.exe\" and TargetProcessCommandLine endswith \"regasm\\.exe\") or (TargetProcessName endswith \"\\\\regsvr32\\.exe\" and TargetProcessCommandLine endswith \"regsvr32\\.exe\")) and (not((ActingProcessName startswith \"C:\\\\Users\\\\\" and ActingProcessName contains \"\\\\AppData\\\\Local\\\\Microsoft\\\\EdgeUpdate\\\\Install\\\\{\" and ActingProcessName endswith \"\\\\setup\\.exe\" and ActingProcessCommandLine contains \"\\\\setup\\.exe\\\" --install-archive=\\\"C:\\\\Users\\\\\"))))|extend RuleId=\"a7c3d773-caef-227e-a7e7-c2f13c622329\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_bad_opsec_sacrificial_processes.yml\";\nlet q14=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"\\\\calc\\.exe \" or (TargetProcessName endswith \"\\\\calc\\.exe\" and (not((TargetProcessName startswith \"C:\\\\Windows\\\\System32\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\SysWOW64\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\WinSxS\\\\\")))))|extend RuleId=\"737e618a-a410-49b5-bec3-9e55ff7fbc15\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_calc.yml\";\nlet q15=_Im_ProcessCreate\n| where (((ParentUser contains \"AUTHORI\" or ParentUser contains \"AUTORI\") and (ParentUser endswith \"\\\\NETWORK SERVICE\" or ParentUser endswith \"\\\\LOCAL SERVICE\") and (TargetUsername contains \"AUTHORI\" or TargetUsername contains \"AUTORI\") and (TargetUsername endswith \"\\\\SYSTEM\" or TargetUsername endswith \"\\\\Syst\u00e8me\" or TargetUsername endswith \"\\\\\u0421\u0418\u0421\u0422\u0415\u041c\u0410\") and TargetProcessIntegrityLevel =~ \"System\") and (not((TargetProcessName endswith \"\\\\rundll32\\.exe\" and TargetProcessCommandLine contains \"DavSetCookie\"))))|extend RuleId=\"590a5f4c-6c8c-4f10-8307-89afe9453a9d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_child_process_as_system_.yml\";\nlet q16=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"\u02e3\" or TargetProcessCommandLine contains \"\u02ea\" or TargetProcessCommandLine contains \"\u02e2\") or (TargetProcessCommandLine contains \"\u2215\" or TargetProcessCommandLine contains \"\u2044\") or (TargetProcessCommandLine contains \"\u2015\" or TargetProcessCommandLine contains \"\u2014\") or (TargetProcessCommandLine contains \"\u00e2\" or TargetProcessCommandLine contains \"\u20ac\" or TargetProcessCommandLine contains \"\u00a3\" or TargetProcessCommandLine contains \"\u00af\" or TargetProcessCommandLine contains \"\u00ae\" or TargetProcessCommandLine contains \"\u00b5\" or TargetProcessCommandLine contains \"\u00b6\"))|extend RuleId=\"e0552b19-5a83-4222-b141-b36184bb8d79\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_cli_obfuscation_unicode.yml\";\nlet q17=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \"\\\\\\\\\" and TargetProcessCommandLine contains \"$\") or TargetProcessCommandLine contains \"\\\\Sysvol\\\\\") and (((TargetProcessName endswith \"\\\\robocopy\\.exe\" or TargetProcessName endswith \"\\\\xcopy\\.exe\") or (TargetProcessFilename =~ \"robocopy\\.exe\" or TargetProcessFilename =~ \"XCOPY\\.EXE\")) or ((TargetProcessName endswith \"\\\\cmd\\.exe\" or TargetProcessFilename =~ \"Cmd\\.Exe\") and TargetProcessCommandLine contains \"copy\") or (((TargetProcessName contains \"\\\\powershell\\.exe\" or TargetProcessName contains \"\\\\pwsh\\.exe\") or (TargetProcessFilename =~ \"PowerShell\\.EXE\" or TargetProcessFilename =~ \"pwsh\\.dll\")) and (TargetProcessCommandLine contains \"copy-item\" or TargetProcessCommandLine contains \"copy \" or TargetProcessCommandLine contains \"cpi \" or TargetProcessCommandLine contains \" cp \" or TargetProcessCommandLine contains \"move \" or TargetProcessCommandLine contains \"move-item\" or TargetProcessCommandLine contains \" mi \" or TargetProcessCommandLine contains \" mv \"))))|extend RuleId=\"855bc8b5-2ae8-402e-a9ed-b889e6df1900\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_copy_lateral_movement.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Exfiltration", "InitialAccess", "Collection", "CredentialAccess", "CommandAndControl", "Persistence", "Execution", "PrivilegeEscalation", "LateralMovement", "DefenseEvasion"],
                "techniques": ["T1572", "T1555", "T1048", "T1039", "T1136", "T1134", "T1027", "T1202", "T1566", "T1133", "T1548", "T1203", "T1218", "T1036", "T1539", "T1068", "T1021", "T1005"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000226",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}