{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000215')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000215')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 15",
                "description": "Sigma Windows Process Creation medium 15",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and TargetProcessCommandLine contains \" hidden \" and (TargetProcessCommandLine contains \"AGkAdABzAGEAZABtAGkAbgAgAC8AdAByAGEAbgBzAGYAZQByA\" or TargetProcessCommandLine contains \"aXRzYWRtaW4gL3RyYW5zZmVy\" or TargetProcessCommandLine contains \"IAaQB0AHMAYQBkAG0AaQBuACAALwB0AHIAYQBuAHMAZgBlAHIA\" or TargetProcessCommandLine contains \"JpdHNhZG1pbiAvdHJhbnNmZX\" or TargetProcessCommandLine contains \"YgBpAHQAcwBhAGQAbQBpAG4AIAAvAHQAcgBhAG4AcwBmAGUAcg\" or TargetProcessCommandLine contains \"Yml0c2FkbWluIC90cmFuc2Zlc\" or TargetProcessCommandLine contains \"AGMAaAB1AG4AawBfAHMAaQB6AGUA\" or TargetProcessCommandLine contains \"JABjAGgAdQBuAGsAXwBzAGkAegBlA\" or TargetProcessCommandLine contains \"JGNodW5rX3Npem\" or TargetProcessCommandLine contains \"QAYwBoAHUAbgBrAF8AcwBpAHoAZQ\" or TargetProcessCommandLine contains \"RjaHVua19zaXpl\" or TargetProcessCommandLine contains \"Y2h1bmtfc2l6Z\" or TargetProcessCommandLine contains \"AE8ALgBDAG8AbQBwAHIAZQBzAHMAaQBvAG4A\" or TargetProcessCommandLine contains \"kATwAuAEMAbwBtAHAAcgBlAHMAcwBpAG8Abg\" or TargetProcessCommandLine contains \"lPLkNvbXByZXNzaW9u\" or TargetProcessCommandLine contains \"SQBPAC4AQwBvAG0AcAByAGUAcwBzAGkAbwBuA\" or TargetProcessCommandLine contains \"SU8uQ29tcHJlc3Npb2\" or TargetProcessCommandLine contains \"Ty5Db21wcmVzc2lvb\" or TargetProcessCommandLine contains \"AE8ALgBNAGUAbQBvAHIAeQBTAHQAcgBlAGEAbQ\" or TargetProcessCommandLine contains \"kATwAuAE0AZQBtAG8AcgB5AFMAdAByAGUAYQBtA\" or TargetProcessCommandLine contains \"lPLk1lbW9yeVN0cmVhb\" or TargetProcessCommandLine contains \"SQBPAC4ATQBlAG0AbwByAHkAUwB0AHIAZQBhAG0A\" or TargetProcessCommandLine contains \"SU8uTWVtb3J5U3RyZWFt\" or TargetProcessCommandLine contains \"Ty5NZW1vcnlTdHJlYW\" or TargetProcessCommandLine contains \"4ARwBlAHQAQwBoAHUAbgBrA\" or TargetProcessCommandLine contains \"5HZXRDaHVua\" or TargetProcessCommandLine contains \"AEcAZQB0AEMAaAB1AG4Aaw\" or TargetProcessCommandLine contains \"LgBHAGUAdABDAGgAdQBuAGsA\" or TargetProcessCommandLine contains \"LkdldENodW5r\" or TargetProcessCommandLine contains \"R2V0Q2h1bm\" or TargetProcessCommandLine contains \"AEgAUgBFAEEARABfAEkATgBGAE8ANgA0A\" or TargetProcessCommandLine contains \"QASABSAEUAQQBEAF8ASQBOAEYATwA2ADQA\" or TargetProcessCommandLine contains \"RIUkVBRF9JTkZPNj\" or TargetProcessCommandLine contains \"SFJFQURfSU5GTzY0\" or TargetProcessCommandLine contains \"VABIAFIARQBBAEQAXwBJAE4ARgBPADYANA\" or TargetProcessCommandLine contains \"VEhSRUFEX0lORk82N\" or TargetProcessCommandLine contains \"AHIAZQBhAHQAZQBSAGUAbQBvAHQAZQBUAGgAcgBlAGEAZA\" or TargetProcessCommandLine contains \"cmVhdGVSZW1vdGVUaHJlYW\" or TargetProcessCommandLine contains \"MAcgBlAGEAdABlAFIAZQBtAG8AdABlAFQAaAByAGUAYQBkA\" or TargetProcessCommandLine contains \"NyZWF0ZVJlbW90ZVRocmVhZ\" or TargetProcessCommandLine contains \"Q3JlYXRlUmVtb3RlVGhyZWFk\" or TargetProcessCommandLine contains \"QwByAGUAYQB0AGUAUgBlAG0AbwB0AGUAVABoAHIAZQBhAGQA\" or TargetProcessCommandLine contains \"0AZQBtAG0AbwB2AGUA\" or TargetProcessCommandLine contains \"1lbW1vdm\" or TargetProcessCommandLine contains \"AGUAbQBtAG8AdgBlA\" or TargetProcessCommandLine contains \"bQBlAG0AbQBvAHYAZQ\" or TargetProcessCommandLine contains \"bWVtbW92Z\" or TargetProcessCommandLine contains \"ZW1tb3Zl\"))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000214\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_hidden_b64_cmd.yml\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessFilename =~ \"pwsh.dll\") and (TargetProcessCommandLine contains \"Set-Service \" and TargetProcessCommandLine contains \"DCLCWPDTSD\") and (TargetProcessCommandLine contains \"-SecurityDescriptorSddl \" or TargetProcessCommandLine contains \"-sd \"))|extend RuleId=\"514e4c3a-c77d-4cde-a00f-046425e2301e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_hide_services_via_set_service.yml\";\nlet q2=_Im_ProcessCreate\n| where ((((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") and (TargetProcessCommandLine contains \" | iex;\" or TargetProcessCommandLine contains \" | iex \" or TargetProcessCommandLine contains \" | iex}\" or TargetProcessCommandLine contains \" | IEX ;\" or TargetProcessCommandLine contains \" | IEX -Error\" or TargetProcessCommandLine contains \" | IEX (new\" or TargetProcessCommandLine contains \");IEX \")) and (TargetProcessCommandLine contains \"::FromBase64String\" or TargetProcessCommandLine contains \".GetString([System.Convert]::\")) or (TargetProcessCommandLine contains \")|iex;$\" or TargetProcessCommandLine contains \");iex($\" or TargetProcessCommandLine contains \");iex $\" or TargetProcessCommandLine contains \" | IEX | \"))|extend RuleId=\"09576804-7a05-458e-a817-eb718ca91f54\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_iex_patterns.yml\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"Import-Certificate\" and TargetProcessCommandLine contains \" -FilePath \" and TargetProcessCommandLine contains \"Cert:\\\\LocalMachine\\\\Root\") and (TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\TEMP\\\\\" or TargetProcessCommandLine contains \"\\\\Desktop\\\\\" or TargetProcessCommandLine contains \"\\\\Downloads\\\\\" or TargetProcessCommandLine contains \"\\\\Perflogs\\\\\" or TargetProcessCommandLine contains \":\\\\Users\\\\Public\\\\\"))|extend RuleId=\"5f6a601c-2ecb-498b-9c33-660362323afa\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_import_cert_susp_locations.yml\";\nlet q4=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and (TargetProcessCommandLine contains \"curl \" or TargetProcessCommandLine contains \"Invoke-WebRequest\" or TargetProcessCommandLine contains \"iwr \" or TargetProcessCommandLine contains \"wget \") and (TargetProcessCommandLine contains \" -ur\" or TargetProcessCommandLine contains \" -o\") and (TargetProcessCommandLine contains \"\\\\AppData\\\\\" or TargetProcessCommandLine contains \"\\\\Desktop\\\\\" or TargetProcessCommandLine contains \"\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \"%AppData%\" or TargetProcessCommandLine contains \"%Public%\" or TargetProcessCommandLine contains \"%Temp%\" or TargetProcessCommandLine contains \"%tmp%\" or TargetProcessCommandLine contains \"C:\\\\Windows\\\\\"))|extend RuleId=\"5e3cc4d8-3e68-43db-8656-eaaeefdec9cc\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_invoke_webrequest_download.yml\";\nunion q0, q1, q2, q3, q4;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "PrivilegeEscalation", "CommandAndControl", "Execution", "Persistence"],
                "techniques": ["T1059", "T1553", "T1574", "T1105"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000215",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}