{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000112')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000112')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation low 12",
                "description": "Sigma Windows Process Creation low 12",
                "severity": "low",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\reg.exe\" and (TargetProcessCommandLine contains \"add \" and TargetProcessCommandLine contains \"SYSTEM\\\\CurrentControlSet\\\\Services\\\\\" and TargetProcessCommandLine contains \" ImagePath \")) and (TargetProcessCommandLine contains \" /d \" or TargetProcessCommandLine contains \" -d \"))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000111\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_service_imagepath_change.yml\";\nlet q1=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\reg.exe\" and (TargetProcessCommandLine contains \"query\" and TargetProcessCommandLine contains \"\\\\software\\\\\" and TargetProcessCommandLine contains \"/v\" and TargetProcessCommandLine contains \"svcversion\"))|extend RuleId=\"e13f668e-7f95-443d-98d2-1816a7648a7b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_software_discovery.yml\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"reg add\" and TargetProcessCommandLine contains \"\\\\system\\\\currentcontrolset\\\\control\" and TargetProcessCommandLine contains \"write protection\" and TargetProcessCommandLine contains \"0\") and (TargetProcessCommandLine contains \"storage\" or TargetProcessCommandLine contains \"storagedevicepolicies\"))|extend RuleId=\"75f7a0e2-7154-4c4d-9eae-5cdb4e0a5c13\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_write_protect_for_storage_disabled.yml\";\nlet q3=_Im_ProcessCreate\n| where (TargetProcessFileProduct =~ \"UltraViewer\" or TargetProcessFileCompany =~ \"DucFabulous Co,ltd\" or TargetProcessFilename =~ \"UltraViewer_Desktop.exe\")|extend RuleId=\"88656cec-6c3b-487c-82c0-f73ebb805503\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_remote_access_software_ultraviewer.yml\";\nlet q4=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\AnyDesk.exe\" or TargetProcessFileDescription =~ \"AnyDesk\" or TargetProcessFileProduct =~ \"AnyDesk\" or TargetProcessFileCompany =~ \"AnyDesk Software GmbH\")|extend RuleId=\"b52e84a3-029e-4529-b09b-71d19dd27e94\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_remote_access_tools_anydesk.yml\";\nlet q5=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"/c \" and TargetProcessCommandLine contains \"echo \" and TargetProcessCommandLine contains \".exe --set-password\")|extend RuleId=\"b1377339-fda6-477a-b455-ac0923f9ec2c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_remote_access_tools_anydesk_piped_password_via_cli.yml\";\nlet q6=_Im_ProcessCreate\n| where (TargetProcessFileDescription =~ \"GoTo Opener\" or TargetProcessFileProduct =~ \"GoTo Opener\" or TargetProcessFileCompany =~ \"LogMeIn, Inc.\")|extend RuleId=\"b6d98a4f-cef0-4abf-bbf6-24132854a83d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_remote_access_tools_gotoopener.yml\";\nlet q7=_Im_ProcessCreate\n| where (TargetProcessFileDescription =~ \"LMIGuardianSvc\" or TargetProcessFileProduct =~ \"LMIGuardianSvc\" or TargetProcessFileCompany =~ \"LogMeIn, Inc.\")|extend RuleId=\"d85873ef-a0f8-4c48-a53a-6b621f11729d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_remote_access_tools_logmein.yml\";\nlet q8=_Im_ProcessCreate\n| where (TargetProcessFileDescription =~ \"NetSupport Client Configurator\" or TargetProcessFileProduct =~ \"NetSupport Remote Control\" or TargetProcessFileCompany =~ \"NetSupport Ltd\" or TargetProcessFilename =~ \"PCICFGUI.EXE\")|extend RuleId=\"758ff488-18d5-4cbe-8ec4-02b6285a434f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_remote_access_tools_netsupport.yml\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\client32.exe\" or TargetProcessFileProduct contains \"NetSupport Remote Control\" or TargetProcessFilename contains \"client32.exe\" or TargetProcessIMPHASH =~ \"a9d50692e95b79723f3e76fcf70d023e\" or Hashes contains \"IMPHASH=a9d50692e95b79723f3e76fcf70d023e\") and (not((TargetProcessName startswith \"C:\\\\Program Files\\\\\" or TargetProcessName startswith \"C:\\\\Program Files (x86)\\\\\"))))|extend RuleId=\"37e8d358-6408-4853-82f4-98333fca7014\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_remote_access_tools_netsupport_susp_exec.yml\";\nlet q10=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\rutserv.exe\" or TargetProcessName endswith \"\\\\rfusclient.exe\") or TargetProcessFileProduct =~ \"Remote Utilities\") and (not((TargetProcessName startswith \"C:\\\\Program Files\\\\Remote Utilities\" or TargetProcessName startswith \"C:\\\\Program Files (x86)\\\\Remote Utilities\"))))|extend RuleId=\"e01fa958-6893-41d4-ae03-182477c5e77d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_remote_access_tools_rurat_non_default_location.yml\";\nlet q11=_Im_ProcessCreate\n| where (TargetProcessFileDescription =~ \"ScreenConnect Service\" or TargetProcessFileProduct =~ \"ScreenConnect\" or TargetProcessFileCompany =~ \"ScreenConnect Software\")|extend RuleId=\"57bff678-25d1-4d6c-8211-8ca106d12053\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_remote_access_tools_screenconnect.yml\";\nlet q12=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\ScreenConnect.ClientService.exe\" and (TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessFilename =~ \"Cmd.Exe\") and TargetProcessCommandLine contains \"\\\\TEMP\\\\ScreenConnect\\\\\")|extend RuleId=\"b1f73849-6329-4069-bc8f-78a604bb8b23\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_remote_access_tools_screenconnect_remote_exec.yml\";\nlet q13=_Im_ProcessCreate\n| where ((TargetProcessFileProduct contains \"AutoHotkey\" or TargetProcessFileDescription contains \"AutoHotkey\" or (TargetProcessFilename =~ \"AutoHotkey.exe\" or TargetProcessFilename =~ \"AutoHotkey.rc\")) and (not(((TargetProcessName endswith \"\\\\AutoHotkey.exe\" or TargetProcessName endswith \"\\\\AutoHotkey32.exe\" or TargetProcessName endswith \"\\\\AutoHotkey32_UIA.exe\" or TargetProcessName endswith \"\\\\AutoHotkey64.exe\" or TargetProcessName endswith \"\\\\AutoHotkey64_UIA.exe\" or TargetProcessName endswith \"\\\\AutoHotkeyA32.exe\" or TargetProcessName endswith \"\\\\AutoHotkeyA32_UIA.exe\" or TargetProcessName endswith \"\\\\AutoHotkeyU32.exe\" or TargetProcessName endswith \"\\\\AutoHotkeyU32_UIA.exe\" or TargetProcessName endswith \"\\\\AutoHotkeyU64.exe\" or TargetProcessName endswith \"\\\\AutoHotkeyU64_UIA.exe\") or TargetProcessName contains \"\\\\AutoHotkey\"))))|extend RuleId=\"0f16d9cf-0616-45c8-8fad-becc11b5a41c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_autohotkey.yml\";\nlet q14=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"Cmd.Exe\" or TargetProcessFilename =~ \"CONHOST.EXE\" or TargetProcessFilename =~ \"7z.exe\" or TargetProcessFilename =~ \"WinRAR.exe\" or TargetProcessFilename =~ \"wevtutil.exe\" or TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\" or TargetProcessFilename =~ \"netsh.exe\" or TargetProcessFilename =~ \"InstallUtil.exe\") and (not((TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\conhost.exe\" or TargetProcessName endswith \"\\\\7z.exe\" or TargetProcessName endswith \"\\\\WinRAR.exe\" or TargetProcessName endswith \"\\\\wevtutil.exe\" or TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\" or TargetProcessName endswith \"\\\\netsh.exe\" or TargetProcessName endswith \"\\\\InstallUtil.exe\"))))|extend RuleId=\"36480ae1-a1cb-4eaa-a0d6-29801d7e9142\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_binary.yml\";\nlet q15=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"curl.exe\" or TargetProcessFileDescription =~ \"The curl executable\") and (not(TargetProcessName contains \"\\\\curl\")))|extend RuleId=\"7530cd3d-7671-43e3-b209-976966f6ea48\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_curl.yml\";\nlet q16=_Im_ProcessCreate\n| where (TargetProcessFilename =~ \"ftp.exe\" and (not(TargetProcessName endswith \"\\\\ftp.exe\")))|extend RuleId=\"277a4393-446c-449a-b0ed-7fdc7795244c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_ftp.yml\";\nlet q17=_Im_ProcessCreate\n| where (TargetProcessFilename =~ \"Microsoft.NodejsTools.PressAnyKey.exe\" and (not(TargetProcessName endswith \"\\\\Microsoft.NodejsTools.PressAnyKey.exe\")))|extend RuleId=\"65c3ca2c-525f-4ced-968e-246a713d164f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_pressanykey.yml\";\nlet q18=_Im_ProcessCreate\n| where (TargetProcessFileProduct =~ \"Remote Utilities\" and (not((TargetProcessName endswith \"\\\\rutserv.exe\" or TargetProcessName endswith \"\\\\rfusclient.exe\"))))|extend RuleId=\"9ef27c24-4903-4192-881a-3adde7ff92a5\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_rurat.yml\";\nlet q19=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\rpcping.exe\" and (TargetProcessCommandLine contains \"-s\" or TargetProcessCommandLine contains \"/s\") and ((TargetProcessCommandLine contains \"-u\" and TargetProcessCommandLine contains \"NTLM\") or (TargetProcessCommandLine contains \"/u\" and TargetProcessCommandLine contains \"NTLM\") or (TargetProcessCommandLine contains \"-t\" and TargetProcessCommandLine contains \"ncacn_np\") or (TargetProcessCommandLine contains \"/t\" and TargetProcessCommandLine contains \"ncacn_np\")))|extend RuleId=\"93671f99-04eb-4ab4-a161-70d446a84003\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rpcping_credential_capture.yml\";\nlet q20=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\ruby.exe\" or TargetProcessFilename =~ \"ruby.exe\") and TargetProcessCommandLine contains \" -e\")|extend RuleId=\"20a5ffa1-3848-4584-b6f8-c7c7fd9f69c8\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_ruby_inline_command_execution.yml\";\nlet q21=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessFilename =~ \"RUNDLL32.EXE\") and TargetProcessCommandLine contains \"InstallScreenSaver\")|extend RuleId=\"15bd98ea-55f4-4d37-b09a-e7caa0fa2221\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_installscreensaver.yml\";\nlet q22=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessFilename =~ \"RUNDLL32.EXE\" or TargetProcessCommandLine contains \"rundll32\") and (TargetProcessCommandLine contains \"#+\" or TargetProcessCommandLine contains \"#-\"))|extend RuleId=\"43fa5350-db63-4b8f-9a01-789a427074e1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_obfuscated_ordinal_call.yml\";\nlet q23=_Im_ProcessCreate\n| where ((ActingProcessName endswith \"\\\\explorer.exe\" and (TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessFilename =~ \"RUNDLL32.EXE\")) and (not((TargetProcessCommandLine contains \" C:\\\\Windows\\\\System32\\\\\" or TargetProcessCommandLine endswith \" -localserver 22d8c27b-47a1-48d1-ad08-7da7abd79617\"))))|extend RuleId=\"1723e720-616d-4ddc-ab02-f7e3685a4713\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_parent_explorer.yml\";\nlet q24=_Im_ProcessCreate\n| where ((TargetProcessName contains \":\\\\RECYCLER\\\\\" or TargetProcessName contains \":\\\\SystemVolumeInformation\\\\\") or (TargetProcessName startswith \"C:\\\\Windows\\\\Tasks\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\debug\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\fonts\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\help\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\drivers\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\addins\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\cursors\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\system32\\\\tasks\\\\\"))|extend RuleId=\"15b75071-74cc-47e0-b4c6-b43744a62a2b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_run_locations.yml\";\nlet q25=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"rundll32\" and (TargetProcessCommandLine contains \"mshtml,RunHTMLApplication\" or TargetProcessCommandLine contains \"mshtml,#135\") and (TargetProcessCommandLine contains \"javascript:\" or TargetProcessCommandLine contains \"vbscript:\"))|extend RuleId=\"73fcad2e-ff14-4c38-b11d-4172c8ac86c7\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_script_run.yml\";\nlet q26=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\runonce.exe\" and ActingProcessName endswith \"\\\\rundll32.exe\" and (ActingProcessCommandLine contains \"setupapi.dll\" and ActingProcessCommandLine contains \"InstallHinfSection\"))|extend RuleId=\"285b85b1-a555-4095-8652-a8a4106af63f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_setupapi_installhinfsection.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19, q20, q21, q22, q23, q24, q25, q26;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Collection", "DefenseEvasion", "CredentialAccess", "CommandAndControl", "Discovery", "Execution", "Persistence"],
                "techniques": ["T1219", "T1562", "T1518", "T1059", "T1202", "T1218", "T1003", "T1574", "T1036"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000112",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}