{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-4c76-45a9-804d-dc3f355f2019')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-4c76-45a9-804d-dc3f355f2019')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation high 019",
                "description": "Sigma Windows Process Creation high 019",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\provlaunch.exe\" and ((TargetProcessName endswith \"\\\\calc.exe\" or TargetProcessName endswith \"\\\\cmd.exe\" or TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\notepad.exe\" or TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessName endswith \"\\\\rundll32.exe\" or TargetProcessName endswith \"\\\\wscript.exe\") or (TargetProcessName contains \":\\\\PerfLogs\\\\\" or TargetProcessName contains \":\\\\Temp\\\\\" or TargetProcessName contains \":\\\\Users\\\\Public\\\\\" or TargetProcessName contains \"\\\\AppData\\\\Temp\\\\\" or TargetProcessName contains \"\\\\Windows\\\\System32\\\\Tasks\\\\\" or TargetProcessName contains \"\\\\Windows\\\\Tasks\\\\\" or TargetProcessName contains \"\\\\Windows\\\\Temp\\\\\")))|extend RuleId=\"f9999590-1f94-4a34-a91e-951e47bedefd\";\nlet q1=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\3proxy.exe\" or TargetProcessFileDescription =~ \"3proxy - tiny proxy server\" or TargetProcessCommandLine contains \".exe -i127.0.0.1 -p\")|extend RuleId=\"f38a82d2-fba3-4781-b549-525efbec8506\";\nlet q2=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"lockoutduration\" or TargetProcessCommandLine contains \"lockoutthreshold\" or TargetProcessCommandLine contains \"lockoutobservationwindow\" or TargetProcessCommandLine contains \"maxpwdage\" or TargetProcessCommandLine contains \"minpwdage\" or TargetProcessCommandLine contains \"minpwdlength\" or TargetProcessCommandLine contains \"pwdhistorylength\" or TargetProcessCommandLine contains \"pwdproperties\") or TargetProcessCommandLine contains \"-sc admincountdmp\" or TargetProcessCommandLine contains \"-sc exchaddresses\")|extend RuleId=\"455b9d50-15a1-4b99-853f-8d37655a4c1b\";\nlet q3=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"domainlist\" or TargetProcessCommandLine contains \"trustdmp\" or TargetProcessCommandLine contains \"dcmodes\" or TargetProcessCommandLine contains \"adinfo\" or TargetProcessCommandLine contains \" dclist \" or TargetProcessCommandLine contains \"computer_pwdnotreqd\" or TargetProcessCommandLine contains \"objectcategory=\" or TargetProcessCommandLine contains \"-subnets -f\" or TargetProcessCommandLine contains \"name=\\\"Domain Admins\\\"\" or TargetProcessCommandLine contains \"-sc u:\" or TargetProcessCommandLine contains \"domainncs\" or TargetProcessCommandLine contains \"dompol\" or TargetProcessCommandLine contains \" oudmp \" or TargetProcessCommandLine contains \"subnetdmp\" or TargetProcessCommandLine contains \"gpodmp\" or TargetProcessCommandLine contains \"fspdmp\" or TargetProcessCommandLine contains \"users_noexpire\" or TargetProcessCommandLine contains \"computers_active\" or TargetProcessCommandLine contains \"computers_pwdnotreqd\")|extend RuleId=\"9a132afa-654e-11eb-ae93-0242ac130002\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"/EXEFilename\" or TargetProcessCommandLine contains \"/CommandLine\") and ((TargetProcessCommandLine contains \" /RunAs 8 \" or TargetProcessCommandLine contains \" /RunAs 4 \" or TargetProcessCommandLine contains \" /RunAs 10 \" or TargetProcessCommandLine contains \" /RunAs 11 \") or (TargetProcessCommandLine endswith \"/RunAs 8\" or TargetProcessCommandLine endswith \"/RunAs 4\" or TargetProcessCommandLine endswith \"/RunAs 10\" or TargetProcessCommandLine endswith \"/RunAs 11\")))|extend RuleId=\"fa00b701-44c6-4679-994d-5a18afa8a707\";\nlet q5=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\chisel.exe\" or ((TargetProcessCommandLine contains \"exe client \" or TargetProcessCommandLine contains \"exe server \") and (TargetProcessCommandLine contains \"-socks5\" or TargetProcessCommandLine contains \"-reverse\" or TargetProcessCommandLine contains \" r:\" or TargetProcessCommandLine contains \":127.0.0.1:\" or TargetProcessCommandLine contains \"-tls-skip-verify \" or TargetProcessCommandLine contains \":socks\")))|extend RuleId=\"8b0e12da-d3c3-49db-bb4f-256703f380e5\";\nlet q6=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\SepRemovalToolNative_x64.exe\" or (TargetProcessName endswith \"\\\\CATClean.exe\" and TargetProcessCommandLine contains \"--uninstall\") or (TargetProcessName endswith \"\\\\NetInstaller.exe\" and TargetProcessCommandLine contains \"-r\") or (TargetProcessName endswith \"\\\\WFPUnins.exe\" and (TargetProcessCommandLine contains \"/uninstall\" and TargetProcessCommandLine contains \"/enterprise\")))|extend RuleId=\"f44800ac-38ec-471f-936e-3fa7d9c53100\";\nlet q7=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\Crassus.exe\" or TargetProcessFilename =~ \"Crassus.exe\" or TargetProcessFileDescription contains \"Crassus\")|extend RuleId=\"2c32b543-1058-4808-91c6-5b31b8bed6c5\";\nlet q8=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\csexec.exe\" or TargetProcessFileDescription =~ \"csexec\")|extend RuleId=\"d08a2711-ee8b-4323-bdec-b7d85e892b31\";\nlet q9=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\DefenderCheck.exe\" or TargetProcessFileDescription =~ \"DefenderCheck\")|extend RuleId=\"f0ca6c24-3225-47d5-b1f5-352bf07ecfa7\";\nlet q10=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\ditsnap.exe\" or TargetProcessCommandLine contains \"ditsnap.exe\")|extend RuleId=\"d3b70aad-097e-409c-9df2-450f80dc476b\";\nlet q11=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\frpc.exe\" or TargetProcessName endswith \"\\\\frps.exe\") or TargetProcessCommandLine contains \"\\\\frpc.ini\" or ((Hashes contains \"MD5=7D9C233B8C9E3F0EA290D2B84593C842\" or Hashes contains \"SHA1=06DDC9280E1F1810677935A2477012960905942F\" or Hashes contains \"SHA256=57B0936B8D336D8E981C169466A15A5FD21A7D5A2C7DAF62D5E142EE860E387C\") or md5 =~ \"7d9c233b8c9e3f0ea290d2b84593c842\" or sha1 =~ \"06ddc9280e1f1810677935a2477012960905942f\" or sha256 =~ \"57b0936b8d336d8e981c169466a15a5fd21a7d5a2c7daf62d5e142ee860e387c\"))|extend RuleId=\"32410e29-5f94-4568-b6a3-d91a8adad863\";\nlet q12=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\iox.exe\" or (TargetProcessCommandLine contains \".exe fwd -l \" or TargetProcessCommandLine contains \".exe fwd -r \" or TargetProcessCommandLine contains \".exe proxy -l \" or TargetProcessCommandLine contains \".exe proxy -r \") or ((Hashes contains \"MD5=9DB2D314DD3F704A02051EF5EA210993\" or Hashes contains \"SHA1=039130337E28A6623ECF9A0A3DA7D92C5964D8DD\" or Hashes contains \"SHA256=C6CF82919B809967D9D90EA73772A8AA1C1EB3BC59252D977500F64F1A0D6731\") or md5 =~ \"9db2d314dd3f704a02051ef5ea210993\" or sha1 =~ \"039130337e28a6623ecf9a0a3da7d92c5964d8dd\" or sha256 =~ \"c6cf82919b809967d9d90ea73772a8aa1c1eb3bc59252d977500f64f1a0d6731\"))|extend RuleId=\"d7654f02-e04b-4934-9838-65c46f187ebc\";\nlet q13=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\nc.exe\" or TargetProcessName endswith \"\\\\ncat.exe\" or TargetProcessName endswith \"\\\\netcat.exe\") or (TargetProcessCommandLine contains \" -lvp \" or TargetProcessCommandLine contains \" -lvnp\" or TargetProcessCommandLine contains \" -l -v -p \" or TargetProcessCommandLine contains \" -lv -p \" or TargetProcessCommandLine contains \" -l --proxy-type http \" or TargetProcessCommandLine contains \" -vnl --exec \" or TargetProcessCommandLine contains \" -vnl -e \" or TargetProcessCommandLine contains \" --lua-exec \" or TargetProcessCommandLine contains \" --sh-exec \"))|extend RuleId=\"e31033fc-33f0-4020-9a16-faf9b31cbf08\";\nlet q14=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \" tcp 139\" or TargetProcessCommandLine contains \" tcp 445\" or TargetProcessCommandLine contains \" tcp 3389\" or TargetProcessCommandLine contains \" tcp 5985\" or TargetProcessCommandLine contains \" tcp 5986\") or (TargetProcessCommandLine contains \" start \" and TargetProcessCommandLine contains \"--all\" and TargetProcessCommandLine contains \"--config\" and TargetProcessCommandLine contains \".yml\") or (TargetProcessName endswith \"ngrok.exe\" and (TargetProcessCommandLine contains \" tcp \" or TargetProcessCommandLine contains \" http \" or TargetProcessCommandLine contains \" authtoken \")) or (TargetProcessCommandLine contains \".exe authtoken \" or TargetProcessCommandLine contains \".exe start --all\"))|extend RuleId=\"ee37eb7c-a4e7-4cd5-8fa4-efa27f1c3f31\";\nlet q15=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\nimgrab.exe\" or (Hashes contains \"MD5=2DD44C3C29D667F5C0EF5F9D7C7FFB8B\" or Hashes contains \"SHA256=F266609E91985F0FE3E31C5E8FAEEEC4FFA5E0322D8B6F15FE69F4C5165B9559\" or Hashes contains \"IMPHASH=C07FDDD21D123EA9B3A08EEF44AAAC45\") or (md5 =~ \"2DD44C3C29D667F5C0EF5F9D7C7FFB8B\" or sha256 =~ \"F266609E91985F0FE3E31C5E8FAEEEC4FFA5E0322D8B6F15FE69F4C5165B9559\" or TargetProcessIMPHASH =~ \"C07FDDD21D123EA9B3A08EEF44AAAC45\"))|extend RuleId=\"74a12f18-505c-4114-8d0b-8448dd5485c6\";\nlet q16=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \" runassystem \"|extend RuleId=\"d9047477-0359-48c9-b8c7-792cedcdc9c4\";\nlet q17=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\nmap.exe\" or TargetProcessName endswith \"\\\\zennmap.exe\") or (TargetProcessFilename =~ \"nmap.exe\" or TargetProcessFilename =~ \"zennmap.exe\"))|extend RuleId=\"f6ecd1cf-19b8-4488-97f6-00f0924991a3\";\nlet q18=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\npc.exe\" or (TargetProcessCommandLine contains \" -server=\" and TargetProcessCommandLine contains \" -vkey=\" and TargetProcessCommandLine contains \" -password=\") or TargetProcessCommandLine contains \" -config=npc\" or ((Hashes contains \"MD5=AE8ACF66BFE3A44148964048B826D005\" or Hashes contains \"SHA1=CEA49E9B9B67F3A13AD0BE1C2655293EA3C18181\" or Hashes contains \"SHA256=5A456283392FFCEEEACA3D3426C306EB470304637520D72FED1CC1FEBBBD6856\") or md5 =~ \"ae8acf66bfe3a44148964048b826d005\" or sha1 =~ \"cea49e9b9b67f3a13ad0be1c2655293ea3c18181\" or sha256 =~ \"5a456283392ffceeeaca3d3426c306eb470304637520d72fed1cc1febbbd6856\"))|extend RuleId=\"68d37776-61db-42f5-bf54-27e87072d17e\";\nlet q19=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\NSudo.exe\" or TargetProcessName endswith \"\\\\NSudoLC.exe\" or TargetProcessName endswith \"\\\\NSudoLG.exe\") or (TargetProcessFilename =~ \"NSudo.exe\" or TargetProcessFilename =~ \"NSudoLC.exe\" or TargetProcessFilename =~ \"NSudoLG.exe\")) and (TargetProcessCommandLine contains \"-U:S \" or TargetProcessCommandLine contains \"-U:T \" or TargetProcessCommandLine contains \"-U:E \" or TargetProcessCommandLine contains \"-P:E \" or TargetProcessCommandLine contains \"-M:S \" or TargetProcessCommandLine contains \"-M:H \" or TargetProcessCommandLine contains \"-U=S \" or TargetProcessCommandLine contains \"-U=T \" or TargetProcessCommandLine contains \"-U=E \" or TargetProcessCommandLine contains \"-P=E \" or TargetProcessCommandLine contains \"-M=S \" or TargetProcessCommandLine contains \"-M=H \" or TargetProcessCommandLine contains \"-ShowWindowMode:Hide\"))|extend RuleId=\"771d1eb5-9587-4568-95fb-9ec44153a012\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["PrivilegeEscalation", "Discovery", "DefenseEvasion", "CommandAndControl", "Reconnaissance", "CredentialAccess", "ResourceDevelopment", "Execution"],
                "techniques": ["T1482", "T1087", "T1562", "T1105", "T1046", "T1090", "T1569", "T1218", "T1018", "T1587", "T1003", "T1590", "T1069", "T1134", "T1027", "T1572", "T1095"],
                "alertRuleTemplateName": "5163A000-4c76-45a9-804d-dc3f355f2019",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}