{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000222')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000222')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 22",
                "description": "Sigma Windows Process Creation medium 22",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") and (TargetProcessCommandLine contains \" -windowstyle h \" or TargetProcessCommandLine contains \" -windowstyl h\" or TargetProcessCommandLine contains \" -windowsty h\" or TargetProcessCommandLine contains \" -windowst h\" or TargetProcessCommandLine contains \" -windows h\" or TargetProcessCommandLine contains \" -windo h\" or TargetProcessCommandLine contains \" -wind h\" or TargetProcessCommandLine contains \" -win h\" or TargetProcessCommandLine contains \" -wi h\" or TargetProcessCommandLine contains \" -win h \" or TargetProcessCommandLine contains \" -win hi \" or TargetProcessCommandLine contains \" -win hid \" or TargetProcessCommandLine contains \" -win hidd \" or TargetProcessCommandLine contains \" -win hidde \" or TargetProcessCommandLine contains \" -NoPr \" or TargetProcessCommandLine contains \" -NoPro \" or TargetProcessCommandLine contains \" -NoProf \" or TargetProcessCommandLine contains \" -NoProfi \" or TargetProcessCommandLine contains \" -NoProfil \" or TargetProcessCommandLine contains \" -nonin \" or TargetProcessCommandLine contains \" -nonint \" or TargetProcessCommandLine contains \" -noninte \" or TargetProcessCommandLine contains \" -noninter \" or TargetProcessCommandLine contains \" -nonintera \" or TargetProcessCommandLine contains \" -noninterac \" or TargetProcessCommandLine contains \" -noninteract \" or TargetProcessCommandLine contains \" -noninteracti \" or TargetProcessCommandLine contains \" -noninteractiv \" or TargetProcessCommandLine contains \" -ec \" or TargetProcessCommandLine contains \" -encodedComman \" or TargetProcessCommandLine contains \" -encodedComma \" or TargetProcessCommandLine contains \" -encodedComm \" or TargetProcessCommandLine contains \" -encodedCom \" or TargetProcessCommandLine contains \" -encodedCo \" or TargetProcessCommandLine contains \" -encodedC \" or TargetProcessCommandLine contains \" -encoded \" or TargetProcessCommandLine contains \" -encode \" or TargetProcessCommandLine contains \" -encod \" or TargetProcessCommandLine contains \" -enco \" or TargetProcessCommandLine contains \" -en \" or TargetProcessCommandLine contains \" -executionpolic \" or TargetProcessCommandLine contains \" -executionpoli \" or TargetProcessCommandLine contains \" -executionpol \" or TargetProcessCommandLine contains \" -executionpo \" or TargetProcessCommandLine contains \" -executionp \" or TargetProcessCommandLine contains \" -execution bypass\" or TargetProcessCommandLine contains \" -executio bypass\" or TargetProcessCommandLine contains \" -executi bypass\" or TargetProcessCommandLine contains \" -execut bypass\" or TargetProcessCommandLine contains \" -execu bypass\" or TargetProcessCommandLine contains \" -exec bypass\" or TargetProcessCommandLine contains \" -exe bypass\" or TargetProcessCommandLine contains \" -ex bypass\" or TargetProcessCommandLine contains \" -ep bypass\" or TargetProcessCommandLine contains \" /windowstyle h \" or TargetProcessCommandLine contains \" /windowstyl h\" or TargetProcessCommandLine contains \" /windowsty h\" or TargetProcessCommandLine contains \" /windowst h\" or TargetProcessCommandLine contains \" /windows h\" or TargetProcessCommandLine contains \" /windo h\" or TargetProcessCommandLine contains \" /wind h\" or TargetProcessCommandLine contains \" /win h\" or TargetProcessCommandLine contains \" /wi h\" or TargetProcessCommandLine contains \" /win h \" or TargetProcessCommandLine contains \" /win hi \" or TargetProcessCommandLine contains \" /win hid \" or TargetProcessCommandLine contains \" /win hidd \" or TargetProcessCommandLine contains \" /win hidde \" or TargetProcessCommandLine contains \" /NoPr \" or TargetProcessCommandLine contains \" /NoPro \" or TargetProcessCommandLine contains \" /NoProf \" or TargetProcessCommandLine contains \" /NoProfi \" or TargetProcessCommandLine contains \" /NoProfil \" or TargetProcessCommandLine contains \" /nonin \" or TargetProcessCommandLine contains \" /nonint \" or TargetProcessCommandLine contains \" /noninte \" or TargetProcessCommandLine contains \" /noninter \" or TargetProcessCommandLine contains \" /nonintera \" or TargetProcessCommandLine contains \" /noninterac \" or TargetProcessCommandLine contains \" /noninteract \" or TargetProcessCommandLine contains \" /noninteracti \" or TargetProcessCommandLine contains \" /noninteractiv \" or TargetProcessCommandLine contains \" /ec \" or TargetProcessCommandLine contains \" /encodedComman \" or TargetProcessCommandLine contains \" /encodedComma \" or TargetProcessCommandLine contains \" /encodedComm \" or TargetProcessCommandLine contains \" /encodedCom \" or TargetProcessCommandLine contains \" /encodedCo \" or TargetProcessCommandLine contains \" /encodedC \" or TargetProcessCommandLine contains \" /encoded \" or TargetProcessCommandLine contains \" /encode \" or TargetProcessCommandLine contains \" /encod \" or TargetProcessCommandLine contains \" /enco \" or TargetProcessCommandLine contains \" /en \" or TargetProcessCommandLine contains \" /executionpolic \" or TargetProcessCommandLine contains \" /executionpoli \" or TargetProcessCommandLine contains \" /executionpol \" or TargetProcessCommandLine contains \" /executionpo \" or TargetProcessCommandLine contains \" /executionp \" or TargetProcessCommandLine contains \" /execution bypass\" or TargetProcessCommandLine contains \" /executio bypass\" or TargetProcessCommandLine contains \" /executi bypass\" or TargetProcessCommandLine contains \" /execut bypass\" or TargetProcessCommandLine contains \" /execu bypass\" or TargetProcessCommandLine contains \" /exec bypass\" or TargetProcessCommandLine contains \" /exe bypass\" or TargetProcessCommandLine contains \" /ex bypass\" or TargetProcessCommandLine contains \" /ep bypass\"))|extend RuleId=\"36210e0d-5b19-485d-a087-c096088885f0\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_susp_parameter_variation.yml\"|extend RuleTitle=\"Suspicious PowerShell Parameter Substring\"|extend RuleDescription=\"Detects suspicious PowerShell invocation with a parameter substring\";\nlet q1=_Im_ProcessCreate\n| where ((ActingProcessName contains \"tomcat\" or (ActingProcessName endswith \"\\\\amigo.exe\" or ActingProcessName endswith \"\\\\browser.exe\" or ActingProcessName endswith \"\\\\chrome.exe\" or ActingProcessName endswith \"\\\\firefox.exe\" or ActingProcessName endswith \"\\\\httpd.exe\" or ActingProcessName endswith \"\\\\iexplore.exe\" or ActingProcessName endswith \"\\\\jbosssvc.exe\" or ActingProcessName endswith \"\\\\microsoftedge.exe\" or ActingProcessName endswith \"\\\\microsoftedgecp.exe\" or ActingProcessName endswith \"\\\\MicrosoftEdgeSH.exe\" or ActingProcessName endswith \"\\\\mshta.exe\" or ActingProcessName endswith \"\\\\nginx.exe\" or ActingProcessName endswith \"\\\\outlook.exe\" or ActingProcessName endswith \"\\\\php-cgi.exe\" or ActingProcessName endswith \"\\\\regsvr32.exe\" or ActingProcessName endswith \"\\\\rundll32.exe\" or ActingProcessName endswith \"\\\\safari.exe\" or ActingProcessName endswith \"\\\\services.exe\" or ActingProcessName endswith \"\\\\sqlagent.exe\" or ActingProcessName endswith \"\\\\sqlserver.exe\" or ActingProcessName endswith \"\\\\sqlservr.exe\" or ActingProcessName endswith \"\\\\vivaldi.exe\" or ActingProcessName endswith \"\\\\w3wp.exe\")) and ((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessCommandLine contains \"/c powershell\" or TargetProcessCommandLine contains \"/c pwsh\") or TargetProcessFileDescription =~ \"Windows PowerShell\" or TargetProcessFileProduct =~ \"PowerShell Core 6\" or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")))|extend RuleId=\"754ed792-634f-40ae-b3bc-e0448d33f695\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_susp_parent_process.yml\"|extend RuleTitle=\"Suspicious PowerShell Parent Process\"|extend RuleDescription=\"Detects a suspicious or uncommon parent processes of PowerShell\";\nlet q2=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"powershell\" and TargetProcessCommandLine contains \".DownloadFile\" and TargetProcessCommandLine contains \"System.Net.WebClient\")|extend RuleId=\"8f70ac5f-1f6f-4f8e-b454-db19561216c5\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_susp_ps_downloadfile.yml\"|extend RuleTitle=\"PowerShell DownloadFile\"|extend RuleDescription=\"Detects the execution of powershell, a WebClient object creation and the invocation of DownloadFile in a single command line\";\nlet q3=_Im_ProcessCreate\n| where (TargetProcessCommandLine matches regex \"\\\\w+`(\\\\w+|-|.)`[\\\\w+|\\\\s]\" or TargetProcessCommandLine matches regex \"\"(\\\\{\\\\d\\\\})+\"\\\\s*-f\" or TargetProcessCommandLine matches regex \"\\\\$\\\\{((e|n|v)*`(e|n|v)*)+:path\\\\}|\\\\$\\\\{((e|n|v)*`(e|n|v)*)+:((p|a|t|h)*`(p|a|t|h)*)+\\\\}|\\\\$\\\\{env:((p|a|t|h)*`(p|a|t|h)*)+\\\\}\")|extend RuleId=\"deb9b646-a508-44ee-b7c9-d8965921c6b6\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_token_obfuscation.yml\"|extend RuleTitle=\"Powershell Token Obfuscation - Process Creation\"|extend RuleDescription=\"Detects TOKEN OBFUSCATION technique from Invoke-Obfuscation\";\nunion q0, q1, q2, q3;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["CommandAndControl", "DefenseEvasion", "Execution"],
                "techniques": ["T1059", "T1027", "T1104", "T1105"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000222",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}