{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000229')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000229')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 29",
                "description": "Sigma Windows Process Creation medium 29",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (TargetProcessName contains \":\\\\RECYCLERS.BIN\\\\\" or TargetProcessName contains \":\\\\RECYCLER.BIN\\\\\" or TargetProcessName contains \":\\\\RECYCLE.BIN\\\\\")|extend RuleId=\"5163A000-5160-5160-5160-5163A0000228\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_recycle_bin_fake_execution.yml\";\nlet q1=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \">\" and ([\"*\"] contains \"\\\\\\\\127.0.0.1\\\\admin$\\\\\" or [\"*\"] contains \"\\\\\\\\localhost\\\\admin$\\\\\"))|extend RuleId=\"ab9e3b40-0c85-4ba1-aede-455d226fd124\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_redirect_local_admin_share.yml\";\nlet q2=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"\u202e\"|extend RuleId=\"ad691d92-15f2-4181-9aa4-723c74f9ddc3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_right_to_left_override.yml\";\nlet q3=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\cscript.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\wscript.exe\") or (TargetProcessCommandLine contains \" -ep bypass \" or TargetProcessCommandLine contains \" -ExecutionPolicy bypass \" or TargetProcessCommandLine contains \" -w hidden \" or TargetProcessCommandLine contains \"/e:javascript \" or TargetProcessCommandLine contains \"/e:Jscript \" or TargetProcessCommandLine contains \"/e:vbscript \") or (TargetProcessFilename =~ \"cscript.exe\" or TargetProcessFilename =~ \"mshta.exe\" or TargetProcessFilename =~ \"wscript.exe\")) and ((TargetProcessCommandLine contains \":\\\\Perflogs\\\\\" or TargetProcessCommandLine contains \":\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\Temp\" or TargetProcessCommandLine contains \"\\\\Temporary Internet\" or TargetProcessCommandLine contains \"\\\\Windows\\\\Temp\") or ((TargetProcessCommandLine contains \":\\\\Users\\\\\" and TargetProcessCommandLine contains \"\\\\Favorites\\\\\") or (TargetProcessCommandLine contains \":\\\\Users\\\\\" and TargetProcessCommandLine contains \"\\\\Favourites\\\\\") or (TargetProcessCommandLine contains \":\\\\Users\\\\\" and TargetProcessCommandLine contains \"\\\\Contacts\\\\\"))))|extend RuleId=\"1228c958-e64e-4e71-92ad-7d429f4138ba\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_script_exec_from_env_folder.yml\";\nlet q4=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\" or TargetProcessName endswith \"\\\\mshta.exe\" or TargetProcessName endswith \"\\\\wscript.exe\" or TargetProcessName endswith \"\\\\cscript.exe\") and (TargetProcessCommandLine contains \"\\\\Windows\\\\Temp\" or TargetProcessCommandLine contains \"\\\\Temporary Internet\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\Temp\" or TargetProcessCommandLine contains \"%TEMP%\" or TargetProcessCommandLine contains \"%TMP%\" or TargetProcessCommandLine contains \"%LocalAppData%\\\\Temp\")) and (not((TargetProcessCommandLine contains \" >\" or TargetProcessCommandLine contains \"Out-File\" or TargetProcessCommandLine contains \"ConvertTo-Json\" or TargetProcessCommandLine contains \"-WindowStyle hidden -Verb runAs\" or TargetProcessCommandLine contains \"\\\\Windows\\\\system32\\\\config\\\\systemprofile\\\\AppData\\\\Local\\\\Temp\\\\Amazon\\\\EC2-Windows\\\\\"))))|extend RuleId=\"a6a39bdb-935c-4f0a-ab77-35f4bbf44d33\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_script_exec_from_temp.yml\";\nlet q5=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\sc.exe\" and (TargetProcessCommandLine contains \"create\" and TargetProcessCommandLine contains \"binPath=\")) or (TargetProcessCommandLine contains \"New-Service\" and TargetProcessCommandLine contains \"-BinaryPathName\")) and (TargetProcessCommandLine contains \"powershell\" or TargetProcessCommandLine contains \"mshta\" or TargetProcessCommandLine contains \"wscript\" or TargetProcessCommandLine contains \"cscript\" or TargetProcessCommandLine contains \"svchost\" or TargetProcessCommandLine contains \"dllhost\" or TargetProcessCommandLine contains \"cmd \" or TargetProcessCommandLine contains \"cmd.exe /c\" or TargetProcessCommandLine contains \"cmd.exe /k\" or TargetProcessCommandLine contains \"cmd.exe /r\" or TargetProcessCommandLine contains \"rundll32\" or TargetProcessCommandLine contains \"C:\\\\Users\\\\Public\" or TargetProcessCommandLine contains \"\\\\Downloads\\\\\" or TargetProcessCommandLine contains \"\\\\Desktop\\\\\" or TargetProcessCommandLine contains \"\\\\Microsoft\\\\Windows\\\\Start Menu\\\\Programs\\\\Startup\\\\\" or TargetProcessCommandLine contains \"C:\\\\Windows\\\\TEMP\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\"))|extend RuleId=\"17a1be64-8d88-40bf-b5ff-a4f7a50ebcc8\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_service_creation.yml\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessName contains \"\\\\Users\\\\Public\\\\\" or TargetProcessName contains \"\\\\$Recycle.bin\" or TargetProcessName contains \"\\\\Users\\\\All Users\\\\\" or TargetProcessName contains \"\\\\Users\\\\Default\\\\\" or TargetProcessName contains \"\\\\Users\\\\Contacts\\\\\" or TargetProcessName contains \"\\\\Users\\\\Searches\\\\\" or TargetProcessName contains \"C:\\\\Perflogs\\\\\" or TargetProcessName contains \"\\\\config\\\\systemprofile\\\\\" or TargetProcessName contains \"\\\\Windows\\\\Fonts\\\\\" or TargetProcessName contains \"\\\\Windows\\\\IME\\\\\" or TargetProcessName contains \"\\\\Windows\\\\addins\\\\\") and (ActingProcessName endswith \"\\\\services.exe\" or ActingProcessName endswith \"\\\\svchost.exe\"))|extend RuleId=\"883faa95-175a-4e22-8181-e5761aeb373c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_service_dir.yml\";\nunion q0, q1, q2, q3, q4, q5, q6;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "PrivilegeEscalation", "Exfiltration", "Execution", "Persistence"],
                "techniques": ["T1048", "T1543", "T1059", "T1036", "T1202"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000229",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}