{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000001')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000001')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation informational 01",
                "description": "Sigma Windows Process Creation informational 01",
                "severity": "informational",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") or (TargetProcessFilename =~ \"net.exe\" or TargetProcessFilename =~ \"net1.exe\")) and (TargetProcessCommandLine contains \" use \" or TargetProcessCommandLine contains \" \\\\\\\\\"))|extend RuleId=\"f117933c-980c-4f78-b384-e3d838111165\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_use_mount_share.yml\"|extend RuleTitle=\"Windows Share Mount Via Net.EXE\"|extend RuleDescription=\"Detects when a share is mounted using the \\\"net.exe\\\" utility\";\nlet q1=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\nltest.exe\" or TargetProcessFilename =~ \"nltestrk.exe\")|extend RuleId=\"903076ff-f442-475a-b667-4f246bcc203b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_nltest_execution.yml\"|extend RuleTitle=\"Nltest.EXE Execution\"|extend RuleDescription=\"Detects nltest commands that can be used for information discovery\";\nlet q2=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"New-Service\" and TargetProcessCommandLine contains \"-BinaryPathName\")|extend RuleId=\"c02e96b7-c63a-4c47-bd83-4a9f74afcfb2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_create_service.yml\"|extend RuleTitle=\"New Service Creation Using PowerShell\"|extend RuleDescription=\"Detects the creation of a new service using powershell.\";\nlet q3=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and (((TargetProcessCommandLine contains \"ToInt\" or TargetProcessCommandLine contains \"ToDecimal\" or TargetProcessCommandLine contains \"ToByte\" or TargetProcessCommandLine contains \"ToUint\" or TargetProcessCommandLine contains \"ToSingle\" or TargetProcessCommandLine contains \"ToSByte\") and (TargetProcessCommandLine contains \"ToChar\" or TargetProcessCommandLine contains \"ToString\" or TargetProcessCommandLine contains \"String\")) or ((TargetProcessCommandLine contains \"char\" and TargetProcessCommandLine contains \"join\") or (TargetProcessCommandLine contains \"split\" and TargetProcessCommandLine contains \"join\"))))|extend RuleId=\"cdf05894-89e7-4ead-b2b0-0a5f97a90f2f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_encoding_patterns.yml\"|extend RuleTitle=\"Potential Encoded PowerShell Patterns In CommandLine\"|extend RuleDescription=\"Detects specific combinations of encoding methods in PowerShell via the commandline\";\nlet q4=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and (not(((ActingProcessName endswith \":\\\\Windows\\\\explorer.exe\" or ActingProcessName endswith \":\\\\Windows\\\\System32\\\\CompatTelRunner.exe\" or ActingProcessName endswith \":\\\\Windows\\\\SysWOW64\\\\explorer.exe\") or ActingProcessName =~ \":\\\\$WINDOWS.~BT\\\\Sources\\\\SetupHost.exe\"))) and (not(((ActingProcessName endswith \"\\\\AppData\\\\Local\\\\Programs\\\\Microsoft VS Code\\\\Code.exe\" and ActingProcessCommandLine contains \" --ms-enable-electron-run-as-node \") or (ActingProcessName contains \":\\\\Program Files\\\\WindowsApps\\\\Microsoft.WindowsTerminal_\" and ActingProcessName endswith \"\\\\WindowsTerminal.exe\")))))|extend RuleId=\"f4bbd493-b796-416e-bbf2-121235348529\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_non_interactive_execution.yml\"|extend RuleTitle=\"Non Interactive PowerShell Process Spawned\"|extend RuleDescription=\"Detects non-interactive PowerShell activity by looking at the \\\"powershell\\\" process with a non-user GUI process such as \\\"explorer.exe\\\" as a parent.\";\nlet q5=_Im_ProcessCreate\n| where (((TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\") or (TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\")) and TargetProcessCommandLine contains \"Stop-Service \")|extend RuleId=\"c49c5062-0966-4170-9efd-9968c913a6cf\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_stop_service.yml\"|extend RuleTitle=\"Stop Windows Service Via PowerShell Stop-Service\"|extend RuleDescription=\"Detects the stopping of a Windows service\";\nlet q6=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\python.exe\" and TargetProcessCommandLine contains \"adidnsdump\")|extend RuleId=\"26d3f0a2-f514-4a3f-a8a7-e7e48a8d9160\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_python_adidnsdump.yml\"|extend RuleTitle=\"PUA - Adidnsdump Execution\"|extend RuleDescription=\"This tool enables enumeration and exporting of all DNS records in the zone for recon purposes of internal networks Python 3 and python.exe must be installed,\\nUsee to Query/modify DNS records for Active Directory integrated DNS via LDAP\\n\";\nlet q7=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\rar.exe\" and TargetProcessCommandLine contains \" a \")|extend RuleId=\"6f3e2987-db24-4c78-a860-b4f4095a7095\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rar_compress_data.yml\"|extend RuleTitle=\"Files Added To An Archive Using Rar.EXE\"|extend RuleDescription=\"Detects usage of \\\"rar\\\" to add files to an archive for potential compression. An adversary may compress data (e.g. sensitive documents) that is collected prior to exfiltration in order to make it portable and minimize the amount of data sent over the network.\";\nlet q8=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\regedit.exe\" or TargetProcessFilename =~ \"REGEDIT.EXE\") and (TargetProcessCommandLine contains \" /E \" or TargetProcessCommandLine contains \" -E \")) and (not(((TargetProcessCommandLine contains \"hklm\" or TargetProcessCommandLine contains \"hkey_local_machine\") and (TargetProcessCommandLine endswith \"\\\\system\" or TargetProcessCommandLine endswith \"\\\\sam\" or TargetProcessCommandLine endswith \"\\\\security\")))))|extend RuleId=\"f0e53e89-8d22-46ea-9db5-9d4796ee2f8a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_regedit_export_keys.yml\"|extend RuleTitle=\"Exports Registry Key To a File\"|extend RuleDescription=\"Detects the export of the target Registry key to a file.\";\nlet q9=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\regini.exe\" or TargetProcessFilename =~ \"REGINI.EXE\") and (not(TargetProcessCommandLine matches regex \":[^ \\\\\\\\]\")))|extend RuleId=\"5f60740a-f57b-4e76-82a1-15b6ff2cb134\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_regini_execution.yml\"|extend RuleTitle=\"Registry Modification Via Regini.EXE\"|extend RuleDescription=\"Detects the execution of regini.exe which can be used to modify registry keys, the changes are imported from one or more text files.\";\nlet q10=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\reg.exe\" and (TargetProcessCommandLine contains \"SOFTWARE\\\\Microsoft\\\\Cryptography\" and TargetProcessCommandLine contains \"/v \" and TargetProcessCommandLine contains \"MachineGuid\"))|extend RuleId=\"f5240972-3938-4e56-8e4b-e33893176c1f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_machineguid.yml\"|extend RuleTitle=\"Suspicious Query of MachineGUID\"|extend RuleDescription=\"Use of reg to get MachineGuid information\";\nlet q11=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") and TargetProcessCommandLine contains \"time\") or (TargetProcessName endswith \"\\\\w32tm.exe\" and TargetProcessCommandLine contains \"tz\"))|extend RuleId=\"b243b280-65fe-48df-ba07-6ddea7646427\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_remote_time_discovery.yml\"|extend RuleTitle=\"Discovery of a System Time\"|extend RuleDescription=\"Identifies use of various commands to query a systems time. This technique may be used before executing a scheduled task or to discover the time zone of a target system.\";\nlet q12=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\runonce.exe\" or TargetProcessFileDescription =~ \"Run Once Wrapper\") and (TargetProcessCommandLine contains \"/AlternateShellStartup\" or TargetProcessCommandLine endswith \"/r\"))|extend RuleId=\"198effb6-6c98-4d0c-9ea3-451fa143c45c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_runonce_execution.yml\"|extend RuleTitle=\"Run Once Task Execution as Configured in Registry\"|extend RuleDescription=\"This rule detects the execution of Run Once task as configured in the registry\";\nlet q13=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\schtasks.exe\" and TargetProcessCommandLine contains \" /create \") and (not((TargetUsername contains \"AUTHORI\" or TargetUsername contains \"AUTORI\"))))|extend RuleId=\"92626ddd-662c-49e3-ac59-f6535f12d189\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_schtasks_creation.yml\"|extend RuleTitle=\"Scheduled Task Creation\"|extend RuleDescription=\"Detects the creation of scheduled tasks in user session\";\nlet q14=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\sc.exe\" and (TargetProcessCommandLine contains \"create\" and TargetProcessCommandLine contains \"binPath\"))|extend RuleId=\"85ff530b-261d-48c6-a441-facaa2e81e48\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sc_create_service.yml\"|extend RuleTitle=\"New Service Creation Using Sc.EXE\"|extend RuleDescription=\"Detects the creation of a new service using the \\\"sc.exe\\\" utility.\";\nlet q15=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\sc.exe\" and TargetProcessFilename endswith \"sc.exe\") and TargetProcessCommandLine contains \" query\")|extend RuleId=\"57712d7a-679c-4a41-a913-87e7175ae429\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sc_query.yml\"|extend RuleTitle=\"SC.EXE Query Execution\"|extend RuleDescription=\"Detects execution of \\\"sc.exe\\\" to query information about registered services on the system\";\nlet q16=_Im_ProcessCreate\n| where (((TargetProcessFilename =~ \"sc.exe\" or TargetProcessName endswith \"\\\\sc.exe\") and TargetProcessCommandLine contains \" stop \") and (not(((TargetProcessCommandLine =~ \"sc  stop KSCWebConsoleMessageQueue\" or TargetProcessCommandLine =~ \"sc  stop LGHUBUpdaterService\") and (TargetUsername contains \"AUTHORI\" or TargetUsername contains \"AUTORI\")))))|extend RuleId=\"81bcb81b-5b1f-474b-b373-52c871aaa7b1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sc_stop_service.yml\"|extend RuleTitle=\"Stop Windows Service Via Sc.EXE\"|extend RuleDescription=\"Detects the stopping of a Windows service\";\nlet q17=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\cmd.exe\" and (TargetProcessCommandLine contains \" /c\" and TargetProcessCommandLine contains \"dir \" and TargetProcessCommandLine contains \"\\\\Users\\\\\")) and (not(TargetProcessCommandLine contains \" rmdir \"))) or (((TargetProcessName endswith \"\\\\net.exe\" or TargetProcessName endswith \"\\\\net1.exe\") and TargetProcessCommandLine contains \"user\") and (not((TargetProcessCommandLine contains \"/domain\" or TargetProcessCommandLine contains \"/add\" or TargetProcessCommandLine contains \"/delete\" or TargetProcessCommandLine contains \"/active\" or TargetProcessCommandLine contains \"/expires\" or TargetProcessCommandLine contains \"/passwordreq\" or TargetProcessCommandLine contains \"/scriptpath\" or TargetProcessCommandLine contains \"/times\" or TargetProcessCommandLine contains \"/workstations\")))) or ((TargetProcessName endswith \"\\\\whoami.exe\" or TargetProcessName endswith \"\\\\quser.exe\" or TargetProcessName endswith \"\\\\qwinsta.exe\") or (TargetProcessName endswith \"\\\\wmic.exe\" and (TargetProcessCommandLine contains \"useraccount\" and TargetProcessCommandLine contains \"get\")) or (TargetProcessName endswith \"\\\\cmdkey.exe\" and TargetProcessCommandLine contains \" /l\")))|extend RuleId=\"502b42de-4306-40b4-9596-6f590c81f073\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_local_system_owner_account_discovery.yml\"|extend RuleTitle=\"Local Accounts Discovery\"|extend RuleDescription=\"Local accounts, System Owner/User discovery using operating systems utilities\";\nlet q18=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"ipconfig /all\" or TargetProcessCommandLine contains \"netsh interface show interface\" or TargetProcessCommandLine contains \"arp -a\" or TargetProcessCommandLine contains \"nbtstat -n\" or TargetProcessCommandLine contains \"net config\" or TargetProcessCommandLine contains \"route print\")|extend RuleId=\"a29c1813-ab1f-4dde-b489-330b952e91ae\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_network_command.yml\"|extend RuleTitle=\"Suspicious Network Command\"|extend RuleDescription=\"Adversaries may look for details about the network configuration and settings of systems they access or through information discovery of remote systems\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "Execution", "LateralMovement", "Impact", "Persistence", "Collection", "Exfiltration", "Discovery", "PrivilegeEscalation"],
                "techniques": ["T1059", "T1560", "T1082", "T1033", "T1087", "T1124", "T1489", "T1016", "T1012", "T1482", "T1112", "T1053", "T1027", "T1018", "T1543", "T1021", "T1007"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000001",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}