{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000111')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000111')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation low 11",
                "description": "Sigma Windows Process Creation low 11",
                "severity": "low",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\rcedit-x64.exe\" or TargetProcessName endswith \"\\\\rcedit-x86.exe\") or TargetProcessFileDescription =~ \"Edit resources of exe\" or TargetProcessFileProduct =~ \"rcedit\") and TargetProcessCommandLine contains \"--set-\" and (TargetProcessCommandLine contains \"OriginalFileName\" or TargetProcessCommandLine contains \"CompanyName\" or TargetProcessCommandLine contains \"FileDescription\" or TargetProcessCommandLine contains \"ProductName\" or TargetProcessCommandLine contains \"ProductVersion\" or TargetProcessCommandLine contains \"LegalCopyright\"))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000110\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_rcedit_execution.yml\"|extend RuleTitle=\"PUA - Potential PE Metadata Tamper Using Rcedit\"|extend RuleDescription=\"Detects the use of rcedit to potentially alter executable PE metadata properties, which could conceal efforts to rename system utilities for defense evasion.\";\nlet q1=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\SystemInformer.exe\" or TargetProcessFilename =~ \"SystemInformer.exe\" or TargetProcessFileDescription =~ \"System Informer\" or TargetProcessFileProduct =~ \"System Informer\") or (TargetProcessIMPHASH=~\"MD5=19426363A37C03C3ED6FEDF57B6696EC\" or TargetProcessIMPHASH=~\"SHA1=8B12C6DA8FAC0D5E8AB999C31E5EA04AF32D53DC\" or TargetProcessIMPHASH=~\"SHA256=8EE9D84DE50803545937A63C686822388A3338497CDDB660D5D69CF68B68F287\" or TargetProcessIMPHASH=~\"B68908ADAEB5D662F87F2528AF318F12\") or (md5 =~ \"19426363A37C03C3ED6FEDF57B6696EC\" or sha1 =~ \"8B12C6DA8FAC0D5E8AB999C31E5EA04AF32D53DC\" or sha256 =~ \"8EE9D84DE50803545937A63C686822388A3338497CDDB660D5D69CF68B68F287\" or TargetProcessIMPHASH =~ \"B68908ADAEB5D662F87F2528AF318F12\"))|extend RuleId=\"5722dff1-4bdd-4949-86ab-fbaf707e767a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_system_informer.yml\";\nlet q2=_Im_ProcessCreate\n| where (TargetProcessFileDescription =~ \"Web Browser Password Viewer\" or TargetProcessName endswith \"\\\\WebBrowserPassView.exe\")|extend RuleId=\"d0dae994-26c6-4d2d-83b5-b3c8b79ae513\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_webbrowserpassview.yml\";\nlet q3=_Im_ProcessCreate\n| where (((TargetProcessFilename =~ \"python.exe\" or (TargetProcessName endswith \"python.exe\" or TargetProcessName endswith \"python3.exe\" or TargetProcessName endswith \"python2.exe\")) and TargetProcessCommandLine contains \" -c\") and (not(((ActingProcessName startswith \"C:\\\\Program Files\\\\Python\" and ActingProcessName endswith \"\\\\python.exe\" and ActingProcessCommandLine contains \"-E -s -m ensurepip -U --default-pip\") or ActingProcessName endswith \"\\\\AppData\\\\Local\\\\Programs\\\\Microsoft VS Code\\\\Code.exe\"))))|extend RuleId=\"899133d5-4d7c-4a7f-94ee-27355c879d90\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_python_inline_command_execution.yml\";\nlet q4=_Im_ProcessCreate\n| where (TargetProcessName endswith \":\\\\Windows\\\\System32\\\\query.exe\" and (TargetProcessCommandLine contains \"session >\" or TargetProcessCommandLine contains \"process >\"))|extend RuleId=\"53ef0cef-fa24-4f25-a34a-6c72dfa2e6e2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_query_session_exfil.yml\";\nlet q5=_Im_ProcessCreate\n| where TargetProcessName endswith \"rasdial.exe\"|extend RuleId=\"6bba49bf-7f8c-47d6-a1bb-6b4dece4640e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rasdial_execution.yml\";\nlet q6=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\regedit.exe\" or TargetProcessFilename =~ \"REGEDIT.EXE\") and (TargetProcessCommandLine contains \" /i \" or TargetProcessCommandLine contains \" /s \" or TargetProcessCommandLine contains \".reg\")) and (not(((TargetProcessCommandLine contains \" /e \" or TargetProcessCommandLine contains \" /a \" or TargetProcessCommandLine contains \" /c \" or TargetProcessCommandLine contains \" -e \" or TargetProcessCommandLine contains \" -a \" or TargetProcessCommandLine contains \" -c \") and TargetProcessCommandLine matches regex \":[^ \\\\\\\\]\"))))|extend RuleId=\"73bba97f-a82d-42ce-b315-9182e76c57b1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_regedit_import_keys.yml\";\nlet q7=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\register-cimprovider.exe\" and (TargetProcessCommandLine contains \"-path\" and TargetProcessCommandLine contains \"dll\"))|extend RuleId=\"a2910908-e86f-4687-aeba-76a5f996e652\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_registry_cimprovider_dll_load.yml\";\nlet q8=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"\\\\Software\\\\SimonTatham\\\\PuTTY\\\\Sessions\" or TargetProcessCommandLine contains \"\\\\Software\\\\SimonTatham\\\\PuTTY\\\\SshHostKeys\\\\\" or TargetProcessCommandLine contains \"\\\\Software\\\\Mobatek\\\\MobaXterm\\\\\" or TargetProcessCommandLine contains \"\\\\Software\\\\WOW6432Node\\\\Radmin\\\\v3.0\\\\Server\\\\Parameters\\\\Radmin\" or TargetProcessCommandLine contains \"\\\\Software\\\\Aerofox\\\\FoxmailPreview\" or TargetProcessCommandLine contains \"\\\\Software\\\\Aerofox\\\\Foxmail\\\\V3.1\" or TargetProcessCommandLine contains \"\\\\Software\\\\IncrediMail\\\\Identities\" or TargetProcessCommandLine contains \"\\\\Software\\\\Qualcomm\\\\Eudora\\\\CommandLine\" or TargetProcessCommandLine contains \"\\\\Software\\\\RimArts\\\\B2\\\\Settings\" or TargetProcessCommandLine contains \"\\\\Software\\\\OpenVPN-GUI\\\\configs\" or TargetProcessCommandLine contains \"\\\\Software\\\\Martin Prikryl\\\\WinSCP 2\\\\Sessions\" or TargetProcessCommandLine contains \"\\\\Software\\\\FTPWare\\\\COREFTP\\\\Sites\" or TargetProcessCommandLine contains \"\\\\Software\\\\DownloadManager\\\\Passwords\" or TargetProcessCommandLine contains \"\\\\Software\\\\OpenSSH\\\\Agent\\\\Keys\" or TargetProcessCommandLine contains \"\\\\Software\\\\TightVNC\\\\Server\" or TargetProcessCommandLine contains \"\\\\Software\\\\ORL\\\\WinVNC3\\\\Password\" or TargetProcessCommandLine contains \"\\\\Software\\\\RealVNC\\\\WinVNC4\")|extend RuleId=\"87a476dc-0079-4583-a985-dee7a20a03de\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_registry_enumeration_for_credentials_cli.yml\";\nlet q9=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\TypedPaths\"|extend RuleId=\"ec88289a-7e1a-4cc3-8d18-bd1f60e4b9ba\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_registry_typed_paths_persistence.yml\";\nlet q10=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\regsvr32.exe\" and (TargetProcessCommandLine contains \" /i:\" or TargetProcessCommandLine contains \" -i:\")) and (not((TargetProcessCommandLine contains \" /n \" or TargetProcessCommandLine contains \" -n \"))))|extend RuleId=\"b236190c-1c61-41e9-84b3-3fe03f6d76b0\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_regsvr32_flags_anomaly.yml\";\nlet q11=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessFilename =~ \"REGSVR32.EXE\") and (TargetProcessCommandLine contains \" /i\" or TargetProcessCommandLine contains \" -i\") and (TargetProcessCommandLine contains \"ftp\" or TargetProcessCommandLine contains \"http\"))|extend RuleId=\"867356ee-9352-41c9-a8f2-1be690d78216\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_regsvr32_network_pattern.yml\";\nlet q12=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessFilename =~ \"REGSVR32.EXE\") and (TargetProcessCommandLine contains \":\\\\ProgramData\\\\\" or TargetProcessCommandLine contains \":\\\\Temp\\\\\" or TargetProcessCommandLine contains \":\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\\"))|extend RuleId=\"9525dc73-0327-438c-8c04-13c0e037e9da\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_regsvr32_susp_exec_path_1.yml\";\nlet q13=_Im_ProcessCreate\n| where (((ActingProcessName endswith \"\\\\cmd.exe\" or ActingProcessName endswith \"\\\\cscript.exe\" or ActingProcessName endswith \"\\\\mshta.exe\" or ActingProcessName endswith \"\\\\powershell_ise.exe\" or ActingProcessName endswith \"\\\\powershell.exe\" or ActingProcessName endswith \"\\\\pwsh.exe\" or ActingProcessName endswith \"\\\\wscript.exe\") and TargetProcessName endswith \"\\\\regsvr32.exe\") and (not((ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\cmd.exe\" and TargetProcessCommandLine endswith \" /s C:\\\\Windows\\\\System32\\\\RpcProxy\\\\RpcProxy.dll\"))))|extend RuleId=\"ab37a6ec-6068-432b-a64e-2c7bf95b1d22\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_regsvr32_susp_parent.yml\";\nlet q14=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\regsvr32.exe\" or TargetProcessFilename =~ \"REGSVR32.EXE\") and (not(((TargetProcessCommandLine contains \".ax\" or TargetProcessCommandLine contains \".cpl\" or TargetProcessCommandLine contains \".dll\" or TargetProcessCommandLine contains \".ocx\") or isnull(TargetProcessCommandLine) or TargetProcessCommandLine =~ \"\"))) and (not((TargetProcessCommandLine contains \".ppl\" or TargetProcessCommandLine contains \".bav\"))))|extend RuleId=\"50919691-7302-437f-8e10-1fe088afa145\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_regsvr32_uncommon_extension.yml\";\nlet q15=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"reg\" and TargetProcessCommandLine contains \" ADD \" and TargetProcessCommandLine contains \"Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\")|extend RuleId=\"de587dce-915e-4218-aac4-835ca6af6f70\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_add_run_key.yml\";\nlet q16=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"HKLM\\\\SYSTEM\\\\CurrentControlSet\\\\Control\\\\Lsa\" and TargetProcessCommandLine contains \"scecli\\\\0\" and TargetProcessCommandLine contains \"reg add\")|extend RuleId=\"b7966f4a-b333-455b-8370-8ca53c229762\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_credential_access_via_password_filter.yml\";\nlet q17=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\reg.exe\" and (TargetProcessCommandLine contains \"SOFTWARE\\\\Microsoft\\\\Windows Defender\\\\Exclusions\\\\Paths\" or TargetProcessCommandLine contains \"SOFTWARE\\\\Microsoft\\\\Microsoft Antimalware\\\\Exclusions\\\\Paths\") and (TargetProcessCommandLine contains \"ADD \" and TargetProcessCommandLine contains \"/t \" and TargetProcessCommandLine contains \"REG_DWORD \" and TargetProcessCommandLine contains \"/v \" and TargetProcessCommandLine contains \"/d \" and TargetProcessCommandLine contains \"0\"))|extend RuleId=\"48917adc-a28e-4f5d-b729-11e75da8941f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_defender_exclusion.yml\";\nlet q18=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\reg.exe\" and TargetProcessCommandLine contains \"add\") and (TargetProcessCommandLine contains \"\\\\software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\" or TargetProcessCommandLine contains \"\\\\software\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Winlogon\\\\Userinit\" or TargetProcessCommandLine contains \"\\\\software\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Winlogon\\\\Shell\" or TargetProcessCommandLine contains \"\\\\software\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Windows\" or TargetProcessCommandLine contains \"\\\\software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\User Shell Folders\" or TargetProcessCommandLine contains \"\\\\system\\\\CurrentControlSet\\\\Control\\\\SafeBoot\\\\AlternateShell\"))|extend RuleId=\"24357373-078f-44ed-9ac4-6d334a668a11\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_direct_asep_registry_keys_modification.yml\";\nlet q19=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\reg.exe\" and (TargetProcessCommandLine contains \" query \" and TargetProcessCommandLine contains \"/t \" and TargetProcessCommandLine contains \"REG_SZ\" and TargetProcessCommandLine contains \"/s\")) and ((TargetProcessCommandLine contains \"/f \" and TargetProcessCommandLine contains \"HKLM\") or (TargetProcessCommandLine contains \"/f \" and TargetProcessCommandLine contains \"HKCU\") or TargetProcessCommandLine contains \"HKCU\\\\Software\\\\SimonTatham\\\\PuTTY\\\\Sessions\"))|extend RuleId=\"e0b0c2ab-3d52-46d9-8cb7-049dc775fbd1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_enumeration_for_credentials_in_registry.yml\";\nlet q20=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\reg.exe\" or TargetProcessFilename =~ \"reg.exe\") and TargetProcessCommandLine contains \" import \" and (TargetProcessCommandLine contains \"C:\\\\Users\\\\\" or TargetProcessCommandLine contains \"%temp%\" or TargetProcessCommandLine contains \"%tmp%\" or TargetProcessCommandLine contains \"%appdata%\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or TargetProcessCommandLine contains \"C:\\\\Windows\\\\Temp\\\\\" or TargetProcessCommandLine contains \"C:\\\\ProgramData\\\\\"))|extend RuleId=\"62e0298b-e994-4189-bc87-bc699aa62d97\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_import_from_suspicious_paths.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19, q20;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Discovery", "PrivilegeEscalation", "CredentialAccess", "Persistence", "DefenseEvasion", "Execution"],
                "techniques": ["T1218", "T1059", "T1564", "T1036", "T1555", "T1543", "T1574", "T1027", "T1547", "T1562", "T1556", "T1082", "T1552", "T1112"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000111",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}