{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A5163A102')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A5163A102')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation medium 02",
                "description": "Sigma Windows Process Creation low 02",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\csc\\.exe\" and (TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\Windows\\\\Temp\\\\\")) and (not(((ActingProcessName startswith \"C:\\\\Program Files (x86)\\\\\" or ActingProcessName startswith \"C:\\\\Program Files\\\\\") or ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\sdiagnhost\\.exe\" or ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\inetsrv\\\\w3wp\\.exe\"))) and (not((ActingProcessName =~ \"C:\\\\ProgramData\\\\chocolatey\\\\choco\\.exe\" or ActingProcessCommandLine contains \"\\\\ProgramData\\\\Microsoft\\\\Windows Defender Advanced Threat Protection\" or (ActingProcessCommandLine contains \"JwB7ACIAZgBhAGkAbABlAGQAIgA6AHQAcgB1AGUALAAiAG0AcwBnACIAOgAiAEEAbgBzAGkAYgBsAGUAIAByAGUAcQB1AGkAcgBlAHMAIABQAG8AdwBlAHIAUwBoAGUAbABsACAAdgAzAC4AMAAgAG8AcgAgAG4AZQB3AGUAcgAiAH0AJw\" or ActingProcessCommandLine contains \"cAewAiAGYAYQBpAGwAZQBkACIAOgB0AHIAdQBlACwAIgBtAHMAZwAiADoAIgBBAG4AcwBpAGIAbABlACAAcgBlAHEAdQBpAHIAZQBzACAAUABvAHcAZQByAFMAaABlAGwAbAAgAHYAMwAuADAAIABvAHIAIABuAGUAdwBlAHIAIgB9ACcA\" or ActingProcessCommandLine contains \"nAHsAIgBmAGEAaQBsAGUAZAAiADoAdAByAHUAZQAsACIAbQBzAGcAIgA6ACIAQQBuAHMAaQBiAGwAZQAgAHIAZQBxAHUAaQByAGUAcwAgAFAAbwB3AGUAcgBTAGgAZQBsAGwAIAB2ADMALgAwACAAbwByACAAbgBlAHcAZQByACIAfQAnA\")))))|extend RuleId=\"5163A000-5160-5160-5160-5163A5163A101\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_csc_susp_dynamic_compilation.yml\";\nlet q1=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\csi\\.exe\" or TargetProcessName endswith \"\\\\rcsi\\.exe\") or (TargetProcessFilename =~ \"csi\\.exe\" or TargetProcessFilename =~ \"rcsi\\.exe\")) and TargetProcessFileCompany =~ \"Microsoft Corporation\")|extend RuleId=\"40b95d31-1afc-469e-8d34-9a3a667d058e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_csi_execution.yml\";\nlet q2=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\csvde\\.exe\" or TargetProcessFilename =~ \"csvde\\.exe\") and TargetProcessCommandLine contains \" -f\") and (not(TargetProcessCommandLine contains \" -i\")))|extend RuleId=\"e5d36acd-acb4-4c6f-a13f-9eb203d50099\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_csvde_export.yml\";\nlet q3=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\curl\\.exe\" or TargetProcessFilename =~ \"curl\\.exe\") and (TargetProcessCommandLine matches regex \"\\\\s-c\\\\s\" or TargetProcessCommandLine contains \"--cookie-jar\"))|extend RuleId=\"5a6e1e16-07de-48d8-8aae-faa766c05e88\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_curl_cookie_hijacking.yml\";\nlet q4=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\curl\\.exe\" or TargetProcessFilename =~ \"curl\\.exe\") and (TargetProcessCommandLine matches regex \"\\\\s-H\\\\s\" and TargetProcessCommandLine contains \"User-Agent:\"))|extend RuleId=\"85de1f22-d189-44e4-8239-dc276b45379b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_curl_custom_user_agent.yml\";\nlet q5=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\curl\\.exe\" or TargetProcessFilename =~ \"curl\\.exe\") and TargetProcessCommandLine matches regex \"://[0-9]{1,3}\\\\.[0-9]{1,3}\\\\.[0-9]{1,3}\\\\.[0-9]{1,3}\" and TargetProcessCommandLine contains \"http\" and (TargetProcessCommandLine contains \" -O\" or TargetProcessCommandLine contains \"--remote-name\" or TargetProcessCommandLine contains \"--output\")) and (not((TargetProcessCommandLine endswith \"\\.bat\" or TargetProcessCommandLine endswith \"\\.bat\\\"\" or TargetProcessCommandLine endswith \"\\.dat\" or TargetProcessCommandLine endswith \"\\.dat\\\"\" or TargetProcessCommandLine endswith \"\\.dll\" or TargetProcessCommandLine endswith \"\\.dll\\\"\" or TargetProcessCommandLine endswith \"\\.exe\" or TargetProcessCommandLine endswith \"\\.exe\\\"\" or TargetProcessCommandLine endswith \"\\.gif\" or TargetProcessCommandLine endswith \"\\.gif\\\"\" or TargetProcessCommandLine endswith \"\\.hta\" or TargetProcessCommandLine endswith \"\\.hta\\\"\" or TargetProcessCommandLine endswith \"\\.jpeg\" or TargetProcessCommandLine endswith \"\\.jpeg\\\"\" or TargetProcessCommandLine endswith \"\\.log\" or TargetProcessCommandLine endswith \"\\.log\\\"\" or TargetProcessCommandLine endswith \"\\.msi\" or TargetProcessCommandLine endswith \"\\.msi\\\"\" or TargetProcessCommandLine endswith \"\\.png\" or TargetProcessCommandLine endswith \"\\.png\\\"\" or TargetProcessCommandLine endswith \"\\.ps1\" or TargetProcessCommandLine endswith \"\\.ps1\\\"\" or TargetProcessCommandLine endswith \"\\.psm1\" or TargetProcessCommandLine endswith \"\\.psm1\\\"\" or TargetProcessCommandLine endswith \"\\.vbe\" or TargetProcessCommandLine endswith \"\\.vbe\\\"\" or TargetProcessCommandLine endswith \"\\.vbs\" or TargetProcessCommandLine endswith \"\\.vbs\\\"\" or TargetProcessCommandLine endswith \"\\.bat'\" or TargetProcessCommandLine endswith \"\\.dat'\" or TargetProcessCommandLine endswith \"\\.dll'\" or TargetProcessCommandLine endswith \"\\.exe'\" or TargetProcessCommandLine endswith \"\\.gif'\" or TargetProcessCommandLine endswith \"\\.hta'\" or TargetProcessCommandLine endswith \"\\.jpeg'\" or TargetProcessCommandLine endswith \"\\.log'\" or TargetProcessCommandLine endswith \"\\.msi'\" or TargetProcessCommandLine endswith \"\\.png'\" or TargetProcessCommandLine endswith \"\\.ps1'\" or TargetProcessCommandLine endswith \"\\.psm1'\" or TargetProcessCommandLine endswith \"\\.vbe'\" or TargetProcessCommandLine endswith \"\\.vbs'\"))))|extend RuleId=\"9cc85849-3b02-4cb5-b371-3a1ff54f2218\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_curl_download_direct_ip_exec.yml\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\curl\\.exe\" or TargetProcessFilename =~ \"curl\\.exe\") and (TargetProcessCommandLine matches regex \"\\\\s-k\\\\s\" or TargetProcessCommandLine contains \"--insecure\"))|extend RuleId=\"cb9cc1d1-e84e-4bdc-b7ad-c31b1b7908ec\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_curl_insecure_connection.yml\";\nlet q7=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\curl\\.exe\" or TargetProcessFilename =~ \"curl\\.exe\") and (TargetProcessCommandLine contains \"--doh-insecure\" or TargetProcessCommandLine contains \"--proxy-insecure\"))|extend RuleId=\"2c1486f5-02e8-4f86-9099-b97f2da4ed77\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_curl_insecure_porxy_or_doh.yml\";\nlet q8=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\curl\\.exe\" or TargetProcessFilename =~ \"curl\\.exe\") and TargetProcessCommandLine contains \"file:///\")|extend RuleId=\"aa6f6ea6-0676-40dd-b510-6e46f02d8867\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_curl_local_file_read.yml\";\nlet q9=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\desktopimgdownldr\\.exe\" and ActingProcessName endswith \"\\\\desktopimgdownldr\\.exe\" and TargetProcessCommandLine contains \"/lockscreenurl:http\")|extend RuleId=\"214641c2-c579-4ecb-8427-0cf19df6842e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_desktopimgdownldr_remote_file_download.yml\";\nlet q10=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\deviceenroller\\.exe\" or TargetProcessFilename =~ \"deviceenroller\\.exe\") and TargetProcessCommandLine contains \"/PhoneDeepLink\")|extend RuleId=\"e173ad47-4388-4012-ae62-bd13f71c18a8\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_deviceenroller_dll_sideloading.yml\";\nlet q11=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \" -t msi-install \" and TargetProcessCommandLine contains \" -i http\")|extend RuleId=\"90d50722-0483-4065-8e35-57efaadd354d\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_devinit_lolbin_usage.yml\";\nlet q12=_Im_ProcessCreate\n| where (ActingProcessName contains \"\\\\AppData\\\\Local\\\\Apps\\\\2\\.0\\\\\" and (TargetProcessName endswith \"\\\\calc\\.exe\" or TargetProcessName endswith \"\\\\cmd\\.exe\" or TargetProcessName endswith \"\\\\cscript\\.exe\" or TargetProcessName endswith \"\\\\explorer\\.exe\" or TargetProcessName endswith \"\\\\mshta\\.exe\" or TargetProcessName endswith \"\\\\net\\.exe\" or TargetProcessName endswith \"\\\\net1\\.exe\" or TargetProcessName endswith \"\\\\nltest\\.exe\" or TargetProcessName endswith \"\\\\notepad\\.exe\" or TargetProcessName endswith \"\\\\powershell\\.exe\" or TargetProcessName endswith \"\\\\pwsh\\.exe\" or TargetProcessName endswith \"\\\\reg\\.exe\" or TargetProcessName endswith \"\\\\regsvr32\\.exe\" or TargetProcessName endswith \"\\\\rundll32\\.exe\" or TargetProcessName endswith \"\\\\schtasks\\.exe\" or TargetProcessName endswith \"\\\\werfault\\.exe\" or TargetProcessName endswith \"\\\\wscript\\.exe\"))|extend RuleId=\"67bc0e75-c0a9-4cfc-8754-84a505b63c04\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_dfsvc_suspicious_child_processes.yml\";\nlet q13=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\diskshadow\\.exe\" and (TargetProcessName endswith \"\\\\certutil\\.exe\" or TargetProcessName endswith \"\\\\cscript\\.exe\" or TargetProcessName endswith \"\\\\mshta\\.exe\" or TargetProcessName endswith \"\\\\powershell\\.exe\" or TargetProcessName endswith \"\\\\pwsh\\.exe\" or TargetProcessName endswith \"\\\\regsvr32\\.exe\" or TargetProcessName endswith \"\\\\rundll32\\.exe\" or TargetProcessName endswith \"\\\\wscript\\.exe\"))|extend RuleId=\"9f546b25-5f12-4c8d-8532-5893dcb1e4b8\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_diskshadow_child_process_susp.yml\";\nlet q14=_Im_ProcessCreate\n| where (((TargetProcessFilename =~ \"diskshadow\\.exe\" or TargetProcessName endswith \"\\\\diskshadow\\.exe\") and (TargetProcessCommandLine contains \"/s \" or TargetProcessCommandLine contains \"-s \")) and (not(TargetProcessCommandLine contains \"\\.txt\")))|extend RuleId=\"1dde5376-a648-492e-9e54-4241dd9b0c7f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_diskshadow_script_mode_susp_ext.yml\";\nlet q15=_Im_ProcessCreate\n| where ((TargetProcessFilename =~ \"diskshadow\\.exe\" or TargetProcessName endswith \"\\\\diskshadow\\.exe\") and (TargetProcessCommandLine contains \"/s \" or TargetProcessCommandLine contains \"-s \") and (TargetProcessCommandLine contains \":\\\\Temp\\\\\" or TargetProcessCommandLine contains \":\\\\Windows\\\\Temp\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Local\\\\\" or TargetProcessCommandLine contains \"\\\\AppData\\\\Roaming\\\\\" or TargetProcessCommandLine contains \"\\\\ProgramData\\\\\" or TargetProcessCommandLine contains \"\\\\Users\\\\Public\\\\\"))|extend RuleId=\"fa1a7e52-3d02-435b-81b8-00da14dd66c1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_diskshadow_script_mode_susp_location.yml\";\nlet q16=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\dnscmd\\.exe\" and (TargetProcessCommandLine contains \"/enumrecords\" or TargetProcessCommandLine contains \"/enumzones\" or TargetProcessCommandLine contains \"/ZonePrint\" or TargetProcessCommandLine contains \"/info\"))|extend RuleId=\"b6457d63-d2a2-4e29-859d-4e7affc153d1\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_dnscmd_discovery.yml\";\nlet q17=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"driverquery\\.exe\" or TargetProcessFilename =~ \"drvqry\\.exe\") and (not(((ActingProcessName endswith \"\\\\cscript\\.exe\" or ActingProcessName endswith \"\\\\mshta\\.exe\" or ActingProcessName endswith \"\\\\regsvr32\\.exe\" or ActingProcessName endswith \"\\\\rundll32\\.exe\" or ActingProcessName endswith \"\\\\wscript\\.exe\") or (ActingProcessName contains \"\\\\AppData\\\\Local\\\\\" or ActingProcessName contains \"\\\\Users\\\\Public\\\\\" or ActingProcessName contains \"\\\\Windows\\\\Temp\\\\\")))))|extend RuleId=\"a20def93-0709-4eae-9bd2-31206e21e6b2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_driverquery_usage.yml\";\nlet q18=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\dsacls\\.exe\" or TargetProcessFilename =~ \"DSACLS\\.EXE\") and TargetProcessCommandLine contains \" /G \" and (TargetProcessCommandLine contains \"GR\" or TargetProcessCommandLine contains \"GE\" or TargetProcessCommandLine contains \"GW\" or TargetProcessCommandLine contains \"GA\" or TargetProcessCommandLine contains \"WP\" or TargetProcessCommandLine contains \"WD\"))|extend RuleId=\"01c42d3c-242d-4655-85b2-34f1739632f7\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_dsacls_abuse_permissions.yml\";\nlet q19=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\dsacls\\.exe\" or TargetProcessFilename =~ \"DSACLS\\.EXE\") and (TargetProcessCommandLine contains \"/user:\" and TargetProcessCommandLine contains \"/passwd:\"))|extend RuleId=\"bac9fb54-2da7-44e9-988f-11e9a5edbc0c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_dsacls_password_spray.yml\";\nlet q20=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\DismHost\\.exe\" and (ActingProcessCommandLine contains \"/Online\" and ActingProcessCommandLine contains \"/Disable-Feature\")) or (TargetProcessName endswith \"\\\\Dism\\.exe\" and (TargetProcessCommandLine contains \"/Online\" and TargetProcessCommandLine contains \"/Disable-Feature\")))|extend RuleId=\"43e32da2-fdd0-4156-90de-50dfd62636f9\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_dsim_remove.yml\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19, q20;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["PrivilegeEscalation", "DefenseEvasion", "Discovery", "CommandAndControl", "Execution", "LateralMovement", "Exfiltration"],
                "techniques": ["T1105", "T1218", "T1072", "T1543", "T1027", "T1562", "T1574"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A5163A102",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}