{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000114')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000114')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation low 14",
                "description": "Sigma Windows Process Creation low 14",
                "severity": "low",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"Import-Module \\\"$Env:Temp\\\\\" or TargetProcessCommandLine contains \"Import-Module '$Env:Temp\\\\\" or TargetProcessCommandLine contains \"Import-Module $Env:Temp\\\\\" or TargetProcessCommandLine contains \"Import-Module \\\"$Env:Appdata\\\\\" or TargetProcessCommandLine contains \"Import-Module '$Env:Appdata\\\\\" or TargetProcessCommandLine contains \"Import-Module $Env:Appdata\\\\\" or TargetProcessCommandLine contains \"Import-Module C:\\\\Users\\\\Public\\\\\" or TargetProcessCommandLine contains \"ipmo \\\"$Env:Temp\\\\\" or TargetProcessCommandLine contains \"ipmo '$Env:Temp\\\\\" or TargetProcessCommandLine contains \"ipmo $Env:Temp\\\\\" or TargetProcessCommandLine contains \"ipmo \\\"$Env:Appdata\\\\\" or TargetProcessCommandLine contains \"ipmo '$Env:Appdata\\\\\" or TargetProcessCommandLine contains \"ipmo $Env:Appdata\\\\\" or TargetProcessCommandLine contains \"ipmo C:\\\\Users\\\\Public\\\\\")|extend RuleId=\"c31364f7-8be6-4b77-8483-dd2b5a7b69a3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_import_module_susp_dirs.yml\"|extend RuleTitle=\"Import PowerShell Modules From Suspicious Directories - ProcCreation\"|extend RuleDescription=\"Detects powershell scripts that import modules from suspicious directories\";\nlet q1=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and (TargetProcessCommandLine contains \"Add-AppPackage \" or TargetProcessCommandLine contains \"Add-AppxPackage \") and TargetProcessCommandLine contains \" -AllowUnsigned\")|extend RuleId=\"37651c2a-42cd-4a69-ae0d-22a4349aa04a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_install_unsigned_appx_packages.yml\"|extend RuleTitle=\"Unsigned AppX Installation Attempt Using Add-AppxPackage\"|extend RuleDescription=\"Detects usage of the \\\"Add-AppxPackage\\\" or it's alias \\\"Add-AppPackage\\\" to install unsigned AppX packages\";\nlet q2=_Im_ProcessCreate\n| where (((TargetProcessCommandLine contains \"-nop\" and TargetProcessCommandLine contains \" -w \" and TargetProcessCommandLine contains \"hidden\" and TargetProcessCommandLine contains \" -c \" and TargetProcessCommandLine contains \"[Convert]::FromBase64String\") or (TargetProcessCommandLine contains \" -w \" and TargetProcessCommandLine contains \"hidden\" and TargetProcessCommandLine contains \"-noni\" and TargetProcessCommandLine contains \"-nop\" and TargetProcessCommandLine contains \" -c \" and TargetProcessCommandLine contains \"iex\" and TargetProcessCommandLine contains \"New-Object\") or (TargetProcessCommandLine contains \" -w \" and TargetProcessCommandLine contains \"hidden\" and TargetProcessCommandLine contains \"-ep\" and TargetProcessCommandLine contains \"bypass\" and TargetProcessCommandLine contains \"-Enc\") or (TargetProcessCommandLine contains \"powershell\" and TargetProcessCommandLine contains \"reg\" and TargetProcessCommandLine contains \"add\" and TargetProcessCommandLine contains \"\\\\software\\\\\") or (TargetProcessCommandLine contains \"bypass\" and TargetProcessCommandLine contains \"-noprofile\" and TargetProcessCommandLine contains \"-windowstyle\" and TargetProcessCommandLine contains \"hidden\" and TargetProcessCommandLine contains \"new-object\" and TargetProcessCommandLine contains \"system.net.webclient\" and TargetProcessCommandLine contains \".download\") or (TargetProcessCommandLine contains \"iex\" and TargetProcessCommandLine contains \"New-Object\" and TargetProcessCommandLine contains \"Net.WebClient\" and TargetProcessCommandLine contains \".Download\")) and (not((TargetProcessCommandLine contains \"(New-Object System.Net.WebClient).DownloadString('https://community.chocolatey.org/install.ps1\" or TargetProcessCommandLine contains \"Write-ChocolateyWarning\"))))|extend RuleId=\"536e2947-3729-478c-9903-745aaffe60d2\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_invocation_specific.yml\"|extend RuleTitle=\"Suspicious PowerShell Invocations - Specific - ProcessCreation\"|extend RuleDescription=\"Detects suspicious PowerShell invocation command parameters\";\nlet q3=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and (TargetProcessCommandLine contains \"curl \" or TargetProcessCommandLine contains \"Invoke-WebRequest\" or TargetProcessCommandLine contains \"iwr \" or TargetProcessCommandLine contains \"wget \") and (TargetProcessCommandLine contains \"://1\" or TargetProcessCommandLine contains \"://2\" or TargetProcessCommandLine contains \"://3\" or TargetProcessCommandLine contains \"://4\" or TargetProcessCommandLine contains \"://5\" or TargetProcessCommandLine contains \"://6\" or TargetProcessCommandLine contains \"://7\" or TargetProcessCommandLine contains \"://8\" or TargetProcessCommandLine contains \"://9\"))|extend RuleId=\"1edff897-9146-48d2-9066-52e8d8f80a2f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_invoke_webrequest_direct_ip.yml\"|extend RuleTitle=\"Suspicious Invoke-WebRequest Execution With DirectIP\"|extend RuleDescription=\"Detects calls to PowerShell with Invoke-WebRequest cmdlet using direct IP access\";\nlet q4=_Im_ProcessCreate\n| where TargetProcessCommandLine contains \"Install-TransportAgent\"|extend RuleId=\"83809e84-4475-4b69-bc3e-4aad8568612f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_msexchange_transport_agent.yml\"|extend RuleTitle=\"MSExchange Transport Agent Installation\"|extend RuleDescription=\"Detects the Installation of a Exchange Transport Agent\";\nlet q5=_Im_ProcessCreate\n| where (((ActingProcessName endswith \"\\\\wscript.exe\" or ActingProcessName endswith \"\\\\cscript.exe\") and (TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\")) and (not(TargetProcessCurrentDirectory contains \"\\\\Health Service State\\\\\")))|extend RuleId=\"95eadcb2-92e4-4ed1-9031-92547773a6db\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_script_engine_parent.yml\"|extend RuleTitle=\"Suspicious PowerShell Invocation From Script Engines\"|extend RuleDescription=\"Detects suspicious powershell invocations from interpreters or unusual programs\";\nlet q6=_Im_ProcessCreate\n| where (((TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\") or (TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\")) and (TargetProcessCommandLine contains \"-executionpolicy \" or TargetProcessCommandLine contains \" -ep \" or TargetProcessCommandLine contains \" -exec \") and (TargetProcessCommandLine contains \"Bypass\" or TargetProcessCommandLine contains \"Unrestricted\"))|extend RuleId=\"87e3c4e8-a6a8-4ad9-bb4f-46e7ff99a180\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_set_policies_to_unsecure_level.yml\"|extend RuleTitle=\"Change PowerShell Policies to an Insecure Level\"|extend RuleDescription=\"Detects changing the PowerShell script execution policy to a potentially insecure level using the \\\"-ExecutionPolicy\\\" flag.\";\nlet q7=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessFilename =~ \"PowerShell.EXE\") and ((TargetProcessCommandLine contains \"Set-Service\" and TargetProcessCommandLine contains \"-StartupType\") and (TargetProcessCommandLine contains \"Disabled\" or TargetProcessCommandLine contains \"Manual\")))|extend RuleId=\"62b20d44-1546-4e61-afce-8e175eb9473c\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_set_service_disabled.yml\"|extend RuleTitle=\"Service StartupType Change Via PowerShell Set-Service\"|extend RuleDescription=\"Detects the use of the PowerShell \\\"Set-Service\\\" cmdlet to change the startup type of a service to \\\"disabled\\\" or \\\"manual\\\"\";\nlet q8=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"powershell.exe\" or TargetProcessCommandLine contains \"\\\\powershell\" or TargetProcessCommandLine contains \"\\\\pwsh\" or TargetProcessCommandLine contains \"pwsh.exe\") and ((TargetProcessCommandLine contains \"/c \" and TargetProcessCommandLine contains \"\\\\AppData\\\\\") and (TargetProcessCommandLine contains \"Local\\\\\" or TargetProcessCommandLine contains \"Roaming\\\\\")))|extend RuleId=\"ac175779-025a-4f12-98b0-acdaeb77ea85\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_susp_ps_appdata.yml\"|extend RuleTitle=\"PowerShell Script Run in AppData\"|extend RuleDescription=\"Detects a suspicious command line execution that invokes PowerShell with reference to an AppData folder\";\nlet q9=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\")) and ((TargetProcessCommandLine contains \"Get-ADUser \" and TargetProcessCommandLine contains \" -Filter \\\\*\") and (TargetProcessCommandLine contains \" > \" or TargetProcessCommandLine contains \" | Select \" or TargetProcessCommandLine contains \"Out-File\" or TargetProcessCommandLine contains \"Set-Content\" or TargetProcessCommandLine contains \"Add-Content\")))|extend RuleId=\"1114e048-b69c-4f41-bc20-657245ae6e3f\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_user_discovery_get_aduser.yml\"|extend RuleTitle=\"User Discovery And Export Via Get-ADUser Cmdlet\"|extend RuleDescription=\"Detects usage of the Get-ADUser cmdlet to collect user information and output it to a file\";\nlet q10=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"X509Enrollment.CBinaryConverter\" or TargetProcessCommandLine contains \"884e2002-217d-11da-b2a4-000e7bbb2b09\")|extend RuleId=\"114de787-4eb2-48cc-abdb-c0b449f93ea4\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_x509enrollment.yml\"|extend RuleTitle=\"Suspicious X509Enrollment - Process Creation\"|extend RuleDescription=\"Detect use of X509Enrollment\";\nlet q11=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\powershell.exe\" or TargetProcessName endswith \"\\\\pwsh.exe\") or (TargetProcessFilename =~ \"PowerShell.EXE\" or TargetProcessFilename =~ \"pwsh.dll\") or TargetProcessFileDescription =~ \"Windows PowerShell\" or TargetProcessFileProduct =~ \"PowerShell Core 6\") and TargetProcessCommandLine contains \"bxor\" and (TargetProcessCommandLine contains \"ForEach\" or TargetProcessCommandLine contains \"for(\" or TargetProcessCommandLine contains \"for \" or TargetProcessCommandLine contains \"-join \" or TargetProcessCommandLine contains \"-join'\" or TargetProcessCommandLine contains \"-join\\\"\" or TargetProcessCommandLine contains \"-join`\" or TargetProcessCommandLine contains \"::Join\" or TargetProcessCommandLine contains \"[char]\"))|extend RuleId=\"bb780e0c-16cf-4383-8383-1e5471db6cf9\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_xor_commandline.yml\"|extend RuleTitle=\"Suspicious XOR Encoded PowerShell Command\"|extend RuleDescription=\"Detects presence of a potentially xor encoded powershell command\";\nlet q12=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \"*Compress-Archive -Path*-DestinationPath $env:TEMP*\" or TargetProcessCommandLine contains \"*Compress-Archive -Path*-DestinationPath*\\\\AppData\\\\Local\\\\Temp\\\\*\" or TargetProcessCommandLine contains \"*Compress-Archive -Path*-DestinationPath*:\\\\Windows\\\\Temp\\\\*\")|extend RuleId=\"85a8e5ba-bd03-4bfb-bbfa-a4409a8f8b98\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_zip_compress.yml\"|extend RuleTitle=\"Folder Compress To Potentially Suspicious Output Via Compress-Archive Cmdlet\"|extend RuleDescription=\"Detects PowerShell scripts that make use of the \\\"Compress-Archive\\\" Cmdlet in order to compress folders and files where the output is stored in a potentially suspicious location that is used often by malware for exfiltration.\\nAn adversary might compress data (e.g., sensitive documents) that is collected prior to exfiltration in order to make it portable and minimize the amount of data sent over the network.\\n\";\nlet q13=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\presentationhost.exe\" or TargetProcessFilename =~ \"PresentationHost.exe\") and (TargetProcessCommandLine contains \"http://\" or TargetProcessCommandLine contains \"https://\" or TargetProcessCommandLine contains \"ftp://\"))|extend RuleId=\"b124ddf4-778d-418e-907f-6dd3fc0d31cd\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_presentationhost_download.yml\"|extend RuleTitle=\"Arbitrary File Download Via PresentationHost.EXE\"|extend RuleDescription=\"Detects usage of \\\"PresentationHost\\\" which is a utility that runs \\\".xbap\\\" (Browser Applications) files to download arbitrary files\";\nunion q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "CommandAndControl", "Collection", "Persistence", "Discovery", "Execution"],
                "techniques": ["T1218", "T1140", "T1027", "T1553", "T1105", "T1074", "T1505", "T1562", "T1059", "T1033"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000114",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}