{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000234')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000234')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation high 34",
                "description": "Sigma Windows Process Creation medium 34",
                "severity": "medium",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where (((ActingProcessName endswith \"\\\\w3wpexe\" or ActingProcessName endswith \"\\\\php-cgiexe\" or ActingProcessName endswith \"\\\\nginxexe\" or ActingProcessName endswith \"\\\\httpdexe\" or ActingProcessName endswith \"\\\\caddyexe\" or ActingProcessName endswith \"\\\\ws_tomcatserviceexe\") or ((ActingProcessName endswith \"\\\\javaexe\" or ActingProcessName endswith \"\\\\javawexe\") and (ActingProcessName contains \"-tomcat-\" or ActingProcessName contains \"\\\\tomcat\")) or ((ActingProcessName endswith \"\\\\javaexe\" or ActingProcessName endswith \"\\\\javawexe\") and (TargetProcessCommandLine contains \"catalinajar\" or TargetProcessCommandLine contains \"CATALINA_HOME\"))) and ((TargetProcessCommandLine contains \"rundll32\" and TargetProcessCommandLine contains \"comsvcs\") or (TargetProcessCommandLine contains \" -hp\" and TargetProcessCommandLine contains \" a \" and TargetProcessCommandLine contains \" -m\") or (TargetProcessCommandLine contains \"net\" and TargetProcessCommandLine contains \" user \" and TargetProcessCommandLine contains \" /add\") or (TargetProcessCommandLine contains \"net\" and TargetProcessCommandLine contains \" localgroup \" and TargetProcessCommandLine contains \" administrators \" and TargetProcessCommandLine contains \"/add\") or (TargetProcessName endswith \"\\\\ntdsutilexe\" or TargetProcessName endswith \"\\\\ldifdeexe\" or TargetProcessName endswith \"\\\\adfindexe\" or TargetProcessName endswith \"\\\\procdumpexe\" or TargetProcessName endswith \"\\\\Nanodumpexe\" or TargetProcessName endswith \"\\\\vssadminexe\" or TargetProcessName endswith \"\\\\fsutilexe\") or (TargetProcessCommandLine contains \" -NoP \" or TargetProcessCommandLine contains \" -W Hidden \" or TargetProcessCommandLine contains \" -decode \" or TargetProcessCommandLine contains \" /decode \" or TargetProcessCommandLine contains \"reg save \" or TargetProcessCommandLine contains \"downloadstring(\" or TargetProcessCommandLine contains \"downloadfile(\" or TargetProcessCommandLine contains \"FromBase64String\" or TargetProcessCommandLine contains \" /ticket:\" or TargetProcessCommandLine contains \" sekurlsa\" or TargetProcessCommandLine contains \"dmp full\" or TargetProcessCommandLine contains \"process call create\" or TargetProcessCommandLine contains \"whoami /priv\")))|extend RuleId=\"5163A000-5160-5160-5160-5163A0000233\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_webshell_hacking.yml\";\nlet q1=_Im_ProcessCreate\n| where (((ActingProcessName endswith \"\\\\w3wpexe\" or ActingProcessName endswith \"\\\\php-cgiexe\" or ActingProcessName endswith \"\\\\nginxexe\" or ActingProcessName endswith \"\\\\httpdexe\" or ActingProcessName endswith \"\\\\caddyexe\" or ActingProcessName endswith \"\\\\ws_tomcatserviceexe\") or ((ActingProcessName endswith \"\\\\javaexe\" or ActingProcessName endswith \"\\\\javawexe\") and (ActingProcessName contains \"-tomcat-\" or ActingProcessName contains \"\\\\tomcat\")) or ((ActingProcessName endswith \"\\\\javaexe\" or ActingProcessName endswith \"\\\\javawexe\") and (TargetProcessCommandLine contains \"catalinajar\" or TargetProcessCommandLine contains \"CATALINA_HOME\"))) and (TargetProcessCommandLine contains \"perl --help\" or TargetProcessCommandLine contains \"python --help\" or TargetProcessCommandLine contains \"python -h\" or TargetProcessCommandLine contains \"python3 --help\" or TargetProcessCommandLine contains \"python3 -h\" or TargetProcessCommandLine contains \"wget --help\" or TargetProcessCommandLine contains \"perl -h\"))|extend RuleId=\"f64e5c19-879c-4bae-b471-6d84c8339677\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_webshell_recon_detection.yml\";\nlet q2=_Im_ProcessCreate\n| where (((ActingProcessName endswith \"\\\\w3wpexe\" or ActingProcessName endswith \"\\\\phpexe\" or ActingProcessName endswith \"\\\\php-cgiexe\" or ActingProcessName endswith \"\\\\nginxexe\" or ActingProcessName endswith \"\\\\httpdexe\" or ActingProcessName endswith \"\\\\caddyexe\" or ActingProcessName endswith \"\\\\ws_TomcatServiceexe\" or ActingProcessName endswith \"\\\\tomcatexe\" or ActingProcessName endswith \"\\\\UMWorkerProcessexe\") or ((ActingProcessName endswith \"\\\\javaexe\" or ActingProcessName endswith \"\\\\javawexe\") and (ActingProcessName contains \"-tomcat-\" or ActingProcessName contains \"\\\\tomcat\")) or ((ActingProcessName endswith \"\\\\javaexe\" or ActingProcessName endswith \"\\\\javawexe\") and (ActingProcessCommandLine contains \"catalinajar\" or ActingProcessCommandLine contains \"CATALINA_HOME\" or ActingProcessCommandLine contains \"catalinahome\"))) and (TargetProcessName endswith \"\\\\cmdexe\" or TargetProcessName endswith \"\\\\cscriptexe\" or TargetProcessName endswith \"\\\\shexe\" or TargetProcessName endswith \"\\\\bashexe\" or TargetProcessName endswith \"\\\\powershellexe\" or TargetProcessName endswith \"\\\\powershell_iseexe\" or TargetProcessName endswith \"\\\\pwshexe\" or TargetProcessName endswith \"\\\\bitsadminexe\" or TargetProcessName endswith \"\\\\arpexe\" or TargetProcessName endswith \"\\\\atexe\" or TargetProcessName endswith \"\\\\certutilexe\" or TargetProcessName endswith \"\\\\dsgetexe\" or TargetProcessName endswith \"\\\\dsqueryexe\" or TargetProcessName endswith \"\\\\findexe\" or TargetProcessName endswith \"\\\\findstrexe\" or TargetProcessName endswith \"\\\\fsutilexe\" or TargetProcessName endswith \"\\\\hostnameexe\" or TargetProcessName endswith \"\\\\ipconfigexe\" or TargetProcessName endswith \"\\\\nbtstatexe\" or TargetProcessName endswith \"\\\\netexe\" or TargetProcessName endswith \"\\\\net1exe\" or TargetProcessName endswith \"\\\\netdomexe\" or TargetProcessName endswith \"\\\\netshexe\" or TargetProcessName endswith \"\\\\netstatexe\" or TargetProcessName endswith \"\\\\nltestexe\" or TargetProcessName endswith \"\\\\nslookupexe\" or TargetProcessName endswith \"\\\\ntdutilexe\" or TargetProcessName endswith \"\\\\pathpingexe\" or TargetProcessName endswith \"\\\\pingexe\" or TargetProcessName endswith \"\\\\qprocessexe\" or TargetProcessName endswith \"\\\\queryexe\" or TargetProcessName endswith \"\\\\qwinstaexe\" or TargetProcessName endswith \"\\\\regexe\" or TargetProcessName endswith \"\\\\rundll32exe\" or TargetProcessName endswith \"\\\\scexe\" or TargetProcessName endswith \"\\\\schtasksexe\" or TargetProcessName endswith \"\\\\systeminfoexe\" or TargetProcessName endswith \"\\\\tasklistexe\" or TargetProcessName endswith \"\\\\tracertexe\" or TargetProcessName endswith \"\\\\verexe\" or TargetProcessName endswith \"\\\\vssadminexe\" or TargetProcessName endswith \"\\\\wevtutilexe\" or TargetProcessName endswith \"\\\\whoamiexe\" or TargetProcessName endswith \"\\\\wmicexe\" or TargetProcessName endswith \"\\\\wscriptexe\" or TargetProcessName endswith \"\\\\wusaexe\") and (not((TargetProcessCommandLine endswith \"Windows\\\\system32\\\\cmdexe /c C:\\\\ManageEngine\\\\ADManager \\\"Plus\\\\ES\\\\bin\\\\elasticsearchbat -Enodename=RMP-NODE1 -pelasticsearch-pidtxt\" or (TargetProcessCommandLine contains \"sc query\" and TargetProcessCommandLine contains \"ADManager Plus\")))))|extend RuleId=\"8202070f-edeb-4d31-a010-a26c72ac5600\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_webshell_spawn.yml\";\nlet q3=_Im_ProcessCreate\n| where (((TargetProcessName endswith \"\\\\Werfaultexe\" or TargetProcessFilename =~ \"WerFaultexe\") and ((ParentUser contains \"AUTHORI\" or ParentUser contains \"AUTORI\") and (TargetUsername contains \"AUTHORI\" or TargetUsername contains \"AUTORI\") and (TargetProcessCommandLine contains \" -u -p \" and TargetProcessCommandLine contains \" -ip \" and TargetProcessCommandLine contains \" -s \"))) and (not(ActingProcessName =~ \"C:\\\\Windows\\\\System32\\\\lsassexe\")))|extend RuleId=\"9a4ccd1a-3526-4d99-b980-9f9c5d3a6ff3\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_werfault_lsass_shtinkering.yml\";\nlet q4=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\wermgrexe\" and (TargetProcessName endswith \"\\\\cmdexe\" or TargetProcessName endswith \"\\\\cscriptexe\" or TargetProcessName endswith \"\\\\ipconfigexe\" or TargetProcessName endswith \"\\\\mshtaexe\" or TargetProcessName endswith \"\\\\netexe\" or TargetProcessName endswith \"\\\\net1exe\" or TargetProcessName endswith \"\\\\netstatexe\" or TargetProcessName endswith \"\\\\nslookupexe\" or TargetProcessName endswith \"\\\\powershell_iseexe\" or TargetProcessName endswith \"\\\\powershellexe\" or TargetProcessName endswith \"\\\\pwshexe\" or TargetProcessName endswith \"\\\\regsvr32exe\" or TargetProcessName endswith \"\\\\rundll32exe\" or TargetProcessName endswith \"\\\\systeminfoexe\" or TargetProcessName endswith \"\\\\whoamiexe\" or TargetProcessName endswith \"\\\\wscriptexe\"))|extend RuleId=\"396f6630-f3ac-44e3-bfc8-1b161bc00c4e\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wermgr_susp_child_process.yml\";\nlet q5=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\wermgrexe\" and (not((TargetProcessName startswith \"C:\\\\Windows\\\\System32\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\SysWOW64\\\\\" or TargetProcessName startswith \"C:\\\\Windows\\\\WinSxS\\\\\"))))|extend RuleId=\"5394fcc7-aeb2-43b5-9a09-cac9fc5edcd5\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wermgr_susp_exec_location.yml\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\wgetexe\" or TargetProcessFilename =~ \"wgetexe\") and TargetProcessCommandLine matches regex \"://[0-9]{1,3}\\\\.[0-9]{1,3}\\\\.[0-9]{1,3}\\\\.[0-9]{1,3}\" and TargetProcessCommandLine contains \"http\" and (TargetProcessCommandLine matches regex \"\\\\s-O\\\\s\" or TargetProcessCommandLine contains \"--output-document\") and (TargetProcessCommandLine endswith \"ps1\" or TargetProcessCommandLine endswith \"ps1'\" or TargetProcessCommandLine endswith \"ps1\\\"\" or TargetProcessCommandLine endswith \"dat\" or TargetProcessCommandLine endswith \"dat'\" or TargetProcessCommandLine endswith \"dat\\\"\" or TargetProcessCommandLine endswith \"msi\" or TargetProcessCommandLine endswith \"msi'\" or TargetProcessCommandLine endswith \"msi\\\"\" or TargetProcessCommandLine endswith \"bat\" or TargetProcessCommandLine endswith \"bat'\" or TargetProcessCommandLine endswith \"bat\\\"\" or TargetProcessCommandLine endswith \"exe\" or TargetProcessCommandLine endswith \"exe'\" or TargetProcessCommandLine endswith \"exe\\\"\" or TargetProcessCommandLine endswith \"vbs\" or TargetProcessCommandLine endswith \"vbs'\" or TargetProcessCommandLine endswith \"vbs\\\"\" or TargetProcessCommandLine endswith \"vbe\" or TargetProcessCommandLine endswith \"vbe'\" or TargetProcessCommandLine endswith \"vbe\\\"\" or TargetProcessCommandLine endswith \"hta\" or TargetProcessCommandLine endswith \"hta'\" or TargetProcessCommandLine endswith \"hta\\\"\" or TargetProcessCommandLine endswith \"dll\" or TargetProcessCommandLine endswith \"dll'\" or TargetProcessCommandLine endswith \"dll\\\"\" or TargetProcessCommandLine endswith \"psm1\" or TargetProcessCommandLine endswith \"psm1'\" or TargetProcessCommandLine endswith \"psm1\\\"\"))|extend RuleId=\"17f0c0a8-8bd5-4ee0-8c5f-a342c0199f35\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wget_download_direct_ip.yml\";\nunion q0, q1, q2, q3, q4, q5, q6;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["Persistence", "InitialAccess", "Execution", "DefenseEvasion", "PrivilegeEscalation", "Discovery", "CredentialAccess"],
                "techniques": ["T1505", "T1055", "T1033", "T1190", "T1036", "T1003", "T1018", "T1087"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000234",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}