{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5163A000-5160-5160-5160-5163A0000002')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5163A000-5160-5160-5160-5163A0000002')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Sigma Windows Process Creation informational 02",
                "description": "Sigma Windows Process Creation informational 02",
                "severity": "informational",
                "enabled": false,
                "query": "let q0=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\svchost.exe\" or TargetProcessName endswith \"\\\\taskhost.exe\" or TargetProcessName endswith \"\\\\lsm.exe\" or TargetProcessName endswith \"\\\\lsass.exe\" or TargetProcessName endswith \"\\\\services.exe\" or TargetProcessName endswith \"\\\\lsaiso.exe\" or TargetProcessName endswith \"\\\\csrss.exe\" or TargetProcessName endswith \"\\\\wininit.exe\" or TargetProcessName endswith \"\\\\winlogon.exe\") and (not((((ActingProcessName endswith \"\\\\SavService.exe\" or ActingProcessName endswith \"\\\\ngen.exe\") or (ActingProcessName contains \"\\\\System32\\\\\" or ActingProcessName contains \"\\\\SysWOW64\\\\\")) or ((ActingProcessName contains \"\\\\Windows Defender\\\\\" or ActingProcessName contains \"\\\\Microsoft Security Client\\\\\") and ActingProcessName endswith \"\\\\MsMpEng.exe\") or (isnull(ActingProcessName) or ActingProcessName =~ \"-\")))))|extend RuleId=\"96036718-71cc-4027-a538-d1587e0006a7\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_proc_wrong_parent.yml\"|extend RuleTitle=\"Windows Processes Suspicious Parent Directory\"|extend RuleDescription=\"Detect suspicious parent processes of well-known Windows processes\";\nlet q1=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\te.exe\" or ActingProcessName endswith \"\\\\te.exe\" or TargetProcessFilename =~ \"\\\\te.exe\")|extend RuleId=\"634b00d5-ccc3-4a06-ae3b-0ec8444dd51b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_use_of_te_bin.yml\"|extend RuleTitle=\"Malicious Windows Script Components File Execution by TAEF Detection\"|extend RuleDescription=\"Windows Test Authoring and Execution Framework (TAEF) framework allows you to run automation by executing tests files written on different languages (C, C#, Microsoft COM Scripting interfaces\nAdversaries may execute malicious code (such as WSC file with VBScript, dll and so on) directly by running te.exe\n\";\nlet q2=_Im_ProcessCreate\n| where (TargetProcessCommandLine contains \" -accepteula\" or TargetProcessCommandLine contains \" /accepteula\")|extend RuleId=\"7cccd811-7ae9-4ebe-9afd-cb5c406b824b\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_eula_accepted.yml\"|extend RuleTitle=\"Potential Execution of Sysinternals Tools\"|extend RuleDescription=\"Detects command lines that contain the 'accepteula' flag which could be a sign of execution of one of the Sysinternals tools\";\nlet q3=_Im_ProcessCreate\n| where (TargetProcessName endswith \"\\\\systeminfo.exe\" or TargetProcessFilename =~ \"sysinfo.exe\")|extend RuleId=\"0ef56343-059e-4cb6-adc1-4c3c967c5e46\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_systeminfo_execution.yml\"|extend RuleTitle=\"Suspicious Execution of Systeminfo\"|extend RuleDescription=\"Detects usage of the \"systeminfo\" command to retrieve information\";\nlet q4=_Im_ProcessCreate\n| where (ActingProcessName endswith \"\\\\taskmgr.exe\" and (not((TargetProcessName endswith \"\\\\resmon.exe\" or TargetProcessName endswith \"\\\\mmc.exe\" or TargetProcessName endswith \"\\\\taskmgr.exe\"))))|extend RuleId=\"3d7679bd-0c00-440c-97b0-3f204273e6c7\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_taskmgr_susp_child_process.yml\"|extend RuleTitle=\"Taskmgr as Parent\"|extend RuleDescription=\"Detects the creation of a process from Windows task manager\";\nlet q5=_Im_ProcessCreate\n| where ((TargetProcessCommandLine contains \"VBoxRT.dll,RTR3Init\" or TargetProcessCommandLine contains \"VBoxC.dll\" or TargetProcessCommandLine contains \"VBoxDrv.sys\") or (TargetProcessCommandLine contains \"startvm\" or TargetProcessCommandLine contains \"controlvm\"))|extend RuleId=\"bab049ca-7471-4828-9024-38279a4c04da\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_virtualbox_execution.yml\"|extend RuleTitle=\"Detect Virtualbox Driver Installation OR Starting Of VMs\"|extend RuleDescription=\"Adversaries can carry out malicious operations using a virtual instance to avoid detection. This rule is built to detect the registration of the Virtualbox driver or start of a Virtualbox VM.\";\nlet q6=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\where.exe\" or TargetProcessFilename =~ \"where.exe\") and (TargetProcessCommandLine contains \"places.sqlite\" or TargetProcessCommandLine contains \"cookies.sqlite\" or TargetProcessCommandLine contains \"formhistory.sqlite\" or TargetProcessCommandLine contains \"logins.json\" or TargetProcessCommandLine contains \"key4.db\" or TargetProcessCommandLine contains \"key3.db\" or TargetProcessCommandLine contains \"sessionstore.jsonlz4\" or TargetProcessCommandLine contains \"History\" or TargetProcessCommandLine contains \"Bookmarks\" or TargetProcessCommandLine contains \"Cookies\" or TargetProcessCommandLine contains \"Login Data\"))|extend RuleId=\"725a9768-0f5e-4cb3-aec2-bc5719c6831a\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_where_browser_data_recon.yml\"|extend RuleTitle=\"Suspicious Where Execution\"|extend RuleDescription=\"Adversaries may enumerate browser bookmarks to learn more about compromised hosts.\nBrowser bookmarks may reveal personal information about users (ex: banking sites, interests, social media, etc.) as well as details about\ninternal network resources such as servers, tools/dashboards, or other related infrastructure.\n\";\nlet q7=_Im_ProcessCreate\n| where ((TargetProcessName endswith \"\\\\wmic.exe\" or TargetProcessFilename =~ \"wmic.exe\") and TargetProcessCommandLine contains \" group\")|extend RuleId=\"164eda96-11b2-430b-85ff-6a265c15bf32\"|extend SourceURL=\"https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wmic_recon_group.yml\"|extend RuleTitle=\"Local Groups Reconnaissance Via Wmic.EXE\"|extend RuleDescription=\"Detects the execution of \"wmic\" with the \"group\" flag.\nAdversaries may attempt to find local system groups and permission settings.\nThe knowledge of local system permission groups can help adversaries determine which groups exist and which users belong to a particular group.\nAdversaries may use this information to determine which users have elevated permissions, such as the users found within the local administrators group.\n\";\nunion q0, q1, q2, q3, q4, q5, q6, q7;",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": ["DefenseEvasion", "Discovery", "ResourceDevelopment"],
                "techniques": ["T1082", "T1217", "T1588", "T1218", "T1036", "T1069", "T1564"],
                "alertRuleTemplateName": "5163A000-5160-5160-5160-5163A0000002",
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": null,
                        "groupByCustomDetails": null
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },                
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "{{RuleTitle}} ",
                    "alertDescriptionFormat": "{{RuleDescription}} ",
                    "alertDynamicProperties": [
                        {
                            "alertProperty": "ExtendedLinks",
                            "value": "SourceURL"
                        },
                        {
                            "alertProperty": "ProductComponentName",
                            "value": "RuleId"
                        }
                    ]
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ActorUsername"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Dvc"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "TargetProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "TargetProcessCommandLine"
                            },
                            {
                                "identifier": "ElevationToken",
                                "columnName": "TargetProcessTokenElevation"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Algorithm",
                                "columnName": "HashType"
                            },
                            {
                                "identifier": "Value",
                                "columnName": "Hash"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Directory",
                                "columnName": "TargetProcessCurrentDirectory"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "TargetProcessName"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "ProcessId",
                                "columnName": "ActingProcessId"
                            },
                            {
                                "identifier": "CommandLine",
                                "columnName": "ActingProcessCommandLine"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": "1.0.0"
            }
        }
    ]
}